{"Id": 4, "PostId": 1, "Score": 0, "Text": "I think that it would be appropriate, if we know the location of the OP, to include a reference to the legal point for the age of consent. I know in the Legal.SE, they require answers to be backed up with citations of official sources, so if we allow such a \"legal\" question, we should demand official citations as well.", "CreationDate": "2015-07-28T19:07:51.587", "UserId": 75}
{"Id": 95, "PostId": 1, "Score": 0, "Text": "What questions? Have we had one? Do you have some in mind?", "CreationDate": "2015-07-29T20:38:03.420", "UserId": 64}
{"Id": 96, "PostId": 1, "Score": 0, "Text": "@Flimzy no, just asking before everything kicks off", "CreationDate": "2015-07-29T20:43:51.857", "UserId": 3}
{"Id": 97, "PostId": 1, "Score": 0, "Text": "Unclear what I'm asking..?", "CreationDate": "2015-07-29T20:44:14.690", "UserId": 3}
{"Id": 98, "PostId": 1, "Score": 0, "Text": "@Tim: I think we need at least some theoretical sample questions before we can know how to answer this. Otherwise it seems like a solution looking for a problem.", "CreationDate": "2015-07-29T20:44:23.373", "UserId": 64}
{"Id": 99, "PostId": 1, "Score": 0, "Text": "\"What will we do with these questions?\" \"What questions? Do you have some in mind?\" \"No.\" -- That's pretty unclear what you're asking.", "CreationDate": "2015-07-29T20:44:57.097", "UserId": 64}
{"Id": 100, "PostId": 1, "Score": 0, "Text": "@Flimzy why? people have managed to answer haven't they... Surley establishing on / off topic is a good idea?", "CreationDate": "2015-07-29T20:45:03.057", "UserId": 3}
{"Id": 101, "PostId": 1, "Score": 0, "Text": "@Flimzy \"What will we do with these questions?\" - \"questions revolving around the age of consent\" - 100% clear, read it again maybe?", "CreationDate": "2015-07-29T20:45:36.177", "UserId": 3}
{"Id": 102, "PostId": 1, "Score": 0, "Text": "Which questions revolving around age of consent? If it's so clear, it would be easy for you to add some example questions, to explain it to stupid people like me.", "CreationDate": "2015-07-29T20:46:08.480", "UserId": 64}
{"Id": 103, "PostId": 1, "Score": 0, "Text": "I don't know what questions could be asked...?", "CreationDate": "2015-07-29T20:46:42.053", "UserId": 3}
{"Id": 104, "PostId": 1, "Score": 0, "Text": "Then I stand by my assertion that it's unclear (apparently even to you) what is being asked, and that this is a solution looking for a problem.", "CreationDate": "2015-07-29T20:47:22.090", "UserId": 64}
{"Id": 105, "PostId": 1, "Score": 1, "Text": "No, I know exactly what I'm asking... What about \"will we allow things to be tagged age-of-consent\"? That kind of thing. Anything where the question is about age of consent comes under this question...", "CreationDate": "2015-07-29T20:48:26.993", "UserId": 3}
{"Id": 136, "PostId": 1, "Score": 1, "Text": "I'll quickly plug [law.se] as a possible migration target for any of these questions that are _just_ about age of consent, if they're off-topic here :) It'd be good for us to develop a set of questions on these over at Law, but I'm not genuinely interested in it enough to ask them myself, and it'd be better if the asker actually wants to know.", "CreationDate": "2015-08-02T12:14:26.900", "UserId": 127}
{"Id": 27, "PostId": 5, "Score": 4, "Text": "I removed the polling-style answers you posted in favor of an open discussion. If you have thoughts on the issue yourself, please feel free to re-post it as an answer, but it is generally better to **let everyone have a voice** in meta to express their own opinions rather pre-posting all sides of the conversation in a type of pseudo-poll. It's not difficult to infer what the community wants from the conversation while allowing for the possibility that there's an issue we have *not* considered. **[Polling is generally not a good substitute for discussion](http://bit.ly/1g0BO6d)**. Thanks.", "CreationDate": "2015-07-28T19:57:05.220", "UserId": 90}
{"Id": 28, "PostId": 5, "Score": 0, "Text": "@Robert not 100% agree but won't fight over this. Added short form into the question, hope that's fine", "CreationDate": "2015-07-28T20:00:31.897", "UserId": 61}
{"Id": 64, "PostId": 5, "Score": 1, "Text": "Seems like a good canonical duplicate to me. DVs are also appropriate on such questions.", "CreationDate": "2015-07-28T22:28:48.293", "UserId": 16}
{"Id": 48, "PostId": 11, "Score": 0, "Text": "One thought that I have, though I'm not sure how hard of a line this should be, is to think about this site in terms of people who are asking and answering these questions in a professional capacity - whether as sex educators, medical professionals, sex toy manufacturers, even sex workers.  Not that the site would be limited to such folks, but that we should strive to have this be a site where such folks would want to come to get answers to questions they still have... and answer questions from others.  So, would this be on-topic in such a context?", "CreationDate": "2015-07-28T21:39:05.810", "UserId": 108}
{"Id": 154, "PostId": 11, "Score": 0, "Text": "This, this, a million times this!", "CreationDate": "2015-08-04T05:02:42.923", "UserId": 98}
{"Id": 155, "PostId": 11, "Score": 0, "Text": "Related:  http://meta.sexuality.stackexchange.com/questions/84/are-good-answers-the-best-cited-and-referenced-ones-or-simply-the-ones-that-we", "CreationDate": "2015-08-04T05:04:24.820", "UserId": 98}
{"Id": 46, "PostId": 15, "Score": 2, "Text": "I'd like to point out that if you're talking about physiological capabilities, you're talking about sex, not gender.  Gender is more of a psychological experience.", "CreationDate": "2015-07-28T21:35:36.273", "UserId": 108}
{"Id": 51, "PostId": 15, "Score": 0, "Text": "@lindes: Yes, that's one possible distinction. It's hardly a rigid one. Consult any dictionary, and you'll see under \"gender\" that \"sex\" is a synonym.  And in this case, despite the nuances, I think \"gender\" is better here, because titling a question \"Do we need sex tags?\" on a site about sex would likely be met with far more confusion. (If my lexical pragmatism is somehow offensive to someone, let me know.)", "CreationDate": "2015-07-28T21:43:31.913", "UserId": 64}
{"Id": 67, "PostId": 15, "Score": 0, "Text": "Honestly, I thought you meant the question rhetorically: 'Do we really need gender tags?'... I was surprised to see them, they seem so generic.", "CreationDate": "2015-07-28T23:39:20.077", "UserId": 82}
{"Id": 68, "PostId": 15, "Score": 0, "Text": "@Spork: Well, in some cases I'm sure you're right.  In some cases, if used properly, I can imagine they would be beneficial. But I might be wrong. An answer explaining your thoughts on the issue might be useful :)", "CreationDate": "2015-07-28T23:40:58.623", "UserId": 64}
{"Id": 69, "PostId": 15, "Score": 0, "Text": "@Flimzy I tried... and failed to put it into words [that made sense]. It had to do with a suggested edit for the tag 'female' to be added to a question I posted about female ejaculation, which seemed superfluous to me... Like adding 'verbs' and 'nouns' to English.SE... But my analogies keep failing.", "CreationDate": "2015-07-28T23:43:05.400", "UserId": 82}
{"Id": 122, "PostId": 15, "Score": 1, "Text": "What about genderqueer? androgynous? I'd rather see tags relating to the actual genitalia involved, rather than the person, people, etc performing said action. Fellatio, Cunnilingus,  Anal-insertion, etc are much more descriptive terms for the idea you wish to convey.", "CreationDate": "2015-07-31T02:51:13.570", "UserId": 122}
{"Id": 49, "PostId": 18, "Score": 0, "Text": "Where is the line? Is Sex acceptable? Boobs or Breasts? Or use your own judgement?", "CreationDate": "2015-07-28T21:41:32.923", "UserId": 3}
{"Id": 50, "PostId": 18, "Score": 3, "Text": "@Tim I'd suggest doing your best to use the correct medical terms wherever possible. If you're not sure, Google is your friend. \"Breasts,\" for instance, would be vastly preferred over \"boobs,\" since the latter is slang and the former has technical accuracy.", "CreationDate": "2015-07-28T21:42:35.867", "UserId": 23}
{"Id": 65, "PostId": 18, "Score": 1, "Text": "Good point - but medical terms quickly become very plastic, and similarly school-boy-ish (just the nerdy type). As much as I would be annoyed with 'bang each other', it would to be also be annoying to read 'coitus' everywhere... nerdy-sex-slang.. would that be included?", "CreationDate": "2015-07-28T23:23:42.247", "UserId": 82}
{"Id": 70, "PostId": 18, "Score": 1, "Text": "would \"fuck\" be a slang word for \"penetrate\"/\"penetration\"?", "CreationDate": "2015-07-29T04:44:12.407", "UserId": 147}
{"Id": 76, "PostId": 18, "Score": 0, "Text": "@Ooker yes indeed, though it can also refer to intercourse..", "CreationDate": "2015-07-29T14:54:09.723", "UserId": 61}
{"Id": 77, "PostId": 18, "Score": 0, "Text": "@Jon what about comments? Should we also avoid using slang in comments, or can we \"go wild\" in there? :)", "CreationDate": "2015-07-29T14:54:42.007", "UserId": 61}
{"Id": 81, "PostId": 18, "Score": 0, "Text": "@ShadowWizard: Comments are just as [public](http://meta.stackexchange.com/a/231362/1438) as posts and should be held to similar standards. To avoid descent into the abyss of the common denominator, I'd avoid using slang just about everywhere on the site.", "CreationDate": "2015-07-29T15:42:54.510", "UserId": 7}
{"Id": 84, "PostId": 18, "Score": 0, "Text": "Ho the hell uses the word \"genitalia\" when he/she talks with other people about those organs? I think it should be allowed here to use the words that are well-understood and usual in a normal conversation among friends. And why do you want to create that »aura of authority«? I think there is no need for trying to appear like a nerdy headteacher.", "CreationDate": "2015-07-29T16:10:07.443", "UserId": 115}
{"Id": 85, "PostId": 18, "Score": 0, "Text": "@HubertSchölnast: Nurses, doctors, researchers, therapists, religious advisors, and other people who take human sexuality seriously tend to use clinical terms for clarity. For many people, slang terms make it much harder to discuss sex. Perhaps it's irrational, but I instantly lose trust in advice that includes the words \"pussy\" and \"boobs\" in particular.", "CreationDate": "2015-07-29T16:27:55.493", "UserId": 7}
{"Id": 86, "PostId": 18, "Score": 0, "Text": "@Hubert I'm with JE here, this site is not like any other Q&A site, most notable is probably Yahoo Answers, which while censoring some words still manage to attract mostly crap", "CreationDate": "2015-07-29T16:31:27.390", "UserId": 61}
{"Id": 52, "PostId": 19, "Score": 0, "Text": "No. Has been requested before, won't be implemented. Use a second account.", "CreationDate": "2015-07-28T21:45:37.783", "UserId": 3}
{"Id": 53, "PostId": 19, "Score": 7, "Text": "@Tim: Since then, things have changed somewhat, now that logging into one SE site automatically logs you into *all* SE sites, making it harder to manage multiple accounts, and far easier to accidentally post as the wrong one. It might be worth re-requesting the feature on MSE.", "CreationDate": "2015-07-28T21:48:38.037", "UserId": 64}
{"Id": 54, "PostId": 19, "Score": 0, "Text": "In addition, a 'sexuality'-themed site is a clearly separate situation than less-controversial sites on SE.  And the question has *not* been asked on this meta site, specifically.", "CreationDate": "2015-07-28T21:49:26.097", "UserId": 112}
{"Id": 55, "PostId": 19, "Score": 0, "Text": "@Flimzy It *has* been suggested there. Also, use a second browser? 2 accounts have never been supported... They're no longer any more broken.", "CreationDate": "2015-07-28T21:50:46.840", "UserId": 3}
{"Id": 56, "PostId": 19, "Score": 2, "Text": "@Tim: Sure, there are ways around. And I don't have high hopes that SE will change their mind. But I don't think there's any harm in asking for a feature that was once denied, especially now that things have actually changed.", "CreationDate": "2015-07-28T21:51:50.950", "UserId": 64}
{"Id": 74, "PostId": 19, "Score": 1, "Text": "A second brower, or an incognito TAB (like I am doing now).", "CreationDate": "2015-07-29T14:37:59.403", "UserId": 201}
{"Id": 129, "PostId": 19, "Score": 0, "Text": "I would also be careful about how you word questions and answers. Use third person, avoid anecdotes. It is possible to sound interested in hypothetical situations that are not really hypothetical.", "CreationDate": "2015-08-01T18:51:38.690", "UserId": 218}
{"Id": 110, "PostId": 26, "Score": 1, "Text": "I have a side question: would it be useful to maintain, e.g. on meta.sexuality, a thesaurus (a question with wiki answers) of english words concerning erotic aeras, various form of touch contacts, steps, protections, sexually transmitted diseases, ... ? This type of vocabulary is often not taught at school, hence often misunderstood by non-native english speakers. Should I repost this comment as a question on meta.sexuality ?", "CreationDate": "2015-07-30T09:40:21.467", "UserId": 201}
{"Id": 120, "PostId": 26, "Score": 1, "Text": "Yes, @mansa, please post that as a question. It's interesting, even if I haven't thought out the implications of possible answers yet.", "CreationDate": "2015-07-30T15:52:24.227", "UserId": 108}
{"Id": 124, "PostId": 26, "Score": 2, "Text": "@lindes: [done](http://meta.sexuality.stackexchange.com/questions/52/a-sexuality-related-english-thesaurus-somewhere-on-meta-sexuality-se-useful-or)", "CreationDate": "2015-07-31T09:33:04.610", "UserId": 201}
{"Id": 72, "PostId": 28, "Score": 5, "Text": "I've been going with 'my partner'. Not only does this remove the duplicate scenario, this opens up the question to more answers from all sexes", "CreationDate": "2015-07-29T09:12:27.170", "UserId": 124}
{"Id": 92, "PostId": 29, "Score": 0, "Text": "Lets get this site into public beta... and then close to graduating beta, before we start skinning this cat.  Every site leaving beta has weeks notice, and plenty of time to work this stuff out *then*.  By the way, what color should we paint the first bike shed we install on Mars after the colony is founded there?", "CreationDate": "2015-07-29T20:33:49.190", "UserId": 64}
{"Id": 94, "PostId": 29, "Score": 4, "Text": "I'm voting to close this question as off-topic because this site is nowhere near graduating from public beta.", "CreationDate": "2015-07-29T20:34:43.137", "UserId": 64}
{"Id": 193, "PostId": 31, "Score": 0, "Text": "An interesting and, I think, worthwhile question.  Thank you for asking it.", "CreationDate": "2015-08-05T17:47:37.610", "UserId": 108}
{"Id": 87, "PostId": 34, "Score": 0, "Text": "Related: [Do we need gender tags?](http://meta.sexuality.stackexchange.com/q/15/8)", "CreationDate": "2015-07-29T16:45:58.567", "UserId": 8}
{"Id": 119, "PostId": 34, "Score": 0, "Text": "For what it's worth, male ejaculation and female ejaculation are, indeed, decidedly different (though there may be some physiological similarity) phenomena.", "CreationDate": "2015-07-30T15:50:56.257", "UserId": 108}
{"Id": 108, "PostId": 45, "Score": 0, "Text": "Related: http://meta.sexuality.stackexchange.com/q/2/64", "CreationDate": "2015-07-29T21:39:43.117", "UserId": 64}
{"Id": 111, "PostId": 48, "Score": 0, "Text": "Looks like you created only the description, leaving the Excerpt empty. This probably leads to the system thinking there is no wiki. No worry, your edit still there, visible for example when [editing the wiki](http://sexuality.stackexchange.com/edit-tag-wiki/11)", "CreationDate": "2015-07-30T10:36:14.537", "UserId": 61}
{"Id": 112, "PostId": 48, "Score": 0, "Text": "If you can now also create the Excerpt and wait until it's approved, we can verify my above assumption. :)", "CreationDate": "2015-07-30T10:36:41.567", "UserId": 61}
{"Id": 113, "PostId": 48, "Score": 0, "Text": "I did add an exerpt though. I did find the text I wrote through my profile page so I can always re edit the wiki?", "CreationDate": "2015-07-30T12:05:16.713", "UserId": 207}
{"Id": 115, "PostId": 48, "Score": 0, "Text": "Oh, your first excerpt suggestion [was rejected](http://sexuality.stackexchange.com/review/suggested-edits/106). Since your second is the same, it would likely be rejected again. If you can think of better excerpt I think you can still edit it.", "CreationDate": "2015-07-30T12:26:30.497", "UserId": 61}
{"Id": 116, "PostId": 48, "Score": 1, "Text": "that makes more sense. I'll try to think of a better way to phrase it.", "CreationDate": "2015-07-30T12:53:28.173", "UserId": 207}
{"Id": 118, "PostId": 48, "Score": 0, "Text": "@Flimzy I'll answer it!", "CreationDate": "2015-07-30T14:17:04.257", "UserId": 207}
{"Id": 125, "PostId": 52, "Score": 0, "Text": "Definitely. Sexual slang often stump me.", "CreationDate": "2015-07-31T16:37:01.023", "UserId": 251}
{"Id": 209, "PostId": 63, "Score": 0, "Text": "@Flimzy I did not.. Edited. I would include videos and animations in the question though, same sort of issue.", "CreationDate": "2015-08-06T20:09:26.897", "UserId": 82}
{"Id": 137, "PostId": 68, "Score": 0, "Text": "I often use Google Translate to read stuff from foreign websites. In fact, Chrome has a built-in translation service.", "CreationDate": "2015-08-02T13:19:38.843", "UserId": 20}
{"Id": 138, "PostId": 68, "Score": 0, "Text": "True @Chris and this can tell me that the source is kind-of-about-topic but still, many things are not being translated very well.", "CreationDate": "2015-08-02T13:22:18.100", "UserId": 61}
{"Id": 144, "PostId": 68, "Score": 1, "Text": "@ChrisJester-Young: I agree with ShadowWizard: machine-translation hurts. If you want to use it, its ok, but this can not be a general solution.", "CreationDate": "2015-08-03T10:16:15.233", "UserId": 115}
{"Id": 139, "PostId": 70, "Score": 1, "Text": "It would depend on the sort of questions asked. But IMO you should ask away at this stage - private beta is about *testing* what works and what doesn't.", "CreationDate": "2015-08-02T16:10:46.570", "UserId": 124}
{"Id": 210, "PostId": 70, "Score": 0, "Text": "On Bachelor in Paradise, there was a scene where a bachelor and a bachelorette did tantric yoga. Not sure if it would fit under sexuality.", "CreationDate": "2015-08-06T21:46:30.983", "UserId": 251}
{"Id": 206, "PostId": 73, "Score": 0, "Text": "Keep in mind that the age of a question has little to nothing to do with which question ought to be considered the duplicate.", "CreationDate": "2015-08-06T18:42:05.547", "UserId": 64}
{"Id": 216, "PostId": 83, "Score": 0, "Text": "In my experience, men don't have to do the pelvic thrusting.  As an incredibly lazy bastard, I prefer to assume the cowgirl position and let the lady do the heavy lifting.", "CreationDate": "2015-08-08T06:25:10.257", "UserId": 98}
{"Id": 164, "PostId": 84, "Score": 0, "Text": "I think you are misattributing downvotes here.. It's definitely not because it wasn't what I wanted to hear.. And I agree on your assessment of the top voted answer - but that had nothing to do with your own.", "CreationDate": "2015-08-04T08:49:06.333", "UserId": 82}
{"Id": 187, "PostId": 84, "Score": 0, "Text": "Related: http://meta.stackexchange.com/questions/59235/long-answers-on-stackoverflow", "CreationDate": "2015-08-04T22:11:42.563", "UserId": 82}
{"Id": 188, "PostId": 84, "Score": 0, "Text": "Regardless, this question on meta is you taking off on a tangent with assuming that the downvotes are because it wasn't what downvotes (like me) wanted to hear. That's plainly not true. It has to do with the quality of the answer, and that's all I ever vote for. So good news: you don't have to worry about the future of the site. (I actually like long answers in general)", "CreationDate": "2015-08-04T22:13:12.340", "UserId": 82}
{"Id": 189, "PostId": 84, "Score": 0, "Text": "@Spork - I don't think the quality of my answer has changed in a significant way since I first wrote it, but the downvotes have begun to disappear.  And I just had a chat with Saposhiente in which he/she said that \"the length of the answer isn't **a** problem, it is **the** problem\".  \"You can make some of the people happy all of the time, and all of the people happy some of the time, but you can't make all the people happy all of the time.\"  It is a high quality answer, whatever else might be said about it.", "CreationDate": "2015-08-04T22:17:39.890", "UserId": 98}
{"Id": 157, "PostId": 86, "Score": 0, "Text": "I'd split it also into a [sexual-attraction] tag.", "CreationDate": "2015-08-04T07:27:58.257", "UserId": 72}
{"Id": 213, "PostId": 102, "Score": 1, "Text": "The specific answer to which you refer is loaded with just as much bias as the articles which the author attempts to refute. I would definitely remove the bias, statements that do not address the question, etc. I think it could be a _great_ answer if it were edited for brevity and focus. However, the author typically wins in the end when there is a disagreement like that.", "CreationDate": "2015-08-07T19:14:45.270", "UserId": 218}
{"Id": 217, "PostId": 102, "Score": 0, "Text": "@Snowman - I agree, without the parts of bias it's a good answer (and the OP has since made some additions that make it a lot better as well). I've updated this meta to reflect that", "CreationDate": "2015-08-08T16:49:23.823", "UserId": 124}
{"Id": 218, "PostId": 103, "Score": 0, "Text": "Agreed.  There is no cost to being more accurate, and it will be consistent with other tags like \"sex-toys\" and \"sexual-dysfunction\".", "CreationDate": "2015-08-09T18:44:25.443", "UserId": 228}
{"Id": 228, "PostId": 119, "Score": 0, "Text": "Unfortunately, Sexuality SE is not going to make it.\r\n\r\n[Sexuality SE will be closing on Fri, 8/14](http://meta.sexuality.stackexchange.com/questions/120/sexuality-se-will-be-closing-on-fri-8-14)", "CreationDate": "2015-08-10T20:53:14.610", "UserId": 90}
{"Id": 229, "PostId": 120, "Score": 2, "Text": "Well, this is sad, but I'll admit, also a bit of a relief. Will any of the questions/answers be migrated to sites where they are on topic?", "CreationDate": "2015-08-10T23:28:00.913", "UserId": 124}
{"Id": 231, "PostId": 120, "Score": 4, "Text": "Noooooooooo!!! Will all my tirelessly researched questions disappear? Will they be at least saved somewhere in cyberspace?", "CreationDate": "2015-08-11T01:26:00.600", "UserId": 251}
{"Id": 233, "PostId": 120, "Score": 0, "Text": "@DoubleU - I know that in other previous betas, the questions/answers were made available as a data dump for people to download, but as to how or when this happens I am not sure, I unfortunately don't work for SE haha :-)", "CreationDate": "2015-08-11T04:09:27.397", "UserId": 124}
{"Id": 234, "PostId": 120, "Score": 7, "Text": "Sexuality has many other aspects then just *Health* and *Biology*. There is also *lust* and *lechery*. One of your problems is, that you want to make this site sterile and clean. Sex is not clean and it is not sterile. Why are you so afraid of using words file *pussy* and *fuck*? Everybody uses them in real life, but here, in a *SEX*-board, your answer will be edited and this words will be deleted if you use them! And you are closing too much questions. You want a vivid and vital board? I don't think that your restrictive closing-politics is helpful to reach this goal.", "CreationDate": "2015-08-11T08:56:08.217", "UserId": 115}
{"Id": 235, "PostId": 120, "Score": 0, "Text": "Any reason to let people keep spending their time on asking and answering until the hammer falls? Why not closing it right away, or put in read only mode?", "CreationDate": "2015-08-11T13:36:48.913", "UserId": 61}
{"Id": 236, "PostId": 120, "Score": 1, "Text": "@ShadowWizard  Why the rush?  Not everyone uses these sites to build the community, some just want their questions answered.  A few days of shutdown notice serves as a \"last call\" for anyone who wants to post any last nagging questions they may have.", "CreationDate": "2015-08-11T14:32:42.200", "UserId": 62}
{"Id": 237, "PostId": 120, "Score": 0, "Text": "@Nerrolken if the site was open to the public I would have agreed, but it's not.  It's available only to very small group of people. Private beta phase isn't supposed to give actual help just yet, just to prepare the ground for the real thing, see if there are enough active users to actually maintain the site etc.", "CreationDate": "2015-08-11T14:33:34.940", "UserId": 61}
{"Id": 240, "PostId": 120, "Score": 6, "Text": "I would love to see a more detailed explanation about the reasons for closure, what SE's expectations/criteria were, and what would need to be different if a future attempt is to succeed. Perhaps Area51 would be a better place for that, though, so it sticks around after the closure of this site.", "CreationDate": "2015-08-11T19:18:48.677", "UserId": 64}
{"Id": 241, "PostId": 120, "Score": 0, "Text": "@Flimzy I would like to see that too, unfortunately my project to present more objective criteria throughout the site life cycle was pushed out in favor of splitting up the graduation process. Baby steps.", "CreationDate": "2015-08-11T19:27:08.223", "UserId": 90}
{"Id": 242, "PostId": 120, "Score": 0, "Text": "@Robotnik: I encourage you (and others) to take these days before site closure to migrate the questions you want archived on other relevant sites. I don't know SE's official stand, but it's rare to migrate from beta sites to mature ones--I imagine a migration from Private Beta would be even less likely.", "CreationDate": "2015-08-11T20:03:45.333", "UserId": 64}
{"Id": 244, "PostId": 120, "Score": 0, "Text": "@RobertCartaino: I guess I wasn't expecting something so elaborate that it would require a major time commitment.  I expect with even just 15 minutes some of your comments could be cast in a more beneficial light. Take for example: \"something that leveraged the specific strengths of Stack Exchange\". I think this phrase is trying to say a ton--and I can make some educated guesses--but spelling it out (even just a paragraph's worth) I expect would be worth its weight in gold (which I admit isn't a lot, considering the weight of electrons...)", "CreationDate": "2015-08-12T02:02:24.720", "UserId": 64}
{"Id": 248, "PostId": 120, "Score": 0, "Text": "I understand. I wish I had had more time recently to commit, but I simply assumed there would be a much longer beta period. I want to say I don't think this site was given enough time to give it a fair chance. In time it would have attracted experts and quality would have gone up. It's sad, out of all the topics to be informed about this is one of the most important. It's one of our biggest drives--health, happiness, perhaps literally success at life itself depends on it and having an education and knowing the truth. I hope it's not closing only because some moderators feel it's draining?", "CreationDate": "2015-08-14T17:30:28.470", "UserId": 79}
{"Id": 251, "PostId": 120, "Score": 0, "Text": "It's only been 16 days! 4.2 questions a day, 92% answered. We could get those numbers up if people weren't just giving up. If the moderators aren't interested why not hand over the reigns to people who are?", "CreationDate": "2015-08-14T18:35:35.930", "UserId": 79}
{"Id": 9, "PostId": 9, "Score": 1, "Text": "\"The question is not about human sexual behavior\" -- On the surface, perhaps. But it does ask if this behavior is unique to humans--which is the crux of the question.  How can this be asked to be acceptable?", "CreationDate": "2015-07-28T19:15:14.117", "UserId": 64}
{"Id": 12, "PostId": 9, "Score": 1, "Text": "@Flimzy I suppose it's possible. I don't really understand that part of your question, but that's no reason not to edit it and see what people say.", "CreationDate": "2015-07-28T19:18:13.677", "UserId": 48}
{"Id": 13, "PostId": 9, "Score": 1, "Text": "@wigcanoe: \"Are humans unique in their fascination with voyeurism?\" is the real core of the question. That's not about animal sexuality, except insofar as humans are animals.  But to answer that question depends on examining other animals.", "CreationDate": "2015-07-28T19:19:03.380", "UserId": 64}
{"Id": 14, "PostId": 9, "Score": 1, "Text": "@Flimzy- I am with you, keep on fighting for your point. This question was indeed on-topic from my point of view. I think they mis-understood the underlying point there which you're since then trying to make them understand. Also, don't know why my answer was serially downvoted!", "CreationDate": "2015-07-28T19:20:58.410", "UserId": 13}
{"Id": 16, "PostId": 9, "Score": 1, "Text": "@Flimzy \"That's not about animal sexuality\" -- Disagree, there. Answering that question doesn't require knowledge about human sexuality. It requires knowledge about animal sexuality. Something about evolutionary or cognitive causes for voyeurism would make sense to me, though.", "CreationDate": "2015-07-28T19:22:26.610", "UserId": 48}
{"Id": 17, "PostId": 9, "Score": 1, "Text": "@wigcanoe: That sounds to me like splitting hairs. What is the _purpose_ of making that distinction? Lets not get hung up on the strict definition of \"human sexuality\" (doing so is a loosing game, as soon as we bring in evolutionary causes--when did the first \"human sexual\" experience occur?).  Is the crux of the question meaningful, interesting, and relevant to people who study human sexuality? That ought to be the litmus test, not a dictionary definition of \"human.\"", "CreationDate": "2015-07-28T19:25:34.627", "UserId": 64}
{"Id": 22, "PostId": 9, "Score": 0, "Text": "@Flimzy The boundary you're proposing isn't any clearer. The crux of the question \"What's the best way to make cheesecake\" could be meaningful and interesting to people who study human sexuality if enough of 'em like cheesecake. That's an extreme example, but it's meant to demonstrate that we've got to define a *topic*, not a type of person who participates here.", "CreationDate": "2015-07-28T19:34:18.877", "UserId": 48}
{"Id": 24, "PostId": 9, "Score": 0, "Text": "@wigcanoe: How to make cheesecake is not *relevant* to the study of human sexuality (except for certain fetishes). Establishing a baseline of animal sexual behavior is.", "CreationDate": "2015-07-28T19:34:56.630", "UserId": 64}
{"Id": 26, "PostId": 9, "Score": 0, "Text": "@Flimzy You haven't convinced me of that. Fortunately, you don't have to. You've got reopen votes, and you can edit the question while it's still closed. That's by design, so we can see what others in the community think of the idea.", "CreationDate": "2015-07-28T19:36:32.180", "UserId": 48}
{"Id": 15, "PostId": 10, "Score": 0, "Text": "Based on the title of this site... I'd disagree about this answer. I'd be interested why you feel this way?", "CreationDate": "2015-07-28T19:22:03.553", "UserId": 3}
{"Id": 18, "PostId": 10, "Score": 1, "Text": "@Tim Age of consent is an entirely legal concept; while it is important for sexuality, it has to be linked to human sexuality as a whole for it to be relevant. In general, I think that our questions and answers should be applicable everywhere, not just in a particular jurisdiction.", "CreationDate": "2015-07-28T19:26:01.183", "UserId": 72}
{"Id": 19, "PostId": 10, "Score": 0, "Text": "To me sexuality involves the whole concept of \"sexual activity\" which age of consent does fall under... Also note that a lot of questions will be personal - just because the question applies to one place doesn't mean it doesn't have some value... Like how on [so] I don't care about Java questions - but they still have value.", "CreationDate": "2015-07-28T19:27:53.167", "UserId": 3}
{"Id": 20, "PostId": 10, "Score": 0, "Text": "@Tim That is drifting into where it becomes part of the context of a relationship; there, it would clearly be an important and on-topic part of the question.", "CreationDate": "2015-07-28T19:31:59.627", "UserId": 72}
{"Id": 21, "PostId": 10, "Score": 0, "Text": "But you say it shouldn't be the focus - merely an aside?", "CreationDate": "2015-07-28T19:33:03.257", "UserId": 3}
{"Id": 23, "PostId": 10, "Score": 0, "Text": "@Tim I'm saying that age of consent, as a topic on its own, isn't sufficient to make a question on-topic. The line falls on whether the question is asking for sexual advice or legal advice.", "CreationDate": "2015-07-28T19:34:37.180", "UserId": 72}
{"Id": 25, "PostId": 10, "Score": 0, "Text": "Okay, fair points. Would you be able to transfer some explanation from the comments into the post?", "CreationDate": "2015-07-28T19:35:15.187", "UserId": 3}
{"Id": 73, "PostId": 10, "Score": 0, "Text": "@Tim et al, - just FYI, the minimum age for a Stack Exchange account is 13. If anyone admits to being younger, their account is completely purged from the system.", "CreationDate": "2015-07-29T13:22:30.760", "UserId": 124}
{"Id": 29, "PostId": 16, "Score": 1, "Text": "Questions about how a man might stimulate a woman's G-Spot could be different from how a woman would accomplish the same. How do you propose tagging such questions?", "CreationDate": "2015-07-28T20:38:05.383", "UserId": 64}
{"Id": 30, "PostId": 16, "Score": 0, "Text": "\"how to stimulate G-spot\" can have both versions i.e. \"how can a male stimulate a female's G-spot\" and \"how can a female stimulate a female's G-spot\" and both would be on topic, in my opinion.", "CreationDate": "2015-07-28T20:40:00.560", "UserId": 61}
{"Id": 31, "PostId": 16, "Score": 3, "Text": "I agree both should be on topic. I'm asking how they should be tagged.", "CreationDate": "2015-07-28T20:40:27.823", "UserId": 64}
{"Id": 32, "PostId": 16, "Score": 3, "Text": "Both with only [tag:female] since they talk about female G-spot. All the rest should be described in title and body.", "CreationDate": "2015-07-28T20:45:34.387", "UserId": 61}
{"Id": 44, "PostId": 16, "Score": 1, "Text": "I have to disagree with the idea that [tag:female] + [tag:orgasm] is better than [tag:female-orgasm].  See [here](http://meta.stackexchange.com/a/18879/165502).", "CreationDate": "2015-07-28T21:34:29.443", "UserId": 64}
{"Id": 66, "PostId": 16, "Score": 1, "Text": "I also added a question with female-ejaculation... so many other ways to combine female and ejaculation that would have nothing to do with my intended question, so it made sense to me.", "CreationDate": "2015-07-28T23:34:38.997", "UserId": 82}
{"Id": 33, "PostId": 17, "Score": 0, "Text": "\"Tags are for categorization not for description\" -- So how do you distinguish between categorizing questions about how men can affect women, and describing questions about how men can affect women? As far as I can tell, you're making a false distinction. It's two ways to say the exact same thing (in this case).", "CreationDate": "2015-07-28T21:18:31.913", "UserId": 64}
{"Id": 34, "PostId": 17, "Score": 0, "Text": "If I'm allowed to extrapolate a bit from from the rest of your answer, perhaps what might make more sense is tags to differentiate between, say, manual and penile stimulation of the G-Spot (to pull in an example from other comments).  The manual stimulation would naturally be the same, regardless of the gender of the hand's owner.", "CreationDate": "2015-07-28T21:19:35.153", "UserId": 64}
{"Id": 36, "PostId": 17, "Score": 0, "Text": "How men can affect women is never categorization... that's description and should be detailed in the question not tags.", "CreationDate": "2015-07-28T21:25:00.943", "UserId": 3}
{"Id": 37, "PostId": 17, "Score": 0, "Text": "If I'm looking for questions about \"how can men make their wives feel good\", that is absolutely a categorization. It's also a description. It's categorization based on description. So I say again: The two are identical in this case.", "CreationDate": "2015-07-28T21:25:31.367", "UserId": 64}
{"Id": 38, "PostId": 17, "Score": 0, "Text": "The concept that tags are for categorization and not description is based on a false dichotomy.  I'm not entirely sure what point you're trying to make about what tags should or shouldn't be, but the categorization vs. description distinction isn't meaningful.", "CreationDate": "2015-07-28T21:27:23.050", "UserId": 64}
{"Id": 39, "PostId": 17, "Score": 0, "Text": "Umm what do you see as the usage of tags? My point is that I think they shouldn't be used to fully cover the content of the question... What are they for?", "CreationDate": "2015-07-28T21:28:36.457", "UserId": 3}
{"Id": 40, "PostId": 17, "Score": 0, "Text": "They exist to make finding relevant questions quick and easy. They're primarily a search aide.  To that end, having a bunch of questions about how to stimulate females (as an example) is a useful categorization. It also happens to be a description of the questions categorized thusly. :/", "CreationDate": "2015-07-28T21:29:40.750", "UserId": 64}
{"Id": 41, "PostId": 17, "Score": 0, "Text": "@Flimzy Okay, I disagree.", "CreationDate": "2015-07-28T21:30:01.223", "UserId": 3}
{"Id": 42, "PostId": 17, "Score": 0, "Text": "What is the purpose of tags in your mind, then?", "CreationDate": "2015-07-28T21:30:20.057", "UserId": 64}
{"Id": 43, "PostId": 17, "Score": 0, "Text": "@Flimzy They are there to sort the questions for answerers. They should be general enough that lots of people will use them (i.e. aim for 1 tag to cover 3 concepts not 3 tags) and they aren't a replacement for description / explanation in the body.", "CreationDate": "2015-07-28T21:33:27.067", "UserId": 3}
{"Id": 45, "PostId": 17, "Score": 0, "Text": "That sounds like exactly what I said: They're a search aide. They categorize questions for answers, for askers, for googlers, for everyone, whether they search through google, or by clicking on a tag.", "CreationDate": "2015-07-28T21:35:04.500", "UserId": 64}
{"Id": 71, "PostId": 25, "Score": 3, "Text": "Thanks, the apocalypse  is having 90% of the questions like that, with slight variations. Luckily, the duplicate system is strong enough to handle that.", "CreationDate": "2015-07-29T05:00:46.240", "UserId": 61}
{"Id": 114, "PostId": 25, "Score": 1, "Text": "It may be worth adding a link to that good question to the page http://sexuality.stackexchange.com/questions/ask/advice so that beginners coming here for that will directly find the answer.", "CreationDate": "2015-07-30T12:18:21.157", "UserId": 201}
{"Id": 191, "PostId": 27, "Score": 2, "Text": "Well, I am one of those non-english native writers. I'm not sure, if my english is really that bad, but I really would appreciate it if someone corrected my errors. Even minor errors that don't cause problems. It would make my texts better readable and therefor more understandable, and from the edits I can learn to avoid such errors in the future.", "CreationDate": "2015-08-05T05:14:54.720", "UserId": 115}
{"Id": 192, "PostId": 27, "Score": 1, "Text": "@HubertSchölnast - Absolutely, we should be striving to make all questions and answers as readable as possible :)", "CreationDate": "2015-08-05T07:46:18.223", "UserId": 124}
{"Id": 152, "PostId": 30, "Score": 0, "Text": "That isn't NSFW, but it is clearly unacceptable, because it excludes the LGBTQ community.  Sex isn't just about a man and a woman.  It is about whoever is having sex with whoever.   You would need to add a male-male symbol, a female-female symbol, a male-female-male symbol, a transgender-male symbol, a transgender-female symbol, a transgender-transgender symbol, and so on, ad infinitum.", "CreationDate": "2015-08-03T21:55:22.157", "UserId": 98}
{"Id": 159, "PostId": 30, "Score": 0, "Text": "I've given this as a mere example, leaving this to SE team to find something actually relevant.", "CreationDate": "2015-08-04T07:29:36.093", "UserId": 61}
{"Id": 75, "PostId": 32, "Score": 0, "Text": "See your point, but better linking to something that explains the formal definition, e.g. [Cunnilingus](https://en.wikipedia.org/wiki/Cunnilingus)", "CreationDate": "2015-07-29T14:53:22.817", "UserId": 61}
{"Id": 78, "PostId": 32, "Score": 1, "Text": "@ShadowWizard I would honestly prefer to not do this or at least also provide an easy to understand word. Because if we just link the definition people have to leave the site to understand the answer which is why I suggested providing the slang word. It also means writing an answer takes a lot longer since you have to find a good source.", "CreationDate": "2015-07-29T14:56:27.483", "UserId": 33}
{"Id": 79, "PostId": 32, "Score": 2, "Text": "Still, even with brackets, the slang/vulgarity is still there.", "CreationDate": "2015-07-29T14:57:48.487", "UserId": 61}
{"Id": 80, "PostId": 32, "Score": 0, "Text": "@ShadowWizard Putting the vulgar word in parentheses suggests that the writer knows what they are writing about.", "CreationDate": "2015-07-29T15:01:10.173", "UserId": 33}
{"Id": 82, "PostId": 32, "Score": 3, "Text": "Your example brings up another problem with slang: it's often poorly defined and rarely universal. I know what cunnilingus is, but I've never heard the phrase \"eating her out\". A term like [vanilla](http://sexuality.stackexchange.com/questions/5/what-does-it-mean-to-call-someone-something-vanilla#comment62_6) can mean different things depending on context. Using slang can only help improve communication if you know the readers understand the term the way you do. This suggestion does seem good if the asker uses the slang word or phrase in their question however.", "CreationDate": "2015-07-29T15:46:21.100", "UserId": 7}
{"Id": 89, "PostId": 32, "Score": 2, "Text": "Another problem with slang is that some of the allusions are potentially offensive. Some people don't like to associate oral sex with eating, for example; superficial appearances aside (in that both activities involve the use of a mouth), the two activities really have no relation at all, so there's no real necessity to link the two together.", "CreationDate": "2015-07-29T18:03:41.913", "UserId": 20}
{"Id": 219, "PostId": 32, "Score": 0, "Text": "Agreed in general, but a better example would be: \"...cunnilingus (oral sex with a female recipient)\" or \"...cunnilingus (the use of the mouth and tongue to stimulate the female genitals)\".  Either of those would explain the term, but do it in much more neutral terms that are likely to be understood by a wider audience.  The slang expression \"eating her out\" is seen as vulgar by many and would not be understood by many others.", "CreationDate": "2015-08-09T18:53:50.980", "UserId": 228}
{"Id": 83, "PostId": 33, "Score": 1, "Text": "I agree. Some people even would like to use *Ladies* and *Gentlemen*. This is the authors choice, and as long as the text is understandable, there should be no word-policemen who change synonymes to what they prefer.", "CreationDate": "2015-07-29T16:00:41.757", "UserId": 115}
{"Id": 109, "PostId": 35, "Score": 0, "Text": "@Flimzy: Yes. Did you read my answer to it's end? There I've given an example for such a question.", "CreationDate": "2015-07-30T03:20:32.123", "UserId": 115}
{"Id": 107, "PostId": 36, "Score": 0, "Text": "This doesn't answer the question.", "CreationDate": "2015-07-29T21:00:23.553", "UserId": 64}
{"Id": 88, "PostId": 37, "Score": 3, "Text": "\"that are usual when friends at an after-work-beer in a bar\" - the thing is, this site should not become such a bar.", "CreationDate": "2015-07-29T17:37:53.873", "UserId": 61}
{"Id": 128, "PostId": 44, "Score": 0, "Text": "Agreed. However, I do think the distributions between those options are heavily skewed towards [intercourse]. There is nobody who will tag with 'sex'  when they mean gender, and if anyone tags a question about advertising with it it should have been limited anyway. Could we suggest the tag [intercourse] for all questions written that add [sex]?", "CreationDate": "2015-08-01T18:46:58.213", "UserId": 82}
{"Id": 130, "PostId": 44, "Score": 0, "Text": "Are you suggesting a tag synonym?", "CreationDate": "2015-08-01T18:58:38.970", "UserId": 64}
{"Id": 131, "PostId": 44, "Score": 0, "Text": "Yes, despite it not being a true synonym - but one in practice.", "CreationDate": "2015-08-01T19:18:22.457", "UserId": 82}
{"Id": 121, "PostId": 49, "Score": 0, "Text": "See also: [Why were my tag wiki excerpt suggestions rejected?](http://meta.embedded.stackexchange.com/a/47/18)", "CreationDate": "2015-07-30T22:03:23.627", "UserId": 90}
{"Id": 126, "PostId": 54, "Score": 0, "Text": "I agree. Although sexual ethics is very important and is usually taught alongside sexual education, this is one area that has a lot of disagreement. Teaching sexual education without ethics seems impossible, because as soon as you introduce consent, you are also introducing what is and is not appropriate or ethical.", "CreationDate": "2015-07-31T19:28:23.197", "UserId": 251}
{"Id": 127, "PostId": 54, "Score": 0, "Text": "@DoubleU I believe I received sexual education in elementary and high school that did not involve ethics. It may have been incomplete, but the things I learned did not require ethical judgment. The information I received was great, and that information is why I am a user on this site.", "CreationDate": "2015-08-01T14:58:49.853", "UserId": 82}
{"Id": 132, "PostId": 54, "Score": 0, "Text": "@Spork Sexual ethics may be taught by families in homes, not in schools, by parents or guardians. Sometimes, schools may teach ethics too by explaining that sex is only between 2 consenting adults and that rape is unethical and criminal. Wearing a condom is part of ethics, because it is showing that you care and are showing responsibility. This is why I said sex ed without ethics is impossible.", "CreationDate": "2015-08-01T19:33:51.040", "UserId": 251}
{"Id": 147, "PostId": 61, "Score": 1, "Text": "The general hope for stack exchange sites is that they gather professionals and/or experts, right?  Should this site be any different?  While it's likely true that many people currently on Sexuality.SE are basing things on personal experience, my hope is that it can reach a higher standard than that.  I, for one, have had training as a sex educator, and I'm planning to contribute both questions and answers that go to a higher standard.  Unfortunately, I've been pretty busy this week, and the standard I hope to achieve takes time to research and such.  Anyway, downvoting... we can do better!", "CreationDate": "2015-08-03T16:56:39.710", "UserId": 108}
{"Id": 148, "PostId": 61, "Score": 0, "Text": "@lindes agreed! And I agree with the general tendency, and have slightly revised my own opinion in view of other answers", "CreationDate": "2015-08-03T18:05:57.343", "UserId": 82}
{"Id": 149, "PostId": 61, "Score": 0, "Text": "However, I think a high standard and quality is not necessarily derived from being a professional. Experience counts, knowledge counts, and a good way of explaining counts. A sex educator does not necessarily have more experience in the subject of many questions here, and in the end the voting system can let the best answers rise to the top. Good hobbyists that contribute to stackoverflow are also encouraged, although their answers may not be the highest rated ones.", "CreationDate": "2015-08-03T18:10:45.233", "UserId": 82}
{"Id": 150, "PostId": 61, "Score": 0, "Text": "agreed, hobbyists should definitely be allowed and even encouraged.  My hope, though, is that the way they express their hobby on this site will be to research answers from reliable sources, rather than to talk about their hobby of gathering personal experiences.  :)", "CreationDate": "2015-08-03T18:26:13.017", "UserId": 108}
{"Id": 151, "PostId": 61, "Score": 0, "Text": "That's what I hope from professionals, too.", "CreationDate": "2015-08-03T19:48:15.503", "UserId": 82}
{"Id": 133, "PostId": 64, "Score": 1, "Text": "Lol. Unholy trinity.", "CreationDate": "2015-08-01T23:50:25.397", "UserId": 251}
{"Id": 167, "PostId": 64, "Score": 0, "Text": "How do you suggest we use that rating system? Do we show the image, or is there something to click on before that happens? How about inlining such images?", "CreationDate": "2015-08-04T15:24:25.917", "UserId": 82}
{"Id": 168, "PostId": 64, "Score": 0, "Text": "I'm not sure I'm fully comfortable with 'any picture from a textbook' popping up when I don't expect them... I'm familiar with medical textbooks, and that stuff can definitely end in nightmares.", "CreationDate": "2015-08-04T15:25:15.443", "UserId": 82}
{"Id": 190, "PostId": 64, "Score": 0, "Text": "I am not advocating some sort of home-grown rating system. My point is explicit pictures should be linked.", "CreationDate": "2015-08-04T22:27:18.647", "UserId": 218}
{"Id": 208, "PostId": 64, "Score": 1, "Text": "Re: your opening statement, \"NSFW\" should probably be re-named (and is practically always treated as) \"NSF*\" where * = Work, my parents, my pastor, my children, the in-laws, the random stranger sitting behind me at Starbucks, and any number of other nouns.", "CreationDate": "2015-08-06T18:50:24.217", "UserId": 64}
{"Id": 212, "PostId": 64, "Score": 0, "Text": "@Flimzy I reused the term used in the question itself. I also specifically cited the example of \"browsing random Stack Exchange sites when I should be producing widgets because I am on the clock.\" But I agree, the concept does apply elsewhere.", "CreationDate": "2015-08-07T19:05:20.627", "UserId": 218}
{"Id": 140, "PostId": 71, "Score": 0, "Text": "What percentage of people adding tags to their question will consider this distinction?", "CreationDate": "2015-08-02T16:39:51.380", "UserId": 82}
{"Id": 146, "PostId": 71, "Score": 0, "Text": "If there's an important distinction, tag wikis should clarify how each should be used.", "CreationDate": "2015-08-03T14:16:19.733", "UserId": 90}
{"Id": 153, "PostId": 71, "Score": 0, "Text": "The construction of the words would support the distinction: \"contraception\" is \"contra(against)-[con]ception\".  But I expect that questions about abortion would either use their own tag, and/or be considered off-topic here.  Morning-after pills might sometimes (at least according to Hobby Lobby) not technically be contraception, then, but do we need to make that distinction in our tags?", "CreationDate": "2015-08-04T01:10:24.533", "UserId": 64}
{"Id": 166, "PostId": 71, "Score": 0, "Text": "@Flimzy both by definitions I've found and by word construction 'birth control' seems to be the broader term. We could lump in all contraception into birth control, and if people want to get really specific about it they can do so in the question itself. (?)", "CreationDate": "2015-08-04T15:23:11.337", "UserId": 82}
{"Id": 169, "PostId": 71, "Score": 0, "Text": "@Spork: Seems reasonable to me.", "CreationDate": "2015-08-04T16:29:31.950", "UserId": 64}
{"Id": 141, "PostId": 74, "Score": 0, "Text": "DBSM? Don't you mean BDSM?", "CreationDate": "2015-08-03T09:15:52.947", "UserId": 61}
{"Id": 143, "PostId": 74, "Score": 0, "Text": "@ShadowWizard: right, Just corrected my typo.", "CreationDate": "2015-08-03T10:06:26.510", "UserId": 115}
{"Id": 145, "PostId": 74, "Score": 0, "Text": "Thanks, can't suggest edits here on the meta site.", "CreationDate": "2015-08-03T10:42:16.823", "UserId": 61}
{"Id": 202, "PostId": 80, "Score": 0, "Text": "I guess a lot of this ultimately comes down to whether we think this is a site for sex advice, or for sex information. Information strikes me as much less inclined towards needing to be personal. I'll add an answer speaking to this, and we'll see where the voting takes it.", "CreationDate": "2015-08-06T18:12:30.317", "UserId": 108}
{"Id": 156, "PostId": 87, "Score": 0, "Text": "If a tag is removed, then used again, will the tag's wiki entry be restored?", "CreationDate": "2015-08-04T07:23:21.110", "UserId": 122}
{"Id": 158, "PostId": 87, "Score": 0, "Text": "@DireKitten - nope, if a tag is purged it is removed entirely. Generally tag wikis are best on the most popular tags (first 3-4 pages of tags on graduated sites). By then we will have worked out how we want to tag things and will have tags that are basically all but permanent. At the moment, with so few questions, the tags are quite volatile.", "CreationDate": "2015-08-04T07:28:54.697", "UserId": 124}
{"Id": 200, "PostId": 87, "Score": 0, "Text": "@DireKitten: That depends on how quickly the new question is added. But most tags with a single question (such that they would be subject to deletion) aren't likely to have tag wikis anyway.", "CreationDate": "2015-08-06T18:07:36.193", "UserId": 64}
{"Id": 196, "PostId": 93, "Score": 0, "Text": "Good comments on the specific answer, but doesn't address the broader question.", "CreationDate": "2015-08-06T06:11:59.533", "UserId": 72}
{"Id": 194, "PostId": 94, "Score": 1, "Text": "P.S., which I'm not quite sure if it belongs in my answer, per se, but see also: http://jezebel.com/the-problem-with-calling-women-females-1683808274", "CreationDate": "2015-08-05T17:58:13.333", "UserId": 108}
{"Id": 195, "PostId": 96, "Score": 0, "Text": "When you say \"feeling\" do you mean \"sensitivity\"? Feeling is such a vague term.", "CreationDate": "2015-08-06T01:59:19.093", "UserId": 122}
{"Id": 197, "PostId": 96, "Score": 0, "Text": "I know I don't mean sensitivity.   I'm almost drawn to attraction as the term, but you can have sexual feelings when alone, or a lack of sexual feeling ie asexual, so on balance I think that I would prefer that  - feelings - remains", "CreationDate": "2015-08-06T11:54:02.630", "UserId": 183}
{"Id": 198, "PostId": 100, "Score": 0, "Text": "It strikes me that you're moralizing left and right. I think this site shouldn't be about morality one way or another, with maybe a very few exceptions (consent, for example, and perhaps anti-oppression, anti-hate, etc.), but about *information*. About things that people *do*, however we may feel about them. Anal sex is not abnormal. It's something that many people (and not just homosexual men - and not all homosexual men, for that matter!) do and enjoy.", "CreationDate": "2015-08-06T18:02:29.413", "UserId": 108}
{"Id": 199, "PostId": 101, "Score": 0, "Text": "What does \"the heritage of the Chinese people\" have to do with sexuality, though? Also, I'm failing to see where you're actually answering the question here, one way or another. I'm sensing an implicit yes, though there's also an implicit no in \"be careful\".", "CreationDate": "2015-08-06T18:05:14.747", "UserId": 108}
{"Id": 203, "PostId": 101, "Score": 0, "Text": "@lindes I think this kind of decision requires judgment on a case-by-case basis.", "CreationDate": "2015-08-06T18:21:52.220", "UserId": 251}
{"Id": 204, "PostId": 101, "Score": 0, "Text": "ok... And what should be the general guidelines upon which such case-by-case decisions should be adjudicated?", "CreationDate": "2015-08-06T18:26:00.283", "UserId": 108}
{"Id": 205, "PostId": 101, "Score": 0, "Text": "@lindes History and impact. If something has historical significance or social significance, then I think someone's sex life may be explored in a question. Alfred Kinsey's sex life may be relevant to his theories.", "CreationDate": "2015-08-06T18:28:42.063", "UserId": 251}
{"Id": 211, "PostId": 101, "Score": 1, "Text": "political or other ways of impact is history not sexuality", "CreationDate": "2015-08-07T06:55:54.110", "UserId": 143}
{"Id": 201, "PostId": 105, "Score": 1, "Text": "Hmm. I'm not sure I agree, but there's interesting food for thought here. Thank you. Will ponder.", "CreationDate": "2015-08-06T18:10:04.763", "UserId": 108}
{"Id": 214, "PostId": 105, "Score": 0, "Text": "I find that the first question sounds like medical advice, and the second question sounds too embarrassing. Ah, well. It's the Internet. I guess embarrassing sex life stories roam free here.", "CreationDate": "2015-08-08T01:17:49.500", "UserId": 251}
{"Id": 215, "PostId": 105, "Score": 0, "Text": "@DoubleU: The second question is the *actual* question the OP referenced in their question.", "CreationDate": "2015-08-08T01:22:59.357", "UserId": 64}
{"Id": 224, "PostId": 112, "Score": 0, "Text": "*\"you - perhaps inadvertently - stepped into an intense ideological battle\"* - The 'ideological battle' isn't *relevant* to whether sex feels different with a circumcised man vs natural. My knowledge (or lack thereof) of the ideological battle is also not relevant to that question. I was merely hoping to have some frank answers that only concerned themselves with the *facts*, rather than politicised opinion.", "CreationDate": "2015-08-10T14:52:50.470", "UserId": 124}
{"Id": 225, "PostId": 112, "Score": 0, "Text": "For example: stating that the paper provided by another answerer is only a preliminary is fine, stating that it shouldn't be taken seriously because of this is also fine, but attributing bias or ill-will to an alleged anti-circumcision movement has *nothing to do with the question at hand*. You don't like the \"intactivits\" as you call them? that's fine, I get that, I also don't like people fudging results or leaving info out to suit their agenda - *but none of that is relevant within the context of the question.*", "CreationDate": "2015-08-10T14:53:21.390", "UserId": 124}
{"Id": 226, "PostId": 112, "Score": 0, "Text": "What is relevant is that the question you asked has become unanswerable, because whatever data might exist has become hopelessly corrupted by politics.", "CreationDate": "2015-08-10T17:16:41.590", "UserId": 228}
{"Id": 220, "PostId": 113, "Score": 0, "Text": "For the female genitals question: I wasn't surprised it was closed, since it's too simple. The close reason was ridiculous though. I suggest a different meta post.", "CreationDate": "2015-08-09T19:57:10.037", "UserId": 82}
{"Id": 221, "PostId": 113, "Score": 0, "Text": "I used NSFW because it has a well known meaning - not included only to work. Also, it's easy to land here from a work environment since there's the Hot Network Questions, and what if one of our questions ends up there and someone just interested clicked it? He/She doesn't expect to have a Full HD picture of genitals drawn on their screen right away. (or in case of Citrix: very, very slowly)", "CreationDate": "2015-08-09T19:59:09.370", "UserId": 82}
{"Id": 222, "PostId": 113, "Score": 0, "Text": "Anyway - not including pictures was never my aim. However, on other sites on SE there's also the use of Spoiler tags. In other words, they Can include information that may spoil, but the reader can choose whether or not to consume that information. I think I'd want something similar for pictures.", "CreationDate": "2015-08-09T20:00:19.043", "UserId": 82}
{"Id": 223, "PostId": 113, "Score": 0, "Text": "@Spork - Is there any way to do a thumbnail that you can click on to see the image full-size without leaving the site?", "CreationDate": "2015-08-09T22:18:41.273", "UserId": 228}
{"Id": 230, "PostId": 121, "Score": 8, "Text": "I'm of the opinion that the lack of sex educators is one of the main challenges this beta has; having more would certainly make a difference to my mind. (Your voice has set this particular iteration apart in my mind - it's leaps and bounds better than other attempts.) However, that call won't save this beta. It'd be better to seed a brand new attempt with those kinds of voices and build them into the proposal from the ground up. **I sincerely hope you do.**", "CreationDate": "2015-08-11T00:16:21.953", "UserId": 48}
{"Id": 232, "PostId": 121, "Score": 4, "Text": "@wigcanoe - Thank you for that, but I poured so much effort into making this work that I don't think I'd be up for another try.  I wish I had known more about SE betas before this started.  I could have started recruiting much sooner, but I had no idea that the window for evaluation would be so short.  For no particular reason, I assumed it would run for at least a month or two, and as a noob I was reluctant to bring in waves of newcomers to upset the old guard.  I see now that that was just what was needed, but I guess it's too late.  <sigh>  What a waste!", "CreationDate": "2015-08-11T03:16:06.773", "UserId": 228}
{"Id": 245, "PostId": 121, "Score": 1, "Text": "@Shakti ... Perhaps in time you'd be up for another try, after grieving a while? And perhaps I'll be better connected to the sex educator world in a while, and could help with some recruiting efforts... (I tried, for this one... I'm still so new to the field, though...)", "CreationDate": "2015-08-13T15:36:00.810", "UserId": 108}
{"Id": 246, "PostId": 121, "Score": 1, "Text": "@lindes - Anything's possible, but I have to admit I'm feeling pretty bummed about this.  For what it's worth, you added a lot.  Thanks for your efforts and good luck on whatever comes next!", "CreationDate": "2015-08-14T04:48:02.990", "UserId": 228}
{"Id": 247, "PostId": 121, "Score": 0, "Text": "@Shakti - understood. If you'd like to keep in touch about it, please feel free. Who knows, maybe a few of us could gather together somehow and plan out another attempt for sometime.", "CreationDate": "2015-08-14T15:12:34.080", "UserId": 108}
{"Id": 249, "PostId": 121, "Score": 0, "Text": "Too much is being expected from a small group of beta users. If you need more experts to increase quality, then it needs to be an open beta to reach a wider audience. Just because we committed to it on Area 51 doesn't mean we have all the answers. I could have contributed more, but I didn't know we were working against such an aggressive deadline.", "CreationDate": "2015-08-14T17:33:41.540", "UserId": 79}
{"Id": 238, "PostId": 122, "Score": 1, "Text": "I think you are cherry-picking an argument and presenting it as absolute. It doesn't say we didn't want this subject or \"expected it fail.\" The topic presents some unique challenges we were willing to tackle had the site only been more popular or inspired somehow, but it didn't have that kind of demand. I know it's tough to judge \"success\" by the numbers, but **the correlation between a slow start and sites that *never* gain traction is SO strong,** ignoring those hard-earned lessons is becoming increasingly irresponsible on our part. We've got to own up to it; we didn't pull it off this time.", "CreationDate": "2015-08-11T18:05:41.583", "UserId": 90}
{"Id": 239, "PostId": 122, "Score": 1, "Text": "Keep in mind that one does not have to be a certified sex educator to contribute constructive answers on this site. I think I've made quite a few constructive answers based on my readings in the academic literature, and with them I become a sort of demi-expert.", "CreationDate": "2015-08-11T18:12:03.687", "UserId": 251}
{"Id": 243, "PostId": 122, "Score": 1, "Text": "@RobertCartaino I can respect pulling the plug, the numbers are actually pretty convincing. I think the single number heuristic you guys use is actually a really good one. It's nicer to see it reasoned that way - and not the strange 'not professional', which anything down from SO basically isn't (especially the workplace).", "CreationDate": "2015-08-11T21:40:24.350", "UserId": 82}
{"Id": 250, "PostId": 123, "Score": 0, "Text": "Please elaborate on wny you think it's the correct path. You say there needed to be more and better content. Yet we weren't given much time--less than a month, right? And it was a private beta constrained to 200 people, right? I get the impression some people have just given up without truly making a concerted effort to make this site succeed. I could have done more too, but I volunteered my fair share of time and information. This site could've saved relationships and lives, it's not like we're talking about a site about coffee.", "CreationDate": "2015-08-14T17:39:06.750", "UserId": 79}
