{"Id": 40, "PostId": 1, "Score": 1, "Text": "Do you also include the risks of consuming the semen in this question, or just the fellatio act itself? IMO it can fit as a separate question but want to make sure first.", "CreationDate": "2015-07-28T19:16:31.853", "UserId": 61}
{"Id": 43, "PostId": 1, "Score": 0, "Text": "I hadn't thought of separating the questions, @ShadowWizard. I'd assume, though, that if a condom isn't used then at least *some* semen is likely to be consumed.", "CreationDate": "2015-07-28T19:19:24.550", "UserId": 5}
{"Id": 45, "PostId": 1, "Score": 0, "Text": "True, but what I meant is the risks involved in \"swallowing\" the whole ejaculation, not just few drops by mistake. I was considering to start such question, but thought it might be part of this one.", "CreationDate": "2015-07-28T19:21:46.640", "UserId": 61}
{"Id": 1, "PostId": 2, "Score": 2, "Text": "This looks like 2 questions, (1) how to remove body hair, (2) does removal of hair affect your sexual feelings. SE Sites work best when one question is asked per post", "CreationDate": "2015-07-28T18:18:15.367", "UserId": 16}
{"Id": 3, "PostId": 2, "Score": 0, "Text": "Actually both were related so close, so I decided to post here itself. But, as you suggest, should I edit/delete the second content? @BradleyDotNET", "CreationDate": "2015-07-28T18:19:21.920", "UserId": 13}
{"Id": 4, "PostId": 2, "Score": 0, "Text": "I would put the second one as a separate question (it would certainly be on-topic) and edit it out of this one. Also take out the content past the first comma in the title, its Sexuality.SE, we can guess what point of view this is coming from :)", "CreationDate": "2015-07-28T18:21:42.280", "UserId": 16}
{"Id": 5, "PostId": 2, "Score": 2, "Text": "I think this question needs a bit more detail about what you mean by \"best.\" Most painless? Thorough? So that it grows back in the softest? For now, I've voted to close as \"unclear what you're asking,\" but I'd be more than happy to retract that and/or vote to reopen with a bit more detail.", "CreationDate": "2015-07-28T18:25:40.643", "UserId": 23}
{"Id": 6, "PostId": 2, "Score": 0, "Text": "@Emrakul-I have improved and clarified your doubt in the question, please revisit it. Also, consider softer growth + taking longer time than usual rate if shaved.", "CreationDate": "2015-07-28T18:29:56.837", "UserId": 13}
{"Id": 7, "PostId": 3, "Score": 7, "Text": "Of note: not all IUDs are hormonal. In particular, there is a [copper version](https://en.wikipedia.org/wiki/IUD_with_copper) that works as a spermicide and (perhaps) by preventing implantation. Obviously the risks of this type of IUD would differ from the hormonal type.", "CreationDate": "2015-07-28T18:30:36.197", "UserId": 7}
{"Id": 8, "PostId": 3, "Score": 2, "Text": "@Jon Thanks for pointing that out! Clarified.", "CreationDate": "2015-07-28T18:32:24.473", "UserId": 23}
{"Id": 21, "PostId": 3, "Score": 0, "Text": "Note that these can also have side effects, and can be taken for other things (e.g. anti-depressants and \"the pill\" can be the same thing).", "CreationDate": "2015-07-28T18:55:32.077", "UserId": 3}
{"Id": 180, "PostId": 4, "Score": 0, "Text": "A friend of a friend said that she liked to keep her pubic hair shaved because it gave her more intense orgasms.", "CreationDate": "2015-07-29T04:42:27.583", "UserId": 131}
{"Id": 472, "PostId": 4, "Score": 0, "Text": "If you are happy with one of these answers it would be appropriate for you to mark it as the accepted answer. If none of these answers answer your question to the point of your satisfaction please tell us what more you want to know.", "CreationDate": "2015-08-02T00:00:17.147", "UserId": 33}
{"Id": 11, "PostId": 16, "Score": 2, "Text": "I'm very confused about what you are asking. Are you asking how you might talk your partner into doing fellatio with you?", "CreationDate": "2015-07-28T18:44:10.927", "UserId": 7}
{"Id": 13, "PostId": 16, "Score": 1, "Text": "Yes, I think that's my question. Sorry for my bad English.", "CreationDate": "2015-07-28T18:45:07.073", "UserId": 50}
{"Id": 47, "PostId": 16, "Score": 0, "Text": "Not referring it to it as \"fellatio\" might be a good first step.\n\n\"Oh baby, would you like to have coitus?\" >_> It's just as bad.", "CreationDate": "2015-07-28T19:28:22.960", "UserId": 86}
{"Id": 82, "PostId": 16, "Score": 7, "Text": "@XAleXOwnZX unlike other sites around the internet, this one here try to be professional thus using proper language. Title could be \"How to convince my girlfriend to suck my dick?\" but that just doesn't fit Stack Exchange.", "CreationDate": "2015-07-28T20:10:52.927", "UserId": 61}
{"Id": 226, "PostId": 16, "Score": 2, "Text": "convincing somebody to do something is not good for this site", "CreationDate": "2015-07-29T11:12:46.033", "UserId": 180}
{"Id": 240, "PostId": 16, "Score": 0, "Text": "I'm voting to close this question as off-topic because 'convincing' someone to do something they're not comfortable with is akin to taking advantage of them.", "CreationDate": "2015-07-29T13:06:17.470", "UserId": 124}
{"Id": 243, "PostId": 16, "Score": 0, "Text": "@Robotnik, I think I didn't want to say that. Maybe you can rephrase my question? Thanks", "CreationDate": "2015-07-29T13:07:36.910", "UserId": 50}
{"Id": 247, "PostId": 16, "Score": 0, "Text": "@akusaja - I have suggested a change to soften the wording, however I'm still not sure about the question. We will have to see how other people perceive it", "CreationDate": "2015-07-29T13:12:35.657", "UserId": 124}
{"Id": 329, "PostId": 16, "Score": 1, "Text": "Can't see how it's off topic. Voting to reopen", "CreationDate": "2015-07-29T19:39:53.213", "UserId": 61}
{"Id": 17, "PostId": 18, "Score": 5, "Text": "Depends wildly on the other type(s) of birth control. More detail, please.", "CreationDate": "2015-07-28T18:49:45.063", "UserId": 48}
{"Id": 24, "PostId": 18, "Score": 0, "Text": "I still don't understand what you're asking, even with your example. It's 99.95% \"safe\" to rely only on Implanon. That's what the probability means.", "CreationDate": "2015-07-28T19:00:15.180", "UserId": 48}
{"Id": 25, "PostId": 18, "Score": 0, "Text": "@abby Maybe I'm misunderstanding the safety metrics. Looking into it now.", "CreationDate": "2015-07-28T19:01:05.077", "UserId": 23}
{"Id": 44, "PostId": 18, "Score": 2, "Text": "Yeah, it looks like I was misunderstanding a couple things when I wrote this question. Sorry about that, @abby!", "CreationDate": "2015-07-28T19:19:34.923", "UserId": 23}
{"Id": 22, "PostId": 22, "Score": 1, "Text": "LOL, was this question asked to generate humour?", "CreationDate": "2015-07-28T18:58:03.963", "UserId": 13}
{"Id": 23, "PostId": 22, "Score": 2, "Text": "@shekharsuman: Nope. It was one of the questions asked during definition phase. It was serious then, and it's serious now.", "CreationDate": "2015-07-28T18:59:51.990", "UserId": 64}
{"Id": 28, "PostId": 22, "Score": 3, "Text": "@Flimzy, our audience and A51 tagline say \"human sexuality\" - not sure how much clearer it can get. Feel free to bring it up on meta; I'll happily step aside if I'm overruled by the community.", "CreationDate": "2015-07-28T19:04:12.653", "UserId": 48}
{"Id": 33, "PostId": 22, "Score": 1, "Text": "@wigcanoe: Done. See [here](http://meta.sexuality.stackexchange.com/q/8/64).", "CreationDate": "2015-07-28T19:07:01.500", "UserId": 64}
{"Id": 146, "PostId": 22, "Score": 2, "Text": "+1, i'm seeing in this brilliant question a new scientific approach to human sexuality.", "CreationDate": "2015-07-28T22:00:17.043", "UserId": 117}
{"Id": 29, "PostId": 26, "Score": 0, "Text": "Did you try aftershave and it didn't work, or just don't like aftershave? Thats how I got rid of them.", "CreationDate": "2015-07-28T19:05:02.630", "UserId": 16}
{"Id": 30, "PostId": 26, "Score": 0, "Text": "Really? I tried it a few years ago and my pimples almost developed intelligence. Maybe I have to try it again. How do you use it - just afterwards, or the next few days?", "CreationDate": "2015-07-28T19:05:58.520", "UserId": 73}
{"Id": 32, "PostId": 26, "Score": 0, "Text": "Just after shaving. I do use an electric razor that explicitly said it could be used near the genitals instead of a manual, which helps *a lot*.", "CreationDate": "2015-07-28T19:06:45.680", "UserId": 16}
{"Id": 34, "PostId": 26, "Score": 0, "Text": "What kind of electrical razor would you recommend (pubes only, not face)?", "CreationDate": "2015-07-28T19:07:19.470", "UserId": 73}
{"Id": 37, "PostId": 26, "Score": 0, "Text": "I don't remember my brand off hand, it was a Phillips though, and said it could be used near the genitals (and I do use a different, manual razor for my face)", "CreationDate": "2015-07-28T19:09:50.977", "UserId": 16}
{"Id": 38, "PostId": 26, "Score": 0, "Text": "Because this question is specifically about shaving, I won't answer but instead make a comment: I highly recommend a close cut with beauty scissors (and perhaps in combination with tweezers) for a more natural look which is a great deal more comfortable, no in-grown hairs, no stubble--takes a little bit more time to groom, but I think it's very worthwhile.", "CreationDate": "2015-07-28T19:11:34.097", "UserId": 79}
{"Id": 46, "PostId": 32, "Score": 5, "Text": "I'm voting to close this question as off-topic because this is more about an health issue than sexuality.", "CreationDate": "2015-07-28T19:24:40.927", "UserId": 61}
{"Id": 48, "PostId": 32, "Score": 1, "Text": "Not necessarily. It could be that it's not only the anti depressants. I'm asking for advice about the psychological issues that could cause this. The SSRI's are just a side note.", "CreationDate": "2015-07-28T19:28:37.367", "UserId": 73}
{"Id": 49, "PostId": 32, "Score": 2, "Text": "@ShadowWizard I disagree; while a condition that made erections physically impossible would not be something we could help with, often erectile dysfunction also stems from states of mind such as anxiety, and improving the conditions for sex could help the asker beyond advising the correct medicines.", "CreationDate": "2015-07-28T19:30:54.513", "UserId": 72}
{"Id": 50, "PostId": 32, "Score": 1, "Text": "I do get errections and I'm asking on advice on the psychological issues.", "CreationDate": "2015-07-28T19:31:38.640", "UserId": 73}
{"Id": 51, "PostId": 32, "Score": 1, "Text": "But you ask for medical advice e.g. advice about dopamine, hence my reasoning to close it.", "CreationDate": "2015-07-28T19:33:50.867", "UserId": 61}
{"Id": 72, "PostId": 32, "Score": 0, "Text": "Have you considered the fact that it may the that you're not in a committed relationship? It has been suggested that it increases likelihood of orgasms. Sorry - saying get a girlfriend isn't great advice but it may be what is needed.", "CreationDate": "2015-07-28T19:57:48.360", "UserId": 3}
{"Id": 91, "PostId": 32, "Score": 1, "Text": "Trivial question that nobody asked yet: do you ejaculate when masturbating?", "CreationDate": "2015-07-28T20:18:59.677", "UserId": 61}
{"Id": 97, "PostId": 32, "Score": 0, "Text": "Yes, but it takes me about 20 minutes.", "CreationDate": "2015-07-28T20:22:28.873", "UserId": 73}
{"Id": 192, "PostId": 32, "Score": 0, "Text": "I am not a doctor here, but... let's not have issues with questions and answers. So I'm giving you another \"trivial\" question here: is it possible that you may not like women?", "CreationDate": "2015-07-29T05:18:33.773", "UserId": 146}
{"Id": 199, "PostId": 32, "Score": 0, "Text": "Absolutely not. I'm a 100% straight.", "CreationDate": "2015-07-29T06:17:09.193", "UserId": 73}
{"Id": 324, "PostId": 32, "Score": 0, "Text": "@Restaurantkritiker: If you are getting escorts, it might help having the same one each time. Since you will know each other after the first encounter, it might result in better mood for both of you. Also, once a month is not too often. Increasing sex frequency AFAIK can lead to high libido. I would even suggest seeing a real MD/sexologist.", "CreationDate": "2015-07-29T19:13:44.480", "UserId": 151}
{"Id": 368, "PostId": 32, "Score": 0, "Text": "@Restaurantkritiker One can orgasm without ejaculating, and one can also ejaculate without orgasm.", "CreationDate": "2015-07-30T12:31:28.687", "UserId": 201}
{"Id": 510, "PostId": 32, "Score": 2, "Text": "Um, guys?  This may need to be rewritten to meet site standards, but in one form or another, this is going to be a recurring question.  Anorgasmia can happen for a lot of reasons, and we'll need answers pointing people to resources.  For example, one of the most common reasons for it in cases like this is called \"the Death Grip,\" a pressure-based form of masturbation that uses a very tight grip, doing (mostly temporary) damage to nerves in the penis.  Google \"death grip syndrome\" for full details.  That's where the OP should start, not with something experimental like cabergoline.", "CreationDate": "2015-08-03T03:52:58.280", "UserId": 228}
{"Id": 513, "PostId": 32, "Score": 0, "Text": "@Restaurantkritiker - It is almost certainly the antidepressants.  I used to take Zoloft, and it made me last forever in bed, which was pretty cool, but it also made it impossible to climax sometimes, which was less cool.  I'm talking about a ridiculous amount of time before climaxing - up to 6 hours.  Antidepressants are notorious for this side effect, so you might want to talk to your doctor about how to address the issue.", "CreationDate": "2015-08-03T05:47:27.097", "UserId": 98}
{"Id": 514, "PostId": 32, "Score": 0, "Text": "I talked to my doc and I'm now on Bupropione. Maybe it's really the SSRI's... I'm gonna try this out.", "CreationDate": "2015-08-03T05:51:33.510", "UserId": 73}
{"Id": 521, "PostId": 32, "Score": 1, "Text": "@ShadowWizard: This board is about *SEXUALITY*, and an orgasm is something that has to do with sexuality, and so has a Question that asks about problems that you can have with getting an orgasm. Even if there are medical conditions involved in this case, so it still has to do with sexuality, and so is **on-topic**.", "CreationDate": "2015-08-03T08:52:47.183", "UserId": 115}
{"Id": 522, "PostId": 32, "Score": 0, "Text": "@HubertSchölnast well, given the new details (the person can reach orgasm during masturbation but not with escort) I agree, but before those details were here it appeared to be purely medical issue.", "CreationDate": "2015-08-03T08:56:53.583", "UserId": 61}
{"Id": 524, "PostId": 32, "Score": 1, "Text": "@ShadowWizard: The question was on-topic even before any editing, in it's first version. Short formula: Orgasm = sexuality = on-topic.", "CreationDate": "2015-08-03T10:05:43.480", "UserId": 115}
{"Id": 110, "PostId": 35, "Score": 5, "Text": "@paqogomez Comments are to ask for clarification or to help improve the post. We do not support answers in comments because comments do support features like proper voting and the wiki-style editing that allow us to et and improve the content. Comments appear conspicuously at the top of the thread where voting is supposed to determine which answers rise to the top. If you have an answer, please post it below. Thanks.", "CreationDate": "2015-07-28T20:37:37.333", "UserId": 90}
{"Id": 57, "PostId": 39, "Score": 0, "Text": "According to whom? Which definition(s) do we accept?", "CreationDate": "2015-07-28T19:44:47.863", "UserId": 64}
{"Id": 58, "PostId": 39, "Score": 0, "Text": "@Flimzy generally speaking, not according to any specific person/organization. (though now looking at it this way, might be off topic here...)", "CreationDate": "2015-07-28T19:49:27.980", "UserId": 61}
{"Id": 60, "PostId": 39, "Score": 1, "Text": "That sounds an awful lot like a poll question, then.  What kind of answer are you hoping to receive?", "CreationDate": "2015-07-28T19:50:38.460", "UserId": 64}
{"Id": 63, "PostId": 39, "Score": 0, "Text": "@Flimzy I don't really expect any particular answer. (just got two, which both look good though)", "CreationDate": "2015-07-28T19:52:20.450", "UserId": 61}
{"Id": 77, "PostId": 40, "Score": 0, "Text": "Shouldn't \"Does the G-spot exist?\" be its own question?", "CreationDate": "2015-07-28T20:06:34.817", "UserId": 64}
{"Id": 78, "PostId": 40, "Score": 0, "Text": "@Flimzy no, it would be only Yes/No answer while I look for more than that.", "CreationDate": "2015-07-28T20:07:14.837", "UserId": 61}
{"Id": 80, "PostId": 40, "Score": 0, "Text": "I suspect it would be a lot more than a yes/no answer. Something like \"The spot exists, but not all women have it and/or it's not always accessible in all women\" would be far more likely (as I'm quite sure that is the actual answer)", "CreationDate": "2015-07-28T20:08:52.410", "UserId": 64}
{"Id": 81, "PostId": 40, "Score": 0, "Text": "I guess my concern with this question is that it's based on an acknowledged possible myth.  \"Assuming Santa Claus exists, where does he live?\"  doesn't sound like a great question to me.  Is there some way to edit it to be more concrete, perhaps without asking about the existence of the G-Spot separately?", "CreationDate": "2015-07-28T20:09:42.107", "UserId": 64}
{"Id": 83, "PostId": 40, "Score": 0, "Text": "I can't think of such edit @Flimzy, if you can, feel free to suggest. (or close as off topic, nothing personal here)", "CreationDate": "2015-07-28T20:12:39.203", "UserId": 61}
{"Id": 84, "PostId": 40, "Score": 2, "Text": "Is the question about the orgasm, or the G-spot? The concepts are not necessarily related. Lots of people have orgasms without ever experiencing G-spot stimulation, and lots of people experience G-spot stimulation without having orgasms.", "CreationDate": "2015-07-28T20:13:05.277", "UserId": 48}
{"Id": 88, "PostId": 40, "Score": 1, "Text": "@abby thanks, you are right. Edited now to make it clear I'm only interested in finding the G-spot", "CreationDate": "2015-07-28T20:16:17.080", "UserId": 61}
{"Id": 70, "PostId": 41, "Score": 0, "Text": "Dunno about pelvic muscles, but from personal experience holding my pee has no effect.", "CreationDate": "2015-07-28T19:55:45.997", "UserId": 61}
{"Id": 73, "PostId": 41, "Score": 0, "Text": "I believe it is to do with keeping it lasting a long time...", "CreationDate": "2015-07-28T20:01:25.103", "UserId": 3}
{"Id": 74, "PostId": 41, "Score": 0, "Text": "@ShadowWizard-Maybe you mightn't have tried the same with an intent of careful analysis/observation!", "CreationDate": "2015-07-28T20:01:42.410", "UserId": 13}
{"Id": 107, "PostId": 45, "Score": 2, "Text": "How is this broad?", "CreationDate": "2015-07-28T20:31:54.993", "UserId": 97}
{"Id": 649, "PostId": 45, "Score": 1, "Text": "Is this question intended to focus on the origins of fetishes, or also on whether fetishes tend to be dysfunctional as an adult?", "CreationDate": "2015-08-05T06:45:17.167", "UserId": 72}
{"Id": 657, "PostId": 45, "Score": 2, "Text": "@Saposhiente: I guess my core question would be along the lines of \"If I have a fetish, should I be concerned about it for some reason?\" A secondary question would be \"If I have a fetish, does it means something 'bad' happened to me earlier in life (and thus a reason to be concerned)?\" But perhaps those should be split into two questions?", "CreationDate": "2015-08-05T17:04:35.413", "UserId": 64}
{"Id": 661, "PostId": 45, "Score": 0, "Text": "I do think it's likely worth splitting these into two questions.", "CreationDate": "2015-08-05T17:23:39.430", "UserId": 108}
{"Id": 663, "PostId": 45, "Score": 0, "Text": "I have narrowed this question to focus on whether a fetish is a dysfunction, and have asked [another question](http://sexuality.stackexchange.com/q/292/64) to focus on the possible causes.", "CreationDate": "2015-08-05T17:39:04.460", "UserId": 64}
{"Id": 93, "PostId": 54, "Score": 0, "Text": "Couldn't get your question? How can an orgasm be fake? DO you mean `not doing with any interest in it`?", "CreationDate": "2015-07-28T20:20:04.310", "UserId": 13}
{"Id": 94, "PostId": 54, "Score": 1, "Text": "@shekharsuman Fake in the sense that the person is pretending to have an orgasm when in fact they had none.", "CreationDate": "2015-07-28T20:21:00.217", "UserId": 72}
{"Id": 95, "PostId": 54, "Score": 0, "Text": "@shekharsuman they pretend to enjoy the coitus, but they don't", "CreationDate": "2015-07-28T20:21:48.233", "UserId": 97}
{"Id": 98, "PostId": 54, "Score": 1, "Text": "@Shevliaskovic No; a person may enjoy coitus even if they do not orgasm.", "CreationDate": "2015-07-28T20:24:32.023", "UserId": 72}
{"Id": 155, "PostId": 55, "Score": 1, "Text": "@Flimzy is right with this, I think. The question feels like it would be better suited to people who are sexually *active*, as opposed to just people who are sexually promiscuous. The latter just seems to lean more toward the \"all sexually promiscuous people spread diseases\" camp, which, frankly, is a rather offensive generalization, I think.", "CreationDate": "2015-07-28T22:35:53.403", "UserDisplayName": "user121"}
{"Id": 156, "PostId": 55, "Score": 2, "Text": "I have submitted an edit to remove the \"sexually promiscuous\" language from the question. If I have in some way altered the meaning of the question, please feel free to reject or change my edit accordingly.", "CreationDate": "2015-07-28T22:39:47.700", "UserId": 64}
{"Id": 133, "PostId": 56, "Score": 0, "Text": "Are you male or female?", "CreationDate": "2015-07-28T21:42:09.130", "UserId": 3}
{"Id": 134, "PostId": 56, "Score": 0, "Text": "I am male. Why do you ask?", "CreationDate": "2015-07-28T21:42:50.263", "UserId": 33}
{"Id": 135, "PostId": 56, "Score": 2, "Text": "It kinda dramatically changes an answer - is it male on female or female on female. :)", "CreationDate": "2015-07-28T21:43:27.217", "UserId": 3}
{"Id": 143, "PostId": 56, "Score": 0, "Text": "the question seems vague, you should try better describing what type of intercourses you have, or what kind of informations have you found so far about the argument.", "CreationDate": "2015-07-28T21:53:51.247", "UserId": 117}
{"Id": 144, "PostId": 56, "Score": 1, "Text": "I think this question needs to be made much more focused. Are you specifically trying to give your partner orgasm during penile/vaginal penetration? Or via manual stimulation? Or oral stimulation? Or something else?", "CreationDate": "2015-07-28T21:59:14.093", "UserId": 64}
{"Id": 145, "PostId": 56, "Score": 0, "Text": "@kzkz I wrote that answer for another question where it quite didn't belong. So I made a Q&A style question.", "CreationDate": "2015-07-28T22:00:06.737", "UserId": 33}
{"Id": 147, "PostId": 56, "Score": 0, "Text": "maybe i was vague myself, i was thinking exactly what @Flimzy said. I find the question of interest though.", "CreationDate": "2015-07-28T22:03:25.133", "UserId": 117}
{"Id": 148, "PostId": 56, "Score": 0, "Text": "@BrainStone I don't understood what you meant until I realized you are both the questioner and the answerer... how is that? are you serious?", "CreationDate": "2015-07-28T22:05:28.737", "UserId": 117}
{"Id": 151, "PostId": 56, "Score": 0, "Text": "@kzkz As I said before. The answer I gave was intended for another question but not 100% on point. So I created this question to create a place to put it. I myself am not experiencing this problem. I just wanted to help people who do.", "CreationDate": "2015-07-28T22:14:06.483", "UserId": 33}
{"Id": 179, "PostId": 60, "Score": 0, "Text": "Ruled out multiple orgasms? And what about natural substances?", "CreationDate": "2015-07-29T04:36:56.857", "UserId": 79}
{"Id": 183, "PostId": 60, "Score": 0, "Text": "@sss4r sorry but what multiple orgasms got to do with that? Natural substances sounds promising, but not familiar with any.", "CreationDate": "2015-07-29T05:02:27.193", "UserId": 61}
{"Id": 189, "PostId": 60, "Score": 0, "Text": "Your question is about extending the duration of intercourse. There is an assumption being made that it means delaying orgasm. I am simply pointing out that some men orgasm and continue on and repeat one or more times without interruption. If your goal is to prolong sex, it doesn't necessarily have to mean delaying orgasm (making the AKA in your question a bit of a misnomer), it could mean having more orgasms in the same session without pause or break, but that's perhaps another question.", "CreationDate": "2015-07-29T05:09:54.043", "UserId": 79}
{"Id": 193, "PostId": 60, "Score": 0, "Text": "@sss4r I see. While ideal, I simply don't have such skill. (after orgasm I can't keep going)", "CreationDate": "2015-07-29T05:25:16.913", "UserId": 61}
{"Id": 213, "PostId": 60, "Score": 0, "Text": "But would you like to develop that ability? That's what I meant about it being another question. Or possibly a rephrasing of your original question, hence my inquiry on it being ruled out.", "CreationDate": "2015-07-29T09:02:22.700", "UserId": 79}
{"Id": 214, "PostId": 60, "Score": 0, "Text": "@sss4r well, I used to have that \"ability\" when I was younger and while it would be nice to get it back, it's better be posted as a separate question.", "CreationDate": "2015-07-29T09:10:27.087", "UserId": 61}
{"Id": 115, "PostId": 64, "Score": 0, "Text": "\"Condoms are fun killers\", you mean also [female condom](https://en.wikipedia.org/wiki/Female_condom)?", "CreationDate": "2015-07-28T20:48:48.390", "UserId": 61}
{"Id": 116, "PostId": 64, "Score": 0, "Text": "@ShadowWizard: Yes, I would put female condoms in that category, as well, although we've never actually tried that.", "CreationDate": "2015-07-28T20:52:52.973", "UserId": 64}
{"Id": 123, "PostId": 64, "Score": 1, "Text": "I'm not sure what you mean by \"playing Russian roulette\". A hormone implant has [the best failure rate](http://www.cdc.gov/reproductivehealth/unintendedpregnancy/contraception.htm) of all common methods. Perhaps you are thinking of the [various health risks](http://www.implanon-usa.com/en/consumer/about-it/risks-and-side-effects/index.xhtml)?", "CreationDate": "2015-07-28T21:05:58.480", "UserId": 7}
{"Id": 124, "PostId": 64, "Score": 0, "Text": "@JonEricson: It was a reference to the various health risks. Perhaps I can better phrase it.", "CreationDate": "2015-07-28T21:06:55.873", "UserId": 64}
{"Id": 416, "PostId": 64, "Score": 0, "Text": "Natural Family Planning? It is based on fertility awareness, and it involves no hormones. It's also temporary, because there is nothing preventing conception during the act of intercouse, except time.", "CreationDate": "2015-07-31T15:28:28.923", "UserId": 251}
{"Id": 715, "PostId": 70, "Score": 0, "Text": "I am aware of \"dry orgasm,\" which is orgasm without the ejaculate. That is to say, male orgasm and ejaculation are not the same thing.", "CreationDate": "2015-08-06T12:24:22.630", "UserId": 251}
{"Id": 117, "PostId": 71, "Score": 1, "Text": "What do you mean by \"affect\"?  Like cause physical damage?  Mental consequences?", "CreationDate": "2015-07-28T20:54:22.030", "UserId": 102}
{"Id": 119, "PostId": 71, "Score": 2, "Text": "@Lysander both.", "CreationDate": "2015-07-28T20:55:50.220", "UserId": 97}
{"Id": 399, "PostId": 71, "Score": 0, "Text": "Excessive masturbation by definition has adverse effects. That's what makes it 'excessive'. Like excessive shopping, or excessive exercise. Are you wondering if masturbation is dangerous as compared to, say, shaking hands, or are you wondering what happens if you shake hands excessively?", "CreationDate": "2015-07-30T20:59:22.520", "UserId": 82}
{"Id": 688, "PostId": 71, "Score": 0, "Text": "Too much?  Blisters or callouses are one sign...", "CreationDate": "2015-08-06T02:27:42.470", "UserId": 17}
{"Id": 175, "PostId": 75, "Score": 2, "Text": "My Googling \"cocoa butter sex\" turned up a number of products which contain or consist entirely of cocoa butter.  Odds are good that it's a safe personal lubricant.", "CreationDate": "2015-07-29T03:28:41.940", "UserId": 131}
{"Id": 387, "PostId": 75, "Score": 0, "Text": "Note that any lubricant based on \"fat\" instead of water will degrade latex, and that any petroleum based product might damage silicone sex toys.", "CreationDate": "2015-07-30T18:02:06.703", "UserId": 242}
{"Id": 402, "PostId": 75, "Score": 3, "Text": "I'd be more worried about the essential oils. The walls of the vagina are permeable, and will absorb a lot of these oils. Some oils in high quantities can be very dangerous. I know that too much peppermint can result cardiac issues. Make sure that you do proper research on the oils that you want to use!", "CreationDate": "2015-07-31T07:40:28.960", "UserId": 233}
{"Id": 426, "PostId": 75, "Score": 0, "Text": "By 'internal' do you mean eating or putting it in the other orifices?", "CreationDate": "2015-07-31T17:54:11.117", "UserId": 207}
{"Id": 149, "PostId": 77, "Score": 0, "Text": "See http://sexuality.stackexchange.com/questions/66/is-withdrawal-effective-at-avoiding-pregnancy", "CreationDate": "2015-07-28T22:08:44.853", "UserId": 37}
{"Id": 164, "PostId": 77, "Score": 0, "Text": "Seems like there should be a scientific answer.  Spermatozoa are easy enough to see under a microscope.  Any sample of pre-ejaculate can be checked for the presence of sperm.  If they are present then pregnancy is possible.  If not, then no.", "CreationDate": "2015-07-29T00:29:31.483", "UserId": 102}
{"Id": 158, "PostId": 80, "Score": 0, "Text": "Did you *heat* the cornstarch? It won't gelatinize until ~160-190F; friction is unlikely to be sufficient. [Alternately...](http://www.amazon.com/Passion-Natural-Water-Based-Lubricant-Gallon/dp/B005MR3IVO)", "CreationDate": "2015-07-28T23:33:07.620", "UserId": 126}
{"Id": 168, "PostId": 80, "Score": 0, "Text": "@Wanderer No.... wasn't aware that was desirable (though warmer slime would be nice!)", "CreationDate": "2015-07-29T00:58:41.550", "UserId": 16}
{"Id": 162, "PostId": 83, "Score": 0, "Text": "This sounds like a medical question about how your body responds to the drug Viagra.  I believe the mods have declared medical questions to be off-topic in this site.", "CreationDate": "2015-07-29T00:22:27.177", "UserId": 131}
{"Id": 163, "PostId": 83, "Score": 1, "Text": "@Eleomosynator, are you sure? Do you have a link to that declaration? Also, I think this should be allowed here because it has more to do with having a fulfilling sexual life than cut and dry medication.", "CreationDate": "2015-07-29T00:26:06.707", "UserId": 130}
{"Id": 167, "PostId": 83, "Score": 0, "Text": "Another question posted recently about erectile dysfunction was flagged as such. I'll look up the actual rules when I get home. I'm like 90% sure. Definitely not trying to pick on you or anything. Thanks for your understanding.", "CreationDate": "2015-07-29T00:56:42.430", "UserId": 131}
{"Id": 171, "PostId": 83, "Score": 0, "Text": "@Eleomosynator, isn't erectile dysfunction is also a part of the ( failed) human sexuality? I think this rule simply doesn't make sense", "CreationDate": "2015-07-29T01:25:28.923", "UserId": 130}
{"Id": 172, "PostId": 83, "Score": 4, "Text": "I don't think \"the mods\" have declared anything off-topic here... this is really what beta, and especially private-beta is for.  Whether medical questions like this are off-topic or not, AFAIK, is an open question.", "CreationDate": "2015-07-29T01:48:50.870", "UserId": 64}
{"Id": 173, "PostId": 83, "Score": 0, "Text": "See this question for an example of a question being declared \"off-topic\" for being primarily medical: (http://sexuality.stackexchange.com/questions/32/im-male-and-cant-reach-an-orgasm) .", "CreationDate": "2015-07-29T02:56:12.727", "UserId": 131}
{"Id": 174, "PostId": 83, "Score": 0, "Text": "Also, I searched the help page and could not find an explicit list of which topics are on or off topic.  Not trying to make life hard for anybody.  Just trying to follow those guys' lead.", "CreationDate": "2015-07-29T02:57:33.170", "UserId": 131}
{"Id": 176, "PostId": 83, "Score": 2, "Text": "@Eleomosynator The other question had additional issues of being rather broad. What will likely happen is some more medical questions will pop up and then we'll have a proper Meta discussion about it, using them as examples of how well or poorly it fits.", "CreationDate": "2015-07-29T03:37:23.463", "UserId": 72}
{"Id": 197, "PostId": 83, "Score": 0, "Text": "@Eleomosynator, I *do* think this topic is very much on-site. On the [tour page](http://sexuality.stackexchange.com/tour): *Sexuality Stack Exchange is a question and answer site for people studying human sexuality from a frank and **clinical** point of view*", "CreationDate": "2015-07-29T05:55:37.113", "UserId": 130}
{"Id": 200, "PostId": 83, "Score": 1, "Text": "@Graviton I stand corrected.", "CreationDate": "2015-07-29T06:31:00.180", "UserId": 131}
{"Id": 203, "PostId": 88, "Score": 0, "Text": "If you have it, please could you reference or link to the research?", "CreationDate": "2015-07-29T07:17:36.707", "UserId": 162}
{"Id": 272, "PostId": 89, "Score": 0, "Text": "You might put a condom and a pant with a hole. A female condom will better stay in place. But this is not such answers that you seem to ask here.", "CreationDate": "2015-07-29T14:24:49.577", "UserId": 201}
{"Id": 295, "PostId": 89, "Score": 0, "Text": "@mansa pant with hole? Didn't get that part. I once tried sleeping with condom when I had wet dreams, but it simply fell off while the penis was flaccid. Ended up just stuffing lots of toilet paper in my underwear, and it did \"work\", but guess it's more of a \"life hack\" than actual answer here.", "CreationDate": "2015-07-29T16:33:18.307", "UserId": 61}
{"Id": 296, "PostId": 89, "Score": 0, "Text": "@ShadowWizard I think what mansa means is you won't make mess with your pant. Also, \"a female condom will better stay in place\". If you know that you will have wet dream, why don't you just masturbate before sleeping?", "CreationDate": "2015-07-29T16:35:47.273", "UserId": 147}
{"Id": 297, "PostId": 89, "Score": 0, "Text": "@Ooker the thing is, one can't know he's going to have wet dream. Back in the time, it just happened sometimes. And as for pant with hole, what's the point if you have condom? (not to mention the mess will be on the bed, which is even worse than in pants)", "CreationDate": "2015-07-29T16:42:38.520", "UserId": 61}
{"Id": 302, "PostId": 89, "Score": 0, "Text": "@ShadowWizard so you have to prepare the paper all the time? The pant and the condom is not my idea. I guess what he means is using either one of two. I don't know why using pants with hole here, too. If you should that method, why don't you just [sleeping naked](https://www.google.com/search?q=sleeping+nake&ie=utf-8&oe=utf-8)?", "CreationDate": "2015-07-29T17:21:39.770", "UserId": 147}
{"Id": 306, "PostId": 89, "Score": 0, "Text": "@Ooker well, after a while I stopped of course but essentially yes, every night. As for sleeping naked, cleaning the mess from the bed sheets is worse than cleaning the underwear and pants, in my opinion.", "CreationDate": "2015-07-29T17:36:20.603", "UserId": 61}
{"Id": 307, "PostId": 89, "Score": 0, "Text": "@ShadowWizard I mean, you gonna clean the bed anyway :). Let's see how mansa replies.", "CreationDate": "2015-07-29T17:40:37.813", "UserId": 147}
{"Id": 309, "PostId": 89, "Score": 0, "Text": "haha, maybe we should really take it to chat, as the system offers... lol", "CreationDate": "2015-07-29T17:43:24.333", "UserId": 61}
{"Id": 409, "PostId": 89, "Score": 0, "Text": "@Shadow Wizard , Ooker: [this pant with hole](https://www.amazon.fr/gp/product/B00UA2N3KC/ref=oh_aui_detailpage_o08_s00?ie=UTF8&psc=1) or [that one](https://www.amazon.fr/gp/product/B00HP2T7FK/ref=oh_aui_detailpage_o00_s00?ie=UTF8&psc=1). I have actually bought one of both. If you are not slim enough, you won't be able to bear it a whole night. (maybe it is not a pant, english is not my native language)", "CreationDate": "2015-07-31T10:09:57.327", "UserId": 201}
{"Id": 410, "PostId": 89, "Score": 0, "Text": "@mansa but I don't really understand what is the point of this? Why pants with hole?", "CreationDate": "2015-07-31T10:40:22.430", "UserId": 61}
{"Id": 411, "PostId": 89, "Score": 0, "Text": "So that the condom stays in place when your penis gets flaccid during the night.", "CreationDate": "2015-07-31T10:51:25.497", "UserId": 201}
{"Id": 413, "PostId": 89, "Score": 0, "Text": "@mansa I guess this procedure is inconvenient than just washing the pant...", "CreationDate": "2015-07-31T15:14:14.133", "UserId": 147}
{"Id": 423, "PostId": 89, "Score": 0, "Text": "@mansa can't really see how this will work, but if you say it works guess you found a way. Anyway like Ooker said it's way too much \"complicated\", better just clean the pants and be done with. :)", "CreationDate": "2015-07-31T16:32:54.717", "UserId": 61}
{"Id": 511, "PostId": 89, "Score": 0, "Text": "What mess do you have to clean up?  If you're wearing underwear when you go to bed, the \"mess\" is contained, and all you need to do is throw the underwear into the hamper, which you would hopefully have done anyway.", "CreationDate": "2015-08-03T05:03:08.507", "UserId": 98}
{"Id": 517, "PostId": 89, "Score": 0, "Text": "@WadCheber but wearing underwear all night isn't good for your health", "CreationDate": "2015-08-03T08:32:12.503", "UserId": 147}
{"Id": 561, "PostId": 89, "Score": 0, "Text": "@Ooker - Pshht.", "CreationDate": "2015-08-03T17:59:06.673", "UserId": 98}
{"Id": 564, "PostId": 89, "Score": 0, "Text": "@Ooker - I sleep with my dog, and not wearing underwear in bed would create the possibility of her licking things she shouldn't be licking.  I don't think boxers, which are my underwear of choice, are problematic anyway, but even if they were, I'd rather risk health problems than wake up with my dog licking my butt or something.", "CreationDate": "2015-08-03T18:07:53.287", "UserId": 98}
{"Id": 565, "PostId": 89, "Score": 0, "Text": "@WadCheber well....", "CreationDate": "2015-08-03T18:10:04.973", "UserId": 147}
{"Id": 187, "PostId": 92, "Score": 0, "Text": "Very thought-provoking situation !!! Never knew that this results in those ill scenarios.", "CreationDate": "2015-07-29T05:08:36.687", "UserId": 13}
{"Id": 188, "PostId": 92, "Score": 0, "Text": "It's actually a disfunction stated in the collateral effects list (**strangely** only with a low rarity)", "CreationDate": "2015-07-29T05:09:19.420", "UserId": 146}
{"Id": 239, "PostId": 97, "Score": 0, "Text": "@Spork I don't think so, this is asking what's inside. The dupe is asking what it is.", "CreationDate": "2015-07-29T13:03:43.187", "UserId": 170}
{"Id": 242, "PostId": 97, "Score": 0, "Text": "@UnicornsAreVeryVeryYummy how is that different?", "CreationDate": "2015-07-29T13:07:21.683", "UserId": 82}
{"Id": 595, "PostId": 100, "Score": 1, "Text": "I don't know what you *should* do, but I know exactly what I *would* do:  Scream, cry, and pray for the eternal release that only sweet, sweet death can provide.", "CreationDate": "2015-08-04T01:36:04.280", "UserId": 98}
{"Id": 255, "PostId": 125, "Score": 3, "Text": "<spoiler>Also, you know that most of the times in those \"raunchy films\" it's all a fake? Not a single drop is real? Just saying...</spoiler>", "CreationDate": "2015-07-29T13:42:38.127", "UserId": 61}
{"Id": 257, "PostId": 125, "Score": 0, "Text": "@ShadowWizard :0 You've ruined everything! :P Lol but yeah I realise that, but still, there are people out there that produce a lot of semen, and I'm wondering if there's anything I could be doing to increase mine.", "CreationDate": "2015-07-29T13:46:04.920", "UserId": 124}
{"Id": 258, "PostId": 125, "Score": 0, "Text": "I think that pornstars are often chosen partly on the basis of their load, I think it's genetics more than anything.", "CreationDate": "2015-07-29T13:47:35.557", "UserId": 171}
{"Id": 259, "PostId": 125, "Score": 0, "Text": "lol, added spoiler tags. :D anyway, from own experience I have a feeling that it's something people love to brag about while it's not true - actual volume is usually much less than what people say, even to their friends. Can't really say what is normal, average, etc but just a feeling that even if it looks little amount, it's still just fine and probably what most men have.", "CreationDate": "2015-07-29T13:49:27.330", "UserId": 61}
{"Id": 265, "PostId": 125, "Score": 0, "Text": "Fairly common is taking zinc and folic acid together, which increases your metabolism. Also amino acids, like arginine, should help increasing the sperm count. But I think the best way is to increase your volume is to abstain (for like a day or 2) from orgasms.", "CreationDate": "2015-07-29T14:10:25.127", "UserId": 193}
{"Id": 796, "PostId": 125, "Score": 0, "Text": "@Adriandmen - Interesting. Would you care to flesh that out into an answer in it's own right?", "CreationDate": "2015-08-08T16:55:21.987", "UserId": 124}
{"Id": 912, "PostId": 125, "Score": 0, "Text": "I'm not sure why you would want to.", "CreationDate": "2015-08-11T03:24:14.673", "UserId": 98}
{"Id": 913, "PostId": 125, "Score": 0, "Text": "@BatFrett - *\"...both my partner and I like the idea of a 'large load'\"*.", "CreationDate": "2015-08-11T04:05:27.783", "UserId": 124}
{"Id": 914, "PostId": 125, "Score": 0, "Text": "@Robotnik - I'm still not sure why you would want to...  :)", "CreationDate": "2015-08-11T04:06:24.303", "UserId": 98}
{"Id": 291, "PostId": 134, "Score": 0, "Text": "I am sorry that most of my resources are in french. If you want I can provide them.", "CreationDate": "2015-07-29T15:44:45.050", "UserId": 201}
{"Id": 356, "PostId": 134, "Score": 0, "Text": "Flimzy: Exactly.", "CreationDate": "2015-07-30T09:02:46.607", "UserId": 201}
{"Id": 370, "PostId": 134, "Score": 4, "Text": "Thanks. I have edited your question to make that clear, and remove a bunch of unrelated commentary. I hope you don't mind the edit.", "CreationDate": "2015-07-30T13:57:39.037", "UserId": 64}
{"Id": 405, "PostId": 134, "Score": 0, "Text": "@Flimzy : Thanks", "CreationDate": "2015-07-31T09:09:46.540", "UserId": 201}
{"Id": 313, "PostId": 140, "Score": 1, "Text": "I'm not a doctor, but it seems the effect would be similar to ejaculating with a vasectomy (that is, none).", "CreationDate": "2015-07-29T18:41:24.633", "UserId": 16}
{"Id": 323, "PostId": 140, "Score": 1, "Text": "Do you mean ceasing stimulation just before orgasm in order to prevent evacuation, or are you talking about physically blocking the semen by preventing it from exiting through the urethra? The answers are polar opposites, so I am seeking clarification to \"not allowing the sperm to come out\" (which probably needs to be edited for clarity).", "CreationDate": "2015-07-29T19:13:08.030", "UserId": 79}
{"Id": 354, "PostId": 140, "Score": 0, "Text": "Sorry for the confusion. I actually mean to cease the simulation just before orgasm in order to prevent ejaculation. ;-)", "CreationDate": "2015-07-30T07:55:52.807", "UserId": 219}
{"Id": 340, "PostId": 150, "Score": 0, "Text": "No no, it's not just \"What causes morning wood?\" we have more than enough of those all around the internet. Will think of better wording", "CreationDate": "2015-07-29T21:23:32.947", "UserId": 61}
{"Id": 342, "PostId": 150, "Score": 0, "Text": "@Flimzy did my best, won't fight over closing this though.", "CreationDate": "2015-07-29T21:28:00.837", "UserId": 61}
{"Id": 353, "PostId": 153, "Score": 1, "Text": "It is a misconception that orgasm == ejaculation. Ejaculation can ocurr without orgasm, and vice versa", "CreationDate": "2015-07-30T07:13:58.530", "UserId": 124}
{"Id": 361, "PostId": 153, "Score": 1, "Text": "@Robotnik I have edited my answer to reflect that, thank you!", "CreationDate": "2015-07-30T10:39:52.290", "UserId": 78}
{"Id": 363, "PostId": 156, "Score": 1, "Text": "There is a condition where a woman can experience orgasm from just holding a vibrating toothbrush, so I believe they do not need love. There is also the case of one-night-stands.", "CreationDate": "2015-07-30T10:48:24.023", "UserId": 78}
{"Id": 381, "PostId": 156, "Score": 0, "Text": "@Leon7C Thank you for answering, unfortunately **[comments are not designed to field answers](http://sexuality.stackexchange.com/questions/131/how-do-you-increase-penis-size#comment286_131)**. If you would like to continue answering these questions, please start posting your answers below. Thanks.", "CreationDate": "2015-07-30T16:13:31.313", "UserId": 90}
{"Id": 383, "PostId": 156, "Score": 0, "Text": "@RobertCartaino my apologies, I meant to comment on Sciencertobe's answer as a supplement since I believe his addresses the question nicely. Would such a supplement work best as a comment to his answer or fleshed out into a separate answer?", "CreationDate": "2015-07-30T16:30:53.510", "UserId": 78}
{"Id": 385, "PostId": 156, "Score": 0, "Text": "@Leon7C No problem. Generally speaking, comments are designed to ask for clarification to offer suggestions to help improve the post. I'll let you decide if the information in your comment could potentially be integrated into the post to improve it, or if it's a complete thought that could stand as an answer on its own.", "CreationDate": "2015-07-30T16:35:43.797", "UserId": 90}
{"Id": 359, "PostId": 162, "Score": 0, "Text": "Maybe you need some test results (benchmark) for different condom brands?", "CreationDate": "2015-07-30T10:33:21.397", "UserId": 180}
{"Id": 439, "PostId": 186, "Score": 1, "Text": "Refined question.", "CreationDate": "2015-07-31T20:10:42.883", "UserId": 251}
{"Id": 448, "PostId": 186, "Score": 0, "Text": "I suspect that this depends on local culture.", "CreationDate": "2015-07-31T23:39:24.050", "UserId": 72}
{"Id": 455, "PostId": 197, "Score": 1, "Text": "Please describe what you were smoking. Tobacco? Cannabis? Other? Cigarettes? Cigars? Hookah? Pipe?", "CreationDate": "2015-08-01T15:53:24.680", "UserId": 122}
{"Id": 457, "PostId": 197, "Score": 0, "Text": "@Eris - Tobacco/Cigarettes would be my guess, it's the default when talking about 'smoking'", "CreationDate": "2015-08-01T16:45:08.120", "UserId": 124}
{"Id": 460, "PostId": 197, "Score": 0, "Text": "@Robotnik that all depends on your environment. For me, cannabis is the default.", "CreationDate": "2015-08-01T18:00:29.923", "UserId": 122}
{"Id": 462, "PostId": 197, "Score": 1, "Text": "I meant tobacco", "CreationDate": "2015-08-01T18:54:59.353", "UserId": 242}
{"Id": 456, "PostId": 199, "Score": 2, "Text": "Giving or receiving?", "CreationDate": "2015-08-01T16:43:25.240", "UserId": 124}
{"Id": 459, "PostId": 199, "Score": 1, "Text": "Is eating apples more pleasurable for men or for women? How would you suppose a comparative study be done?", "CreationDate": "2015-08-01T17:31:00.817", "UserId": 82}
{"Id": 467, "PostId": 199, "Score": 0, "Text": "Likely a study is unnecessary given that an approximation is possible based on anatomical differences -- see my answer below.", "CreationDate": "2015-08-01T20:48:03.507", "UserId": 79}
{"Id": 713, "PostId": 209, "Score": 0, "Text": "Revised question.", "CreationDate": "2015-08-06T10:44:19.203", "UserId": 251}
{"Id": 497, "PostId": 218, "Score": 1, "Text": "I watched a documentary that mentioned this issue. It was \"Hot Girls Wanted\". The porn actors were told they couldn't use any barriers, and the only thing they had was regular checkups. One girl developed a cyst for producing too much natural lubricants in a day. So, she had to pay the medical bill out of pocket. Apparently, the porn industry doesn't care about the health of its workers.", "CreationDate": "2015-08-02T15:36:09.570", "UserId": 251}
{"Id": 498, "PostId": 218, "Score": 1, "Text": "@DoubleU that is quite sad, hope it is not true, or at least not for all producers. :/", "CreationDate": "2015-08-02T16:13:20.770", "UserId": 61}
{"Id": 499, "PostId": 218, "Score": 1, "Text": "The 2015 documentary focused mainly on the \"amateur\" porn industry. I put it in quotes, because the \"amateur\" porn industry is really a multi-million-dollar industry. The people who run it manage it like a business without regulations. The stars are usually young women who want to make fast cash, and the turnover rate is very high. A promising actress typically in her early 20s can last at most a few years but retiring without any benefits.", "CreationDate": "2015-08-02T16:23:36.010", "UserId": 251}
{"Id": 500, "PostId": 218, "Score": 1, "Text": "In short, the amateur porn industry is like overt patriarchy in a post-modern world. The producers and consumers are male; women are merely commodities, bought and sold through the Internet and merchandise. They may receive some money for their service, but they typically don't have a permanent job. Plus, as time goes by, consumers demand more violent porn, which degrades women into sex objects. One actress in the documentary has to say her line, \"I'm a fucking whore,\" while licking vomit off the floor.", "CreationDate": "2015-08-02T16:33:22.813", "UserId": 251}
{"Id": 501, "PostId": 218, "Score": 0, "Text": "@DoubleU well, while I agree it is not fair and disgusting behavior towards the women in general, nobody forced them to get into this to begin with. Anyway this is off topic here, feel free to hit me on chat to continue.", "CreationDate": "2015-08-02T16:40:00.220", "UserId": 61}
{"Id": 512, "PostId": 218, "Score": 0, "Text": "I'm working to research an answer for this (I have some indirect connections with the porn industry that are being tapped, as well as just general resources on anal sex risks), and just wanting to clarify: Are you asking about how they protect themselves from non-STI type infections? Like just related to fecal material? Or just STIs? Or both?", "CreationDate": "2015-08-03T05:46:06.507", "UserId": 108}
{"Id": 502, "PostId": 219, "Score": 0, "Text": "Interesting! but never heard of this technique. I suggest you add some pointers/references to your question so that it can be better understood.", "CreationDate": "2015-08-02T16:45:25.767", "UserId": 211}
{"Id": 507, "PostId": 219, "Score": 0, "Text": "@Kaamdeva - I honestly don't know anything about it, my partner and I were browsing an adult store online catalog and saw them (the pumps). Short of linking the store, I wouldn't know what to reference.", "CreationDate": "2015-08-02T23:44:20.260", "UserId": 124}
{"Id": 811, "PostId": 219, "Score": 0, "Text": "@Robotnik: Linking to the store is probably a good idea. Consider a 'NSFW' warning if it contains questionable images.", "CreationDate": "2015-08-08T23:38:13.237", "UserId": 64}
{"Id": 885, "PostId": 219, "Score": 0, "Text": "@Flimzy - I've added the source in question.", "CreationDate": "2015-08-10T14:32:00.697", "UserId": 124}
{"Id": 531, "PostId": 235, "Score": 0, "Text": "No idea about angle, but very often when I open my son's diaper to change it, he gets an erection. I assume it's due to the change in pressure/temperature around his crotch or something like that, but still - this happens a lot and can't be denied. As I don't remember being changed myself I can't tell if I also had same behavior as a baby/toddler and too embarrassed to ask my mother.", "CreationDate": "2015-08-03T14:14:05.653", "UserId": 61}
{"Id": 526, "PostId": 236, "Score": 1, "Text": "We already have billions of people on the planet. Having more homosexuals may be a good thing, because they don't reproduce offspring, if marriage is strictly for love. Alas, that is not the case, given that homosexuals may beget children outside of marriage or former marriage. As for the question, I find it very thought-provoking and offensive, but this seems like a honest question that can answered with evidence.", "CreationDate": "2015-08-03T11:15:09.993", "UserId": 251}
{"Id": 527, "PostId": 236, "Score": 0, "Text": "Please could you explain what \"LGBT\" is? From the context I can guess that is has to do with homosexuality, but I still can't figure out what exactly it is.", "CreationDate": "2015-08-03T11:19:48.853", "UserId": 115}
{"Id": 545, "PostId": 236, "Score": 0, "Text": "@HubertSchölnast-LGBT - Lesbian/Gay/Bisexual/Transgender.", "CreationDate": "2015-08-03T16:24:54.237", "UserId": 13}
{"Id": 604, "PostId": 236, "Score": 0, "Text": "@DoubleU, why do you find it offensive?", "CreationDate": "2015-08-04T03:06:21.537", "UserId": 314}
{"Id": 558, "PostId": 248, "Score": 0, "Text": "I've just provided an answer with a link to \"some basic information on this\"... If you'd like me to dig up more specific statistics and such, please expand your question and make a comment, and I'll do my best to expand my answer in kind, with more detailed sources.", "CreationDate": "2015-08-03T17:38:13.717", "UserId": 108}
{"Id": 601, "PostId": 253, "Score": 0, "Text": "It certainly seems like a pretty broad problem. For all the hereditary reasons for intersex symptoms you could say a catch-all answer is that any doctor can let the whole genome be sequenced (for about 5000$ a pop)... But if the reason is that a female bodybuilder took some strange hormones.... then that will not quite work out for them. In other words, although a specific topic, I feel like this question may be too broad for a good answer. Why not see the family doctor? Why is a specialist needed?", "CreationDate": "2015-08-04T02:12:18.233", "UserId": 82}
{"Id": 619, "PostId": 253, "Score": 0, "Text": "I don't know if a specialist is needed. That's explicitly part of the question. As for it being too broad, that's an interesting point, which I'll ponder. That said, the point of the question is for someone who may not know what to get tested for to have some hints at starting points of things to ask for, not necessarily a definitive answer for what's best for them. I think it's fine if this question goes unanswered for a while. Hopefully at some point it will be seen by someone with appropriate knowledge, and it'll go from there.", "CreationDate": "2015-08-04T13:09:35.027", "UserId": 108}
{"Id": 616, "PostId": 264, "Score": 2, "Text": "I've never heard the phrase \"sex utensils\" before, and when I read it, absurd images of people having sex with forks and spoons came to mind.  Thanks for making me laugh.", "CreationDate": "2015-08-04T08:03:58.370", "UserId": 98}
{"Id": 617, "PostId": 264, "Score": 1, "Text": "@Bat same here, but I must agree, as a fork can't really be defined as \"sex toy\". LOL", "CreationDate": "2015-08-04T10:33:25.870", "UserId": 61}
{"Id": 630, "PostId": 264, "Score": 0, "Text": "You'd be surprised. Anything can be used in a sexual context. I'd seen the term 'utensil' used by the Lorax of Sex.", "CreationDate": "2015-08-04T15:48:49.437", "UserId": 122}
{"Id": 638, "PostId": 264, "Score": 0, "Text": "@ShadowWizard - It could, but I wouldn't recommend it.", "CreationDate": "2015-08-04T19:56:22.943", "UserId": 98}
{"Id": 639, "PostId": 264, "Score": 0, "Text": "Why not a fork? One can get some very interesting sensations by sliding a fork across an erogenous zone, or for masochistic tendencies, there are more extreme demonstrations.", "CreationDate": "2015-08-04T20:01:04.087", "UserId": 122}
{"Id": 642, "PostId": 264, "Score": 0, "Text": "@Dire I meant can't be defined as sex toy, not can't be used - I do understand how it can be used and see how people might enjoy it.", "CreationDate": "2015-08-04T22:03:54.117", "UserId": 61}
{"Id": 658, "PostId": 288, "Score": 2, "Text": "Have you tried putting a condom on a flaccid penis? I would expect the answer to be pretty self-evident for anyone who's tried.", "CreationDate": "2015-08-05T17:05:39.040", "UserId": 64}
{"Id": 714, "PostId": 288, "Score": 0, "Text": "Revised question. Now, it's concerned with the possibility of putting on the condom in an atypical way.", "CreationDate": "2015-08-06T10:59:31.033", "UserId": 251}
{"Id": 664, "PostId": 292, "Score": 0, "Text": "You might have a look at this question: http://sexuality.stackexchange.com/questions/45/is-a-fetish-a-sign-of-dysfunction. The second paragraph of the first answer might already be the answer to your question.", "CreationDate": "2015-08-05T18:25:01.580", "UserId": 33}
{"Id": 665, "PostId": 292, "Score": 0, "Text": "@BrainStone: Yup... that's my other question, from which this one was split off :)", "CreationDate": "2015-08-05T18:25:51.363", "UserId": 64}
{"Id": 674, "PostId": 292, "Score": 0, "Text": "I think it's too broad. Each fetish and its own possible cause. Can't say for sure though, so not voting to close.", "CreationDate": "2015-08-05T21:10:21.630", "UserId": 61}
{"Id": 675, "PostId": 292, "Score": 1, "Text": "@ShadowWizard: As stated, I'm looking for a general answer, not a list of every possible fetish and it's causes. And in fact, an answer along the lines of \"Some are caused by childhood trauma, some are learned over time through experimentation, and some are unexplained\" would probably be sufficient (if it had references).", "CreationDate": "2015-08-05T21:34:37.070", "UserId": 64}
{"Id": 676, "PostId": 292, "Score": 0, "Text": "Well, still sounds off to me, like asking \"What causes a human being to become sick?\" followed by \"virus, bacteria, infection etc\" answer. (of course not doing any comparison! fetish is not illness)", "CreationDate": "2015-08-05T21:36:25.623", "UserId": 61}
{"Id": 677, "PostId": 292, "Score": 1, "Text": "@ShadowWizard: I've actually seen questions very much like \"what causes humans to become sick?\" on other SE sites, and they've received answers. :)  Of course, a more specific question (\"what causes cancer?\") allows for a more specific question. But generally, overview questions (if not \"too broad\"--and I realize that's subjective) are allowed.", "CreationDate": "2015-08-05T21:39:54.337", "UserId": 64}
{"Id": 671, "PostId": 293, "Score": 0, "Text": "Since this is concerned with technical terminology, I think this question is on-topic here. So, you're good.", "CreationDate": "2015-08-05T19:53:51.380", "UserId": 251}
{"Id": 673, "PostId": 293, "Score": 0, "Text": "I have heard of \"girl\" and \"boy\" as terms of endearment in BDSM culture. Not sure how they are used, though.", "CreationDate": "2015-08-05T19:57:15.370", "UserId": 251}
{"Id": 696, "PostId": 298, "Score": 2, "Text": "I'm not prepared to write up an answer, but a couple things I found that could possibly be relevant to one - though I read the former as mostly a joke(?): http://geekysexblog.com/blog/2011/04/22/fasolt-intensity-scale/ and the latter as not really involving the kind of scale you mean: http://www.ncbi.nlm.nih.gov/m/pubmed/4062540/", "CreationDate": "2015-08-06T04:59:01.237", "UserId": 108}
{"Id": 678, "PostId": 299, "Score": 0, "Text": "\"an elevated risk\", of course. It can only be elevated. As you said, it cannot be detrimental.", "CreationDate": "2015-08-05T23:12:10.617", "UserId": 82}
{"Id": 727, "PostId": 299, "Score": 1, "Text": "`I know it would not be detrimental to safety to put on a fresh condom` -- it might, if your reason for using the condom is fluid isolation, and you don't thoroughly wash between condoms.", "CreationDate": "2015-08-06T18:59:20.577", "UserId": 64}
{"Id": 684, "PostId": 302, "Score": 0, "Text": "If you mean specifically the circumcision of babies, you should specify this. Some other circumcisions are done for medical necessity.", "CreationDate": "2015-08-06T02:07:56.093", "UserId": 72}
{"Id": 685, "PostId": 302, "Score": 0, "Text": "primarily babies, but any that are not for medical necessity.", "CreationDate": "2015-08-06T02:09:31.770", "UserId": 17}
{"Id": 686, "PostId": 302, "Score": 0, "Text": "Also, the [intercourse] tag isn't really appropriate here, though it may come up in an answer.", "CreationDate": "2015-08-06T02:09:36.633", "UserId": 72}
{"Id": 687, "PostId": 302, "Score": 0, "Text": "@Saposhiente I was trying to come up with 2-3 tags for this and failing...", "CreationDate": "2015-08-06T02:10:12.067", "UserId": 17}
{"Id": 774, "PostId": 302, "Score": 0, "Text": "Really?  2 downvotes and closing because it's to broad?", "CreationDate": "2015-08-07T17:06:31.627", "UserId": 17}
{"Id": 787, "PostId": 302, "Score": 0, "Text": "@bowlturner yes, I think so. I think it is broad in scope, but I think it is still manageable and answerable. One just needs a lot of space to write a comprehensive answer, as I have done.", "CreationDate": "2015-08-08T02:28:39.287", "UserId": 251}
{"Id": 691, "PostId": 305, "Score": 2, "Text": "I think this question may be based on a false premise, namely that all these partners were ongoing and continuous. From the sounds of it, it's more like having had sex once each with most of them, over the course of their time as emperor. I don't really know, and I wonder if there's even good data on this... I'm tempted to vote to close as opinion based, but perhaps there's something I'm missing?", "CreationDate": "2015-08-06T04:38:36.693", "UserId": 108}
{"Id": 692, "PostId": 305, "Score": 0, "Text": "@lindes, do you have anything to prove your assertion?", "CreationDate": "2015-08-06T04:40:39.990", "UserId": 130}
{"Id": 693, "PostId": 305, "Score": 1, "Text": "Also in that article is reference to \"The assistant concubines, eighty-one in number, share the imperial couch nine nights in groups of nine.\" Further, this does not suggest sex will all 9 concubines at a given time. I suspect the emperor has his selection of wife/concubines when he wanted them, and had sex as he pleased. After a few years of this, it wouldn't be too hard to have \"dozens and dozens\" of children.", "CreationDate": "2015-08-06T04:42:54.540", "UserId": 339}
{"Id": 695, "PostId": 305, "Score": 0, "Text": "Prove? No. Do you? My \"assertion\" is that my reading of the article linked in the question lead me to believe that that's what the article was saying. Do you have *evidence* (let alone proof) that my reading of it is incorrect?", "CreationDate": "2015-08-06T04:50:52.787", "UserId": 108}
{"Id": 697, "PostId": 305, "Score": 0, "Text": "@adama44, it's still requires quite a lot of energy to attend to 9 concubines at one night, at every night. Of course this doesn't mean that emperors were constantly having sex, but still...", "CreationDate": "2015-08-06T05:30:03.840", "UserId": 130}
{"Id": 698, "PostId": 305, "Score": 0, "Text": "@lindes, no, I don't have proof also, but would you like to point out, in the answer section below, which part of the text that leads to your initial comment?", "CreationDate": "2015-08-06T05:30:50.727", "UserId": 130}
{"Id": 704, "PostId": 305, "Score": 0, "Text": "My initial comment wasn't inspired by the answer; the one answer that I see now didn't exist yet. My initial comment was based on the text in your link, which was very short on details. Your question presumes a hyperactive sex drive, but I see no reason to require that the sex drive be anything other than normal, even average, just executed differently than modern norms would expect.", "CreationDate": "2015-08-06T07:23:42.107", "UserId": 108}
{"Id": 705, "PostId": 305, "Score": 0, "Text": "Side-note: speaking of modern norms, I suppose it's worth noting that the reason I'm reacting as strongly as I am to this probably has less to do with its speculatory nature (though that's there, and an issue, in my mind), and more to do with my interpretation of it as glorifying sexist polygyny, which my feminist self abhors. It's possible to talk about this in an academic way about history, or we could remove it from emperors and have a question about increasing one's stamina, but this question just rubs me the wrong way. And I still think it's likely to garner speculation. Voting to close.", "CreationDate": "2015-08-06T07:27:46.867", "UserId": 108}
{"Id": 707, "PostId": 305, "Score": 0, "Text": "Downvoting, too, on the sexism grounds. There are other ways to ask this if the question is really about finding energy.", "CreationDate": "2015-08-06T07:31:22.953", "UserId": 108}
{"Id": 708, "PostId": 305, "Score": 0, "Text": "@lindes, this is a Q&A site that strives to be as objective as possible, you shouldn't really upvote/downvote or comment or answer based on your subjective feelings that may or may not be shared by others. As sexuality is still a taboo, probably every single question on this site can be subjectively interpreted by someone to indicate prejudice or mischievous/chauvinistic intention on the asker's part. Should we then close this site to take care of your and other people's feeling?", "CreationDate": "2015-08-06T07:40:35.023", "UserId": 130}
{"Id": 709, "PostId": 305, "Score": 0, "Text": "Let us [continue this discussion in chat](http://chat.stackexchange.com/rooms/26644/discussion-between-lindes-and-graviton).", "CreationDate": "2015-08-06T07:49:00.680", "UserId": 108}
{"Id": 712, "PostId": 305, "Score": 1, "Text": "Chinese history (and the written histories of many other  cultures) are full of massive exaggeration. As my Chinese history professor said it's best to divide any numbers by 10.", "CreationDate": "2015-08-06T09:06:40.257", "UserId": 171}
{"Id": 724, "PostId": 305, "Score": 0, "Text": "The two problems I see with this question are: 1) It assumes, AFAICT without any evidence whatsoever,  that these emperors were sexually active with hundreds or thousands of women simultaneously. 2) It assumes, again without any apparent evidence, that all of these emperors behaved in exactly the same way in regards to maintaining sexual energy.", "CreationDate": "2015-08-06T18:40:09.120", "UserId": 64}
{"Id": 918, "PostId": 305, "Score": 0, "Text": "What the hell is \"sexual energy\"?  The libido?  Regular stamina?  Caloric output?", "CreationDate": "2015-08-11T06:02:35.207", "UserId": 98}
{"Id": 919, "PostId": 305, "Score": 0, "Text": "@BatFrett, all of them!", "CreationDate": "2015-08-11T06:09:19.163", "UserId": 130}
{"Id": 723, "PostId": 315, "Score": 0, "Text": "It is widely believed that Sodom and Gomorrah, mentioned in Genesis 18 & 19 of the Hebrew bible, committed the \"sin\" of anal sex (thus the modern term \"sodomy\" to refer to such acts). Whether they really did this is subject to interpretation of the text, as it's not explicitly stated.", "CreationDate": "2015-08-06T18:37:26.633", "UserId": 64}
{"Id": 728, "PostId": 315, "Score": 0, "Text": "There are depictions of anal sex in Greek art. Does that count as a record?", "CreationDate": "2015-08-06T19:06:03.170", "UserId": 251}
{"Id": 729, "PostId": 315, "Score": 0, "Text": "It appears that certain animals engage in anal sex as well, lending weight to your theory that \"anal sex exists for almost as long as ordinary sex\"--at least among humans.", "CreationDate": "2015-08-06T19:21:52.160", "UserId": 64}
{"Id": 730, "PostId": 315, "Score": 0, "Text": "@Flimzy animals are off topic here, this site is about human sexuality. As for Sodom and Gomorrah you're right, but I expect older records to exist as well.", "CreationDate": "2015-08-06T20:47:57.123", "UserId": 61}
{"Id": 731, "PostId": 315, "Score": 0, "Text": "@DoubleU yes, back then they didn't have camera so drawings are the next best thing...", "CreationDate": "2015-08-06T20:48:32.330", "UserId": 61}
{"Id": 732, "PostId": 315, "Score": 0, "Text": "I realize that animals are off-topic. But my point is that if animals engage in anal sex, then the earliest humans probably did, too, so your guess about anal sex being as old or nearly as old as \"regular sex\" is probably spot-on.", "CreationDate": "2015-08-06T21:31:52.723", "UserId": 64}
{"Id": 733, "PostId": 315, "Score": 0, "Text": "@Flimzy I see, but fear it can't be used as \"evidence\" i.e. not proper for an answer. Personally I wonder how the first anal sex ever happened, e.g. was it by mistake? On purpose? But pretty sure nobody can really tell these days.", "CreationDate": "2015-08-06T21:37:30.653", "UserId": 61}
{"Id": 734, "PostId": 315, "Score": 0, "Text": "It doesn't address the question of the first recorded anal sex, no. It may be relevant to the question of how long humans have practiced anal sex, if that's the real question you're trying to answer (whether it is or not, I'm not trying to guess).", "CreationDate": "2015-08-06T21:39:09.503", "UserId": 64}
{"Id": 769, "PostId": 322, "Score": 0, "Text": "@Flimzy I'm not sure, I thought it's the same thing. I mean the type of thing usually comes with age.", "CreationDate": "2015-08-07T14:24:24.577", "UserId": 345}
{"Id": 773, "PostId": 322, "Score": 0, "Text": "@Flimzy, posted [this one](http://sexuality.stackexchange.com/questions/324/whats-the-difference-between-impotence-and-erectile-dysfunction) just in case...", "CreationDate": "2015-08-07T15:31:26.807", "UserId": 345}
{"Id": 776, "PostId": 326, "Score": 0, "Text": "Welcome to the Sexuality.SE! Your question seems to be on-topic, relevant, and useful. As we are a community of experts and learners, we strive to not only answer other people's questions, but also our own. So, feel free to provide an answer to this question by yourself!", "CreationDate": "2015-08-07T18:54:58.793", "UserId": 251}
{"Id": 778, "PostId": 327, "Score": 1, "Text": "You're on a roll! Keep asking good questions!", "CreationDate": "2015-08-07T20:56:13.093", "UserId": 251}
{"Id": 780, "PostId": 327, "Score": 0, "Text": "@DoubleU Thanks! :D", "CreationDate": "2015-08-07T21:02:09.547", "UserId": 62}
{"Id": 779, "PostId": 328, "Score": 1, "Text": "Nice questions! I like your inputs thus far!", "CreationDate": "2015-08-07T20:57:45.227", "UserId": 251}
{"Id": 788, "PostId": 333, "Score": 0, "Text": "You'll get more useful answers if you change \"male hormonal contraceptives \" to \"long-acting reversible contraceptives for men.\"  Because if we see any LARCs for men before 2050, the odds are high that they *won't* be hormonal.  The research so far indicates that any hormones that could completely shut down sperm production would create serious risks of impotence or infertility. The legal risk alone would be a nightmare. By comparison, other LARC technologies look like they will be much safer, more effective, and more convenient.", "CreationDate": "2015-08-08T04:46:51.613", "UserId": 228}
{"Id": 786, "PostId": 336, "Score": 0, "Text": "Many cultures in Africa practice female circumcision, aka female genital mutilation. You can find more information on Wikipedia that discusses the prevalence and the cultures that practice it.", "CreationDate": "2015-08-07T23:27:15.697", "UserId": 251}
{"Id": 789, "PostId": 336, "Score": 1, "Text": "The terrible ones.", "CreationDate": "2015-08-08T06:20:59.647", "UserId": 98}
{"Id": 790, "PostId": 336, "Score": 0, "Text": "No argument here.", "CreationDate": "2015-08-08T11:52:44.630", "UserId": 17}
{"Id": 794, "PostId": 345, "Score": 0, "Text": "Good question. Considering that some cultures consider oral sex, manual sex, and anal sex sodomy, one may wonder what other kinds of sexual stimulation is there that would not be classified as sodomy and that would sexually arouse the woman so that she is properly lubricated.", "CreationDate": "2015-08-08T16:33:03.640", "UserId": 251}
{"Id": 795, "PostId": 345, "Score": 0, "Text": "I recently learned from one of the questions here that one danger is that the condom may tear in this situation -- but this is probably not the kind of unsafe you were aiming at.", "CreationDate": "2015-08-08T16:52:55.413", "UserId": 82}
{"Id": 797, "PostId": 345, "Score": 0, "Text": "@Spork: That's probably worth mentioning in an answer, but it's probably not a complete answer (unless that is indeed the only risk).", "CreationDate": "2015-08-08T17:40:36.917", "UserId": 64}
{"Id": 817, "PostId": 345, "Score": 0, "Text": "@double U - That leaves \"outercourse,\" rubbing the penis along the vulva and using it to arouse the clitoris. Some Arab sex manuals apparently go into considerable detail on technique. In \"cowgirl\" position, the woman can rub herself on the horizontal penis until she's ready for insertion.", "CreationDate": "2015-08-09T05:36:16.820", "UserId": 228}
{"Id": 813, "PostId": 350, "Score": 0, "Text": "Are you looking for the first record of the illegalization of prostitution?", "CreationDate": "2015-08-09T03:26:55.990", "UserId": 251}
{"Id": 814, "PostId": 350, "Score": 0, "Text": "@DoubleU: Yes. Is that unclear in my question?", "CreationDate": "2015-08-09T03:27:57.893", "UserId": 64}
{"Id": 815, "PostId": 350, "Score": 0, "Text": "Yes, because you did not specify *record*.", "CreationDate": "2015-08-09T03:28:36.503", "UserId": 251}
{"Id": 816, "PostId": 350, "Score": 0, "Text": "@DoubleU: If we know about it, there's a record, is there not?  I'm not sure what distinction you're trying to make.", "CreationDate": "2015-08-09T03:29:25.627", "UserId": 64}
{"Id": 819, "PostId": 350, "Score": 0, "Text": "I am shocked, that prostitution is illegal in most states of USA and in Canada. I didn't know this. Why is is illegal there? (On what grounds has the legislature enacted this law?) I understand, that it is illegal in islamic countries and countries with totalitarian regimes like russia or china. But USA, the land of opportunity? (I am living in Austria, a “green” european country in this map and I very often have to shake my head in astonished unbelief when I hear about the - in my eyes - weird relationship between USA and sexuality)", "CreationDate": "2015-08-09T10:01:52.393", "UserId": 115}
{"Id": 820, "PostId": 350, "Score": 0, "Text": "@HubertSchölnast Prostitution is legal in Nevada, even though people still use illegal services there for some reason.", "CreationDate": "2015-08-09T10:51:06.267", "UserId": 251}
{"Id": 821, "PostId": 354, "Score": 0, "Text": "This difference was commented by Oscar Wilde. Wilde lived in the 19th century. So, you can tell that this difference between Europe and America is quite old.", "CreationDate": "2015-08-09T13:14:59.030", "UserId": 251}
{"Id": 822, "PostId": 354, "Score": 0, "Text": "Funny, but Wilde would have said the reverse of what you said in regards to the European astonishment of American sexuality.", "CreationDate": "2015-08-09T13:41:39.567", "UserId": 251}
{"Id": 823, "PostId": 354, "Score": 0, "Text": "What makes you think religion is divorced from politics in the USA? I am willing to bet that there are many American voters who vote based on their religious convictions on both sides of the political spectrum.", "CreationDate": "2015-08-09T13:50:30.653", "UserId": 251}
{"Id": 824, "PostId": 354, "Score": 0, "Text": "@DoubleU: Well, there are so many differences between USA and Europe. Even the idea of having **only two** sides of a political spectrum sounds weird in my European ears. In my country (Austria) there are six political parties that have been voted into the parliament. As far as I know there is only one party that refers to religious values in their political program (named “Christliche Partei Österreichs” which is “Christian Party of Austria” in englisch), but this party was not voted into the parliament. In Europe nobody wants religion in politics.", "CreationDate": "2015-08-09T15:01:24.363", "UserId": 115}
{"Id": 825, "PostId": 354, "Score": 0, "Text": "To be fair, there are actually more than 2 parties in the US, but only 2 parties hold seats in the government at the city, state, and national level. There is no religious party, like Austria, but religion has always been important in American society. So, many religious believers, liberals and conservatives alike, vote Democrat or Republican or a third party. Some people do not vote altogether.", "CreationDate": "2015-08-09T15:32:30.517", "UserId": 251}
{"Id": 827, "PostId": 354, "Score": 1, "Text": "Don't forget about broadcast TV standards, and other forms of advertising. In much of Europe it's common to see nudity (at least topless women) on TV. In the US, that's makes for [a big controversy](https://en.wikipedia.org/wiki/Super_Bowl_XXXVIII_halftime_show_controversy).", "CreationDate": "2015-08-09T16:05:47.267", "UserId": 64}
{"Id": 828, "PostId": 354, "Score": 2, "Text": "`We Europeans would expect laws that prohibit prostitution in countries where religion is strongly connected with politics` -- Religion is inseparably connected with politics in the US. Far too much (and I say this as a religious person). It's not uncommon to be called (or at the very least strongly implied) a heretic *by friends with whom I go to church*, because I don't agree with their preferred presidential candidate or political party. (And anyone familiar with US politics knows this means I'm more \"liberal\"/Democrat than these friends would think is correct.)", "CreationDate": "2015-08-09T16:08:42.693", "UserId": 64}
{"Id": 829, "PostId": 354, "Score": 0, "Text": "I'm going ahead with a VTC despite the effort that obviously went into your question, and despite it being a common sentiment. There are just too many extremely broad statements here... North America -> includes Mexico? Does it include Native Americans, who in fact never sexualized the breast? Europeans -> does that include Queen Victoria herself? .... Also, the answer to the question from the title is too simple: cultural differences. Wouldn't you rather know how these cultural differences were caused? It would be fascinating to see a more limited question - that could get a great answer.", "CreationDate": "2015-08-09T16:49:55.900", "UserId": 82}
{"Id": 830, "PostId": 354, "Score": 0, "Text": "The History of Sexuality by Foucault may interest you, it describes power being the main reason for repressiveness... but it's really just a slice of your question that is handled.", "CreationDate": "2015-08-09T16:53:06.430", "UserId": 82}
{"Id": 831, "PostId": 354, "Score": 0, "Text": "@Spork: As mentioned in the first sentence, I was speaking about USA and Canada. About Native Americans: Their role might be an interesting point in an answer. I was not talking about historic queens (like Queen Victoria, or Catherine the Great, to name an other extreme). But yes, they are included in the term “Europeans”, but they are a very small minority. How would you limit the question?", "CreationDate": "2015-08-09T17:20:53.130", "UserId": 115}
{"Id": 832, "PostId": 354, "Score": 0, "Text": "@Flimzy: You are right, I forgot TV. In Europe it is no problem to see uncensored naked female breasts with erected nipples or uncovered butts  on sunday afternoon.", "CreationDate": "2015-08-09T17:29:38.697", "UserId": 115}
{"Id": 834, "PostId": 354, "Score": 1, "Text": "@Spork: I think it's a broad question, but it's also looking for a broad/overview type of answer, not a detailed thesis.  If someone wants more detail, they need to ask a more specific question (\"What's the history of censoring breasts on American TV?\" for example)", "CreationDate": "2015-08-09T17:34:30.697", "UserId": 64}
{"Id": 838, "PostId": 354, "Score": 0, "Text": "@Spork: Flimzy is right. I'm not asking for detailed aspects. I wonder how a society, that mainly has developed from a big group of european emigrants (after Columbus discovered the new continent) and that always was in friendly contact with Europe, could develop so different.", "CreationDate": "2015-08-09T17:48:34.313", "UserId": 115}
{"Id": 850, "PostId": 354, "Score": 1, "Text": "But Europe in your Definition developed differently from Europe (UK vs Austria) and North America developed differently from North America (US sans Native Americans vs Canadians)... In my view, this has little to do with sexuality, and more a question to do on a veeeery high level with cultural differences. 'How do cultural differences come about?' ... Too broad.", "CreationDate": "2015-08-09T18:31:15.823", "UserId": 82}
{"Id": 852, "PostId": 354, "Score": 0, "Text": "@Spork: Sexuality is rarely isolated from all other aspects of life.", "CreationDate": "2015-08-09T18:36:44.263", "UserId": 64}
{"Id": 856, "PostId": 354, "Score": 0, "Text": "@flimzy how to use a condom is separated from how global cultural differences come about. That quedtion would not be too broad. This question is too broad for a great answer on SE. If any answer without personal speculations and beliefs comes from this I'll eat my shoe. I'm already cringing at remarks to come about Victorian prudishness.", "CreationDate": "2015-08-09T19:36:01.983", "UserId": 82}
{"Id": 858, "PostId": 354, "Score": 0, "Text": "@Spork: Tell that to a Catholic.", "CreationDate": "2015-08-09T20:07:08.113", "UserId": 64}
{"Id": 846, "PostId": 358, "Score": 0, "Text": "Anyone care to explain their downvote? Can the question be improved? If it's truly a bad question, why? I can delete it.", "CreationDate": "2015-08-09T18:07:02.733", "UserId": 64}
{"Id": 853, "PostId": 358, "Score": 0, "Text": "Actually, a quick search in Ebscohost tells me otherwise. Even the academic literature confirms the existence of \"different types of orgasms.\"", "CreationDate": "2015-08-09T18:48:24.610", "UserId": 251}
{"Id": 883, "PostId": 358, "Score": 0, "Text": "@DoubleU: I wouldn't listen too much on academic literature. Listen to women. My wife told me, her orgasm from anal penetration is very different than from stimulating her clitoris.", "CreationDate": "2015-08-10T13:47:35.650", "UserId": 115}
{"Id": 884, "PostId": 358, "Score": 0, "Text": "@HubertSchölnast Academic literature in this case is about the systematic study of something based on empirical accounts of real women. So, we are not really contradicting each other. That does not disqualify subjective experiences or the possibility of freak accidents or miracles.", "CreationDate": "2015-08-10T14:04:14.593", "UserId": 251}
{"Id": 887, "PostId": 362, "Score": 0, "Text": "\"Fuck\" is an old Germanic term. Hence it is vulgar and mean. \"Copulate\" is a Latin derivative term. Hence it is erudite and formal. *Fornicating under the consent of the king* is most likely a backronym.", "CreationDate": "2015-08-10T16:08:16.330", "UserId": 251}
{"Id": 888, "PostId": 362, "Score": 0, "Text": "-1 for lack of research effort", "CreationDate": "2015-08-10T16:11:19.623", "UserId": 251}
{"Id": 889, "PostId": 362, "Score": 0, "Text": "You still get brownie points for being funny.", "CreationDate": "2015-08-10T16:18:59.640", "UserId": 251}
{"Id": 894, "PostId": 362, "Score": 0, "Text": "This question is better suited for English Language & Usage, although would likely be closed there as general reference as well. Try google, or [read this](http://www.etymonline.com/index.php?allowed_in_frame=0&search=fuck&searchmode=none).", "CreationDate": "2015-08-10T20:30:48.387", "UserId": 64}
{"Id": 897, "PostId": 362, "Score": 1, "Text": "Who of you guys who put this question on hold does really think, that *fuck* “does not appear to be about human sexuality”??? BTW: I know the answer, but now I can't post it :(", "CreationDate": "2015-08-10T21:23:13.870", "UserId": 115}
{"Id": 899, "PostId": 362, "Score": 1, "Text": "@HubertSchölnast This question is about the etymology of \"fuck\". Etymologies of any word should go under English Language & Usage SE.", "CreationDate": "2015-08-10T21:56:39.623", "UserId": 251}
{"Id": 902, "PostId": 362, "Score": 0, "Text": "@HubertSchölnast: The etymology of \"fuck\" is not about human sexuality any more than the etymology of \"republic\" is about politics.", "CreationDate": "2015-08-10T22:45:41.587", "UserId": 64}
{"Id": 903, "PostId": 362, "Score": 0, "Text": "For anyone unconvinced that this question is off-topic, try answering this question: \"What is the origin of the word เพศ?\"", "CreationDate": "2015-08-10T22:49:20.370", "UserId": 64}
{"Id": 907, "PostId": 362, "Score": 1, "Text": "@Flimzy et al - how is this any different to the one on the term 'missionary position'?", "CreationDate": "2015-08-10T23:20:09.050", "UserId": 124}
{"Id": 908, "PostId": 362, "Score": 0, "Text": "@Robotnik: I don't think it is. I've VtCed that one, too :)", "CreationDate": "2015-08-10T23:23:39.897", "UserId": 64}
{"Id": 909, "PostId": 362, "Score": 1, "Text": "Could we lock down some consensus on this? There's nothing on meta that makes these types of questions OT", "CreationDate": "2015-08-10T23:33:52.803", "UserId": 124}
{"Id": 930, "PostId": 362, "Score": 0, "Text": "@Robotnik: Well, in effect, [all questions are off-topic](http://meta.sexuality.stackexchange.com/q/120/64) here now. :)", "CreationDate": "2015-08-11T19:22:21.993", "UserId": 64}
{"Id": 931, "PostId": 362, "Score": 0, "Text": "@Flimzy - indeed, which is why I haven't bothered opening a meta to argue for history to remain on Topic :-/.", "CreationDate": "2015-08-12T11:20:10.617", "UserId": 124}
{"Id": 934, "PostId": 367, "Score": 3, "Text": "An answer to this question alone would be worth the price of admission.", "CreationDate": "2015-08-13T14:31:34.400", "UserId": 64}
{"Id": 951, "PostId": 367, "Score": 1, "Text": "OK, @Flimzy... there's something, anyway.  At the very least, this question got *an* answer while the site was still live.  Up to you to decide whether to award the bounty; I don't guess that I really care all that much... but hopefully you'll appreciate at least having seen an answer of some sort.", "CreationDate": "2015-08-14T16:12:17.263", "UserId": 108}
{"Id": 932, "PostId": 371, "Score": 0, "Text": "Good questions. But given that the SE will close on Friday, I am not sure whether I want to contribute and face the loss of all my answers.", "CreationDate": "2015-08-12T15:33:20.473", "UserId": 251}
{"Id": 939, "PostId": 374, "Score": 0, "Text": "One example would be the enlarged anus. The anus may enlarge and may fail at closing to retain feces. It takes some work and practice and maybe medical assistance to work those muscles into retaining feces well again.", "CreationDate": "2015-08-13T18:11:50.977", "UserId": 251}
{"Id": 935, "PostId": 375, "Score": 0, "Text": "Good question. However, you may want to be specific about the culture that DOES practice it, as different cultures may evolve different sexual norms and converge to apparently the same practice - mouth-to-mouth kissing. AFAIK, non-immigrant Americans do have a habit of kissing mouth-to-mouth.", "CreationDate": "2015-08-13T18:06:32.080", "UserId": 251}
{"Id": 936, "PostId": 375, "Score": 0, "Text": "@DoubleU: Many cultures do it. I'm not sure what specificity you're looking for. A definition?", "CreationDate": "2015-08-13T18:07:34.727", "UserId": 64}
{"Id": 937, "PostId": 375, "Score": 0, "Text": "\"a minority of cultures world-wide engage in what it calls 'romantic-sexual' mouth-to-mouth kissing\" - You say a \"minority of cultures\". That implies more than one. Given that it is more than one, it may suggest (1) one historical culture influences today's cultures that practice it, or (2) different cultures evolve the practice independently.", "CreationDate": "2015-08-13T18:09:48.437", "UserId": 251}
{"Id": 938, "PostId": 375, "Score": 0, "Text": "@DoubleU: So what is your point? How can I clarify my question?", "CreationDate": "2015-08-13T18:11:10.603", "UserId": 64}
{"Id": 940, "PostId": 375, "Score": 0, "Text": "Try limiting to a specific culture. \"Why do Americans kiss on the lips?\" Then, in the description, you state your focus on the evolution of this lip-kissing behavior.", "CreationDate": "2015-08-13T18:13:36.660", "UserId": 251}
{"Id": 941, "PostId": 375, "Score": 0, "Text": "I see. That might be an interesting question. It's not my question, though.  (not that it matters.. .tomorrow this whole thing goes away)", "CreationDate": "2015-08-13T18:14:37.577", "UserId": 64}
{"Id": 942, "PostId": 375, "Score": 0, "Text": "Do you have a library card/account? Public libraries may offer research services/databases to their patrons. So, if you want an answer, you can always look them up in the database. That's how I answer my questions. Since the whole website will go away soon, it may be too late to make a difference. All that work for nothing.", "CreationDate": "2015-08-13T18:27:56.680", "UserId": 251}
{"Id": 944, "PostId": 375, "Score": 0, "Text": "As a college grad, I am entitled to my alma mater's research databases. Does your university or alma mater do the same? Is Spanish your new native language?", "CreationDate": "2015-08-13T18:47:13.763", "UserId": 251}
{"Id": 946, "PostId": 375, "Score": 0, "Text": "Native language = language that you acquire proficiency in, not necessarily your first language, but for many people, their first is also their native language. Some people are bilingual at an early age, so there are 2 native languages or mother tongues.", "CreationDate": "2015-08-13T19:09:10.813", "UserId": 251}
{"Id": 949, "PostId": 375, "Score": 0, "Text": "Fair enough. Most fluent language then.", "CreationDate": "2015-08-13T19:26:40.913", "UserId": 251}
{"Id": 15, "PostId": 6, "Score": 0, "Text": "Good question, execellent answer!", "CreationDate": "2015-07-28T18:47:05.027", "UserId": 33}
{"Id": 18, "PostId": 6, "Score": 1, "Text": "Thanks, @BrainStone. To be fair, [a lot of this is recycled](http://gaming.stackexchange.com/a/186418).", "CreationDate": "2015-07-28T18:50:04.720", "UserId": 5}
{"Id": 62, "PostId": 6, "Score": 4, "Text": "Good answer, but in my experience, I would say it's closer to \"non-fetish\" rather than \"non-BDSM.\"", "CreationDate": "2015-07-28T19:51:41.393", "UserId": 91}
{"Id": 785, "PostId": 6, "Score": 0, "Text": "Colloquially, at least in the US, \"vanilla\" is sometimes used to refer to \"white people\" as opposed to \"chocolate\" for black people, in the context of an appetite for sexual/romantic partners of the other race. E.g. \"She (white) likes chocolate\" or \"He (black) likes vanilla.\"", "CreationDate": "2015-08-07T23:21:58.080", "UserId": 64}
{"Id": 16, "PostId": 13, "Score": 0, "Text": "*The only person that will realy notice a difference is your partner.*--- What does that mean? If I remove those genital hairs, will my partner notice the difference? BTW, I'm still a virgin and I absolutely have no ideas about [that]/partner's feeling...", "CreationDate": "2015-07-28T18:47:32.130", "UserId": 13}
{"Id": 19, "PostId": 13, "Score": 0, "Text": "This is especially the case when having oral-sex. When I eat out my girlfriend I for example don't like her having gential her because it bothers me. That was what I was talking about. Of course this is different for every person.", "CreationDate": "2015-07-28T18:52:59.450", "UserId": 33}
{"Id": 20, "PostId": 19, "Score": 0, "Text": "Thanks for the answer, but, does `laser removal` kill any chance of hair growth? I had never heard about this method before?", "CreationDate": "2015-07-28T18:54:01.497", "UserId": 13}
{"Id": 31, "PostId": 19, "Score": 2, "Text": "Laser removal permanently removes the ability for hair to grow by killing the follicles themselves. For more information, check out [this page](http://www.webmd.com/beauty/hair-removal/laser-hair-removal).", "CreationDate": "2015-07-28T19:06:24.713", "UserId": 23}
{"Id": 194, "PostId": 19, "Score": 2, "Text": "First of all, laser removal does not **entirely** prevents hair to grow back. It must be executed a lot of times and it costs pretty much (there are also studies that point out some dangers). About wax vs. razor I could't find any study or source comparing one method with the other. \"As is\" I don't think this answer can be a valid help.", "CreationDate": "2015-07-29T05:26:05.433", "UserId": 146}
{"Id": 52, "PostId": 23, "Score": 0, "Text": "Greatly reduce from from 0.05%? To what percentage? The term 'greatly' is strange, dealing with reducing under 0.0005. There's still risk of pregnancy with condoms, so what are the numbers?", "CreationDate": "2015-07-28T19:38:26.023", "UserId": 82}
{"Id": 56, "PostId": 23, "Score": 1, "Text": "With a 0.05% chance every 2 000th intercourse on average causes a pregnacy. If we assume that the chance of a pregnancy with a condom is also 0.05% (in reality it's lower. But i don't have the numbers) the chance of a pregnancy is 0.000025%. With that chance every 4 000 000th intercourse causes a pregnancy average. Meaning it is 2 000 times less likely.", "CreationDate": "2015-07-28T19:44:28.380", "UserId": 33}
{"Id": 228, "PostId": 23, "Score": 0, "Text": "@Spork - It's all about layering security. To use an analogy: My apartment has an internal staircase with a security door out the front, and a deadlock on my regular door inside. The security door is always locked and swings shut when left open - yet I still deadlock my front door. Why? In case the security door fails, or a neighbour props it open for some reason, or someone pretends to be someone in the block who forgot their keys and gets buzzed in. Same thing when utilising the pill and condoms.", "CreationDate": "2015-07-29T12:33:47.107", "UserId": 124}
{"Id": 229, "PostId": 23, "Score": 0, "Text": "@Robotnik Yes, but adding a 10th padlock does not 'greatly' increase security at all. The term 'greatly' is out of place, and provides no insight into probabilities.", "CreationDate": "2015-07-29T12:37:33.367", "UserId": 82}
{"Id": 231, "PostId": 23, "Score": 0, "Text": "@Spork - I never said anything about 10 padlocks don't blow it out of proportion lol, I gave an example of 2 separate locks which is a *reliable* failsafe. Given a 2% chance of impregnating someone (condoms), and then taking 2-5% of that (pill) is a fairly good return on investment IMO. No diminishing returns here.", "CreationDate": "2015-07-29T12:43:36.460", "UserId": 124}
{"Id": 232, "PostId": 23, "Score": 0, "Text": "To put it another way: I'd prefer having my TV stolen to having a baby :P", "CreationDate": "2015-07-29T12:44:59.733", "UserId": 124}
{"Id": 39, "PostId": 27, "Score": 0, "Text": "Good! I will try that. Maybe I'll try an electrical razor and then a manual one for the extra soft feeling.", "CreationDate": "2015-07-28T19:12:44.053", "UserId": 73}
{"Id": 388, "PostId": 31, "Score": 1, "Text": "\"Perfect use\" means correct *and consistent* use, i.e. some pregnancy in the \"typical use\" scenario will have been caused by the couple using no contraception at all at certain times.", "CreationDate": "2015-07-30T18:21:59.390", "UserId": 212}
{"Id": 75, "PostId": 36, "Score": 1, "Text": "Re:\"How much fluid is produced?\" The [study discussed in the OP's comments](http://blogs.discovermagazine.com/seriouslyscience/2015/01/12/proof-female-ejaculation-just-pee/) suggests that \"squirting\" with a large amount of fluid produced is distinct from female ejaculate, and is actually just urine.", "CreationDate": "2015-07-28T20:02:31.523", "UserId": 72}
{"Id": 152, "PostId": 36, "Score": 1, "Text": "i'm sorry but the answer is contradictory now. _\"However, recent research suggests the ejaculate is an alkaline liquid that isn't like urine\"_ vs _\"It turned out that [...] is it chemically identical to urine\"_", "CreationDate": "2015-07-28T22:19:01.737", "UserId": 117}
{"Id": 181, "PostId": 36, "Score": 0, "Text": "@kzkz- I can't do any better, but, only add references to all the links possible. Now, but, my main point which still I've added as of Wikipedia link is to stand correct ---> `the researches are still being carried out, and nothing could be said as of now as it is a debatable topic`... I've made an edit to the answer by highlighting that point about being debatable...", "CreationDate": "2015-07-29T04:56:23.080", "UserId": 13}
{"Id": 241, "PostId": 38, "Score": 0, "Text": "You have listed many negatives for condoms here, am I right in understanding your basic answer is 'No'? A multiplication with the failure rate of condoms seems to barely make a dent in 0.05%, so for pregnancy prevention it really wouldn't be all that impressive.", "CreationDate": "2015-07-29T13:06:30.603", "UserId": 82}
{"Id": 288, "PostId": 38, "Score": 0, "Text": "@Spork: The basic answer is a couple should decide together. Implanted hormones _do_ provide excellent pregnancy protection, but there might be reasons for avoiding that method. In addition, condoms work on different principles than other birth control and so provide [independence](https://en.wikipedia.org/wiki/Independence_(probability_theory)). That extra protection might not seem worthwhile to you, but it might be to someone else. There's just no single right answer.", "CreationDate": "2015-07-29T15:31:42.383", "UserId": 7}
{"Id": 64, "PostId": 42, "Score": 0, "Text": "Good point about strap-on, didn't think of that.", "CreationDate": "2015-07-28T19:53:01.143", "UserId": 61}
{"Id": 68, "PostId": 43, "Score": 0, "Text": "A better answer than mine to bei fair.", "CreationDate": "2015-07-28T19:55:05.540", "UserId": 33}
{"Id": 417, "PostId": 44, "Score": 0, "Text": "Maybe I'm making too much of word choice here, but does enjoying anal stimulation really qualify as a [*fetish*](http://www.merriam-webster.com/dictionary/fetish)?", "CreationDate": "2015-07-31T15:33:14.423", "UserId": 261}
{"Id": 424, "PostId": 44, "Score": 0, "Text": "@femtoRgon-I don't know much about fetish, but what I've experienced from porn movies is that fetish are a special kind of interest or attraction towards a thing/act. So, I believe anal simulation *may* qualify as a fetish act. You are welcome to put your stance though, and any disagreements if any.", "CreationDate": "2015-07-31T17:14:00.093", "UserId": 13}
{"Id": 108, "PostId": 51, "Score": 2, "Text": "+1. Note that a fetish could be born without trauma but still be dangerous...", "CreationDate": "2015-07-28T20:35:23.000", "UserId": 3}
{"Id": 109, "PostId": 51, "Score": 1, "Text": "@Tim Some fetishes such as pedophillia are often dysfunctional but this is a very small minority of fetishes--most are benign.", "CreationDate": "2015-07-28T20:36:39.807", "UserId": 72}
{"Id": 111, "PostId": 51, "Score": 1, "Text": "Yes, although you could include BDSM is practised dangerously / abusively.", "CreationDate": "2015-07-28T20:41:28.693", "UserId": 3}
{"Id": 114, "PostId": 51, "Score": 2, "Text": "@Tim The dysfunction there is not inherent in the fetish (no legal or ethical dilemmas) but rather in the risky behavior some people choose to pursue. It is very easy to make very risky sexual decisions, regardless of fetish or vanilla.", "CreationDate": "2015-07-28T20:44:08.907", "UserId": 72}
{"Id": 735, "PostId": 52, "Score": 0, "Text": "Thanks, guess I'm not going to get any better answer so accepting this one.", "CreationDate": "2015-08-06T21:53:58.560", "UserId": 61}
{"Id": 744, "PostId": 52, "Score": 0, "Text": "@ShadowWizard It's a difficult question because the G-Spot's existence is disputed.. If you're wondering about the goal itself (i.e. help your partner reach orgasm) maybe there's a different question, with answers that would help more than 'it may not exist'.", "CreationDate": "2015-08-06T22:51:22.710", "UserId": 82}
{"Id": 763, "PostId": 52, "Score": 0, "Text": "Thanks, think there was such answer here actually, that was later removed and became a different question.", "CreationDate": "2015-08-07T04:57:06.220", "UserId": 61}
{"Id": 206, "PostId": 53, "Score": 0, "Text": "Where in the almanac does it say that the love of a man for a woman is equal to the love of a man for a man? A quote would be nice!", "CreationDate": "2015-07-29T08:17:37.307", "UserId": 172}
{"Id": 209, "PostId": 53, "Score": 0, "Text": "@Joze I don't know where, sorry.", "CreationDate": "2015-07-29T08:38:25.173", "UserId": 3}
{"Id": 210, "PostId": 53, "Score": 0, "Text": "Then what makes you say it's there? What makes you say they were recognized. If you don't have the quote of the almanac is it mentioned elsewhere that it is written in the almanac? Or is this just *hearsay*?", "CreationDate": "2015-07-29T08:41:16.093", "UserId": 172}
{"Id": 211, "PostId": 53, "Score": 0, "Text": "@Joze All this information is from the source, referenced.", "CreationDate": "2015-07-29T08:51:27.020", "UserId": 3}
{"Id": 129, "PostId": 57, "Score": 0, "Text": "Would you please comment on how I can improve this answer?", "CreationDate": "2015-07-28T21:12:05.670", "UserId": 33}
{"Id": 132, "PostId": 57, "Score": 3, "Text": "Two suggestions: 1) please [avoid slang](http://meta.sexuality.stackexchange.com/q/18/7) and 2) it's a little weird to present a \"one-size-fits-all\" procedure. I also am leary of an answer that makes a promise like the one you make in the last sentence.", "CreationDate": "2015-07-28T21:34:16.150", "UserId": 7}
{"Id": 136, "PostId": 57, "Score": 0, "Text": "There are a lot of spelling mistakes here too - pleasure should be pressure, bit should be but, ther should be there", "CreationDate": "2015-07-28T21:44:26.230", "UserId": 3}
{"Id": 140, "PostId": 57, "Score": 0, "Text": "@Tim I am not a native speaker and try my best to write everything correctly. If it just spelling mistakes you could suggest an edit.", "CreationDate": "2015-07-28T21:47:38.460", "UserId": 33}
{"Id": 101, "PostId": 58, "Score": 1, "Text": "Good point but not answering the question.", "CreationDate": "2015-07-28T20:27:40.683", "UserId": 33}
{"Id": 103, "PostId": 58, "Score": 9, "Text": "@BrainStone \"You find out by asking your partner.\" Question answered.", "CreationDate": "2015-07-28T20:28:53.513", "UserId": 72}
{"Id": 104, "PostId": 58, "Score": 1, "Text": "Totally agree, from experience. With one of my girlfriends I was sure she is faking her orgasms. Took me months to realize she wasn't.", "CreationDate": "2015-07-28T20:29:20.200", "UserId": 61}
{"Id": 141, "PostId": 58, "Score": 0, "Text": "emotionally valid, but the OP (and I) could be interested in knowing *scientifically* how to spot a fake orgasm.", "CreationDate": "2015-07-28T21:49:07.363", "UserId": 117}
{"Id": 142, "PostId": 58, "Score": 1, "Text": "@kzkz that's definitely not what the OP seems to be asking. They want to 'know' whether it is occurring. Scientifically, the answer is trivial (given access to brain signals and muscle activity).", "CreationDate": "2015-07-28T21:51:08.637", "UserId": 82}
{"Id": 150, "PostId": 63, "Score": 0, "Text": "interesting, could you point to any reference?", "CreationDate": "2015-07-28T22:11:36.340", "UserId": 117}
{"Id": 178, "PostId": 63, "Score": 0, "Text": "@kzkz all of those make sense, don't think reference is really needed.", "CreationDate": "2015-07-29T04:31:34.300", "UserId": 61}
{"Id": 348, "PostId": 68, "Score": 0, "Text": "I agree with your answer, but your link does not say that pre-ejaculate is more potent than actual ejaculate.  Did you use the wrong link?", "CreationDate": "2015-07-30T05:35:34.620", "UserId": 59}
{"Id": 352, "PostId": 68, "Score": 0, "Text": "@Sciencertobe oops, I improved an edit and messed it up... no time at the moment but will figure out what to do soon. Thanks!", "CreationDate": "2015-07-30T06:56:28.000", "UserId": 61}
{"Id": 392, "PostId": 68, "Score": 0, "Text": "@Tim what sources you saw claiming the pre-ejaculate is more potent than the semen itself? I searched now and they all claim that while it's possible for the pre-ejaculate to contain sperm, it's not more potent then the semen itself. Removed it for now, unless you can find a source. Thanks! :)", "CreationDate": "2015-07-30T19:17:51.693", "UserId": 61}
{"Id": 118, "PostId": 72, "Score": 1, "Text": "Another hint is the the wildly increased prevalence of sexual problems for alcoholics, e.g.: http://www.jsad.com/doi/abs/10.15288/jsa.1997.58.91.", "CreationDate": "2015-07-28T20:54:22.500", "UserId": 82}
{"Id": 254, "PostId": 73, "Score": 0, "Text": "It might be worth mentioning that this type of birth control should not be used in conjunction with electrical stimulation.", "CreationDate": "2015-07-29T13:41:11.747", "UserId": 179}
{"Id": 125, "PostId": 74, "Score": 3, "Text": "Is this an answer?  Sounds like you're just describing the original question and providing the clinical term for it.", "CreationDate": "2015-07-28T21:07:31.063", "UserId": 102}
{"Id": 126, "PostId": 74, "Score": 0, "Text": "Q:Is it possible for a man to have an orgasm without ejaculating? - A: yes, dry orgasm.", "CreationDate": "2015-07-28T21:08:26.493", "UserId": 97}
{"Id": 127, "PostId": 74, "Score": 0, "Text": "How do I describe the question? did you read the answer?", "CreationDate": "2015-07-28T21:08:33.943", "UserId": 97}
{"Id": 128, "PostId": 74, "Score": 0, "Text": "I know I'm sort of new to SE, but presumably we're not looking for something that boils down to a yes/no answer.  Especially when the original _question itself_ notes one clinical cause of dry orgasm.  To remove all doubt I just edited the question to ask for something more than a confirmatory \"yes.\"", "CreationDate": "2015-07-28T21:11:41.463", "UserId": 102}
{"Id": 130, "PostId": 74, "Score": 0, "Text": "Basically your question was a yes or no question. You asked if it was possible, and I answered. It's not just a 'yes', it explains what the dry orgasm is", "CreationDate": "2015-07-28T21:12:56.973", "UserId": 97}
{"Id": 131, "PostId": 74, "Score": 1, "Text": "Just to add; there are toys specifically designed to induce a 'dry' prostate orgasm.  See: 'Aneros' brand devices.", "CreationDate": "2015-07-28T21:24:21.603", "UserId": 112}
{"Id": 261, "PostId": 74, "Score": 0, "Text": "@BTrainTF actually what I know is the other way around: prostate stimulation might lead to full ejaculation without orgasm.", "CreationDate": "2015-07-29T13:56:04.370", "UserId": 61}
{"Id": 430, "PostId": 76, "Score": 0, "Text": "the question is: would this bad? I'm thinking about sliding your penis so much, and this would be bad.", "CreationDate": "2015-07-31T18:21:36.693", "UserId": 147}
{"Id": 433, "PostId": 76, "Score": 0, "Text": "@Ooker not sure what you mean? That too much time spent on intercourse is bad?", "CreationDate": "2015-07-31T19:43:24.640", "UserId": 61}
{"Id": 434, "PostId": 76, "Score": 0, "Text": "no, I mean in the masturbation case", "CreationDate": "2015-07-31T19:47:28.260", "UserId": 147}
{"Id": 436, "PostId": 76, "Score": 0, "Text": "@Ooker oh, so you meant \"rubbing\" not \"sliding\" and again, why bad? If one do it right and in a way that feels good for him, there is nothing bad in it no matter how much it's being done. Plus, there are some who don't need that much rubbing to reach orgasm while masturbating. :)", "CreationDate": "2015-07-31T20:00:41.493", "UserId": 61}
{"Id": 451, "PostId": 76, "Score": 0, "Text": "I used to do this, and my penis was hurt later. I guess when rubbing, we make pressure on it (and that's the source of stimulation)", "CreationDate": "2015-08-01T08:33:23.047", "UserId": 147}
{"Id": 452, "PostId": 76, "Score": 0, "Text": "@Ooker well it is different for each person, for me it never hurt.", "CreationDate": "2015-08-01T08:40:30.957", "UserId": 61}
{"Id": 453, "PostId": 76, "Score": 0, "Text": "No? You must be iron man XD", "CreationDate": "2015-08-01T09:45:26.493", "UserId": 147}
{"Id": 154, "PostId": 79, "Score": 2, "Text": "In my reading of Gilgamesh, I see [Enkidu](https://en.wikipedia.org/wiki/Enkidu) and [Gilgamesh](https://en.wikipedia.org/wiki/Gilgamesh) as close friends, but not necessarily having a sexual relationship. That doesn't mean the epic _isn't_ describing a homosexual relationship, but rather that it requires interpretation.", "CreationDate": "2015-07-28T22:31:21.880", "UserId": 7}
{"Id": 207, "PostId": 79, "Score": 1, "Text": "@JE: This story has been rewritten many times, so there are many versions of the Epic of Gilgamesh, they can be grouped in three groups, the Akkadian, the Babylonian and the Sumerian versions. And of course there are dozens of ways how to interpret parts of the story. But fact is: Gilgamesh was a real living person. In the Epic he refused any relationship with a woman or female god. From the day when he met Enkidu, they lived together; Enkidu and Gilgamesh slept in the same room, Gilgamesh let sit Enkidu in a throne beside his own. When Enkidu died, Gilgamesh fell into a deep mourning.", "CreationDate": "2015-07-29T08:26:17.497", "UserId": 115}
{"Id": 218, "PostId": 79, "Score": 1, "Text": "@JE They were then **very very very VERY** close friends then. More than family.", "CreationDate": "2015-07-29T09:15:28.680", "UserId": 172}
{"Id": 159, "PostId": 81, "Score": 0, "Text": "You list many thought and possibilities of why it *could* be bad - but the question is how much *is* bad?", "CreationDate": "2015-07-28T23:58:53.633", "UserId": 82}
{"Id": 160, "PostId": 81, "Score": 0, "Text": "@Spork, I answered that: it depends on the individual and the technique used.  Basically, self-injury is bad, otherwise it's up to the individual in question.", "CreationDate": "2015-07-29T00:03:00.360", "UserId": 125}
{"Id": 161, "PostId": 81, "Score": 1, "Text": "I would only add this:  Folks around the world consider masturbation taboo or immoral.  It's understandable that stories about masturbation's harmful effects would spread.  The fact is that, unless you're physically injuring yourself or are caught up in an addition that is harming your personal relationships, career, finances, etc. there is no evidence that masturbation -- even frequent masturbation -- is harmful.  Have at it!", "CreationDate": "2015-07-29T00:14:10.227", "UserId": 131}
{"Id": 165, "PostId": 81, "Score": 0, "Text": "Isn't masturbation one of the _cures_ for priapism?", "CreationDate": "2015-07-29T00:32:16.713", "UserId": 102}
{"Id": 269, "PostId": 86, "Score": 2, "Text": "Thank you for answering, unfortunately links sending users elsewhere to find that information aren't really considered an \"answer\" on this site. The folks here will work hard to curate this collection of knowledge, so when someone finally finds this site through search, the last thing we want to do is send them *elsewhere* to find that information. Can you include the essential parts of answering the question in the *body* of your post? Thanks.", "CreationDate": "2015-07-29T14:16:04.757", "UserId": 90}
{"Id": 343, "PostId": 86, "Score": 1, "Text": "Better?  Thanks for patiently guiding me through this process.", "CreationDate": "2015-07-29T22:47:22.460", "UserId": 131}
{"Id": 344, "PostId": 86, "Score": 1, "Text": "Waaaay better! Awesome. Thank you for being so gracious.", "CreationDate": "2015-07-30T01:22:45.107", "UserId": 90}
{"Id": 184, "PostId": 87, "Score": 0, "Text": "Thanks many good points here. I actually tried some (e.g. masturbation and Stop and Start) but each got its downsides.", "CreationDate": "2015-07-29T05:03:43.947", "UserId": 61}
{"Id": 191, "PostId": 87, "Score": 0, "Text": "This answer appears to assume heterosexual intercourse. In a SE on sexuality in the 21st century, I'd like to think we can be enlightened enough not to assume that sex is always going to be with the opposite sex.", "CreationDate": "2015-07-29T05:15:11.370", "UserId": 79}
{"Id": 195, "PostId": 87, "Score": 1, "Text": "@sss4r: We cannot assume it is _always_ going to be the opposite sex but we _can assume_ it is _very likely_ going to be the opposite sex. If the OP wants to know something that is about minority orientations sex he/she should ask that specifically.", "CreationDate": "2015-07-29T05:32:12.267", "UserId": 151}
{"Id": 198, "PostId": 87, "Score": 0, "Text": "@sss4r I agree with wix here, we can't disqualify answers with specific target audience. If one wants, he/she can post similar answer for homosexual intercourse and same way, it won't be disqualified. I left my question \"neutral\" on purpose since this isn't a personal help forum.", "CreationDate": "2015-07-29T06:11:47.753", "UserId": 61}
{"Id": 212, "PostId": 87, "Score": 0, "Text": "I was in no way attempting to invalidate the answer. Only trying to raise some awareness. I suppose being in the minority has given me some practice at phrasing gender-neutral.", "CreationDate": "2015-07-29T08:55:47.840", "UserId": 79}
{"Id": 319, "PostId": 87, "Score": 1, "Text": "I would not recommend masturbating so close to the intercourse you are planing to have with your partner. While it might make you last longer it might also prevent your from reaching orgasm, since you will be somewhat satisfied already. Instead, IMHO, take short breaks, stop the pumping action, kiss, caress, pull out even, and resume when your own arousal lessens a bit.", "CreationDate": "2015-07-29T18:59:37.307", "UserId": 151}
{"Id": 216, "PostId": 90, "Score": 0, "Text": "It is hard to wake up in the middle of the dream", "CreationDate": "2015-07-29T09:11:46.670", "UserId": 147}
{"Id": 223, "PostId": 90, "Score": 1, "Text": "@Ooker-No, you can. I seriously tried this 2 or 3 times and got success. It needs much practice and portion of your conscious/sub-conscious mind! Good Luck.;)", "CreationDate": "2015-07-29T09:27:50.213", "UserId": 13}
{"Id": 271, "PostId": 90, "Score": 0, "Text": "I also can wake up from a dream. The most difficult part is to be aware that your are dreaming.", "CreationDate": "2015-07-29T14:24:12.520", "UserId": 201}
{"Id": 273, "PostId": 90, "Score": 0, "Text": "@mansa how do you tell yourself that you are dreaming? Sometimes, I can feel that something is not realistic, but still cannot open my eyes", "CreationDate": "2015-07-29T14:27:27.870", "UserId": 147}
{"Id": 274, "PostId": 90, "Score": 0, "Text": "@Ooker: Then you should try do something with the non realistic thing. If it is a pink dragon, try to hurt hard his eyes with a finger. You may also think to something bad in your real life that you care about.", "CreationDate": "2015-07-29T14:32:33.270", "UserId": 201}
{"Id": 182, "PostId": 91, "Score": 0, "Text": "This is not really a complete answer, since you are not providing any sources...", "CreationDate": "2015-07-29T04:58:29.163", "UserId": 146}
{"Id": 185, "PostId": 91, "Score": 0, "Text": "@Noldor130884-Added refernece, thanks for pointing. BTW, you can get more ieda from the link I've added. :)", "CreationDate": "2015-07-29T05:04:01.517", "UserId": 13}
{"Id": 205, "PostId": 94, "Score": 0, "Text": "I've actually heard the opposite, that the increased friction on the glans makes it *too* easy to get off. Either way, it's the effect on the longevity of intercourse which is interesting.", "CreationDate": "2015-07-29T08:03:47.770", "UserId": 124}
{"Id": 220, "PostId": 96, "Score": 1, "Text": "Could you potentially elaborate on what these things are, and why they're a good fit as a solution? Do you have any information about internal use? Safety concerns and regulations?", "CreationDate": "2015-07-29T09:22:48.003", "UserId": 23}
{"Id": 278, "PostId": 96, "Score": 0, "Text": "@NicolBolas, yes good idea, i have done that", "CreationDate": "2015-07-29T14:58:44.083", "UserId": 167}
{"Id": 276, "PostId": 103, "Score": 2, "Text": "``Fellatio`` is always a male recieving oral sex. The female counterpart is called `cunnilingus`.", "CreationDate": "2015-07-29T14:44:17.390", "UserId": 33}
{"Id": 289, "PostId": 103, "Score": 0, "Text": "Good to know :) But I guess my advice can go both ways...", "CreationDate": "2015-07-29T15:39:05.783", "UserId": 168}
{"Id": 600, "PostId": 104, "Score": 2, "Text": "This quote is from a paper by Morten Frisch, a leading anti-circumcision activist. There's a detailed critique of the methods and the data in a later issue of the same journal.  For those reasons, and others I have described elsewhere, I wouldn't trust any of these numbers.  This is NOT unbiased science.", "CreationDate": "2015-08-04T02:10:48.787", "UserId": 228}
{"Id": 722, "PostId": 104, "Score": 0, "Text": "@ShaktiAmarantha, do you perhaps have a link to the critique, for evaluation purposes? Thanks!", "CreationDate": "2015-08-06T18:20:41.293", "UserId": 108}
{"Id": 750, "PostId": 104, "Score": 1, "Text": "@lindes - http://ije.oxfordjournals.org/content/41/1/310.full. ** Note that most of Frisch's sample were men who were \"circumcised\" as adults because of genital problems like phimosis. I use quotes, because Danish practice is to slit the foreskin or remove a relatively small part, not all of it. So the study refers primarily to men who had pre-existing genital problems prior to surgery AND who were not \"circumcised\" as most, e.g., Americans would understand that word. (Just fyi, neither party in that exchange sounds very objective to me.)", "CreationDate": "2015-08-06T23:54:54.960", "UserId": 228}
{"Id": 234, "PostId": 106, "Score": 1, "Text": "+1 for the \"can lose control\" part, didn't think of that. :)", "CreationDate": "2015-07-29T12:50:43.663", "UserId": 61}
{"Id": 428, "PostId": 107, "Score": 0, "Text": "A good answer, but seems to assume the subject is in a long-term monogamous relationship, and acquires the STI after entering the relationship. (Although I didn't specify, this isn't what I had in mind.) :(", "CreationDate": "2015-07-31T18:11:25.003", "UserId": 93}
{"Id": 208, "PostId": 111, "Score": 0, "Text": "Fully agree, however I'd have to add that the number of sperm cells in per-ejaculation is much lower, and has a smaller chance of getting your partner pregnant. Out of probably 200 unprotected times or so, I (fortunately) never got my partner pregnant.", "CreationDate": "2015-07-29T08:37:45.383", "UserId": 176}
{"Id": 227, "PostId": 111, "Score": 1, "Text": "@EduardLuca Your comment isn't scientific fact. It is an anecdote with many uncertainties. For instance, are your sperm viable and capable of fertilizing an egg without intervention? Were the women (or woman) you were with fertile? Just a warning to not take this as fact without further investigation.", "CreationDate": "2015-07-29T12:01:19.807", "UserId": 197}
{"Id": 230, "PostId": 111, "Score": 0, "Text": "I was merely saying it's a more or less accurate statistic, not a fact.", "CreationDate": "2015-07-29T12:39:58.527", "UserId": 176}
{"Id": 346, "PostId": 111, "Score": 0, "Text": "I'm willing to grant that pregnancy from pre-ejaculate is just as possible, but is there evidence to support that it is just as _probable_?", "CreationDate": "2015-07-30T02:16:10.173", "UserId": 78}
{"Id": 358, "PostId": 111, "Score": 0, "Text": "@EduardLuca I mentioned that it came from the same organ as normal ejaculation even if the spermatoza\"sperm\" is in a smaller amount.\nSorry if i didn't make myself clear", "CreationDate": "2015-07-30T09:25:39.207", "UserId": 175}
{"Id": 479, "PostId": 113, "Score": 0, "Text": "I swear this happens every time. I feel like those studies may be a little bit biased... Or I may just be unlucky. No, there wasn't any change in *our* lifestyle either!", "CreationDate": "2015-08-02T06:46:27.423", "UserId": 146}
{"Id": 481, "PostId": 113, "Score": 0, "Text": "@Noldor130884 Then maybe it's time to talk with a doctor. That's not an intended side-effect of the birth control pill, which means they'll probably recommend switching  birth control regimes.", "CreationDate": "2015-08-02T06:50:10.213", "UserId": 23}
{"Id": 233, "PostId": 117, "Score": 2, "Text": "I've had a condom break before.  Neither of us felt it.  I only noticed it while pulling out to switch positions.", "CreationDate": "2015-07-29T12:49:38.173", "UserId": 131}
{"Id": 236, "PostId": 117, "Score": 0, "Text": "@Eleomosynator - I've never had one break where one of us hasn't noticed it, but I can see where it would happen. Added a sentence to make that clearer", "CreationDate": "2015-07-29T12:54:53.600", "UserId": 124}
{"Id": 389, "PostId": 122, "Score": 0, "Text": "most men don't get an instant orgasm from prostate massage, however it can be pleasurable, especially if combined with penile stimulation (eg. sexual arousal). I think few men can actually reach orgasm from prostate massage only, but maybe vibrator can give more intense sensations. Some men say they can orgasm from it though.", "CreationDate": "2015-07-30T18:29:53.720", "UserId": 242}
{"Id": 391, "PostId": 122, "Score": 0, "Text": "@nus that's right, hence I used \"Supposedly\" and \"can\", implying it does not always happen. As for the other things you described, not really relevant for the question here which is only about the prostate itself", "CreationDate": "2015-07-30T19:11:14.320", "UserId": 61}
{"Id": 310, "PostId": 127, "Score": 0, "Text": "Could you rephrase the buzzfeed quote? (I tried to add a [blockquote](http://sexuality.stackexchange.com/editing-help#simple-blockquotes), but found it was more of a paraphrase.)", "CreationDate": "2015-07-29T17:46:27.200", "UserId": 7}
{"Id": 357, "PostId": 127, "Score": 0, "Text": "@JE: is it about copyright status of the sentences ?", "CreationDate": "2015-07-30T09:04:15.487", "UserId": 201}
{"Id": 379, "PostId": 127, "Score": 0, "Text": "No. I was more interested in clarifying which part was quotation and which part was your words.  (Please see: http://sexuality.stackexchange.com/help/referencing)", "CreationDate": "2015-07-30T15:17:57.867", "UserId": 7}
{"Id": 394, "PostId": 127, "Score": 2, "Text": "I can't find anything in the linked study claiming that 50% of cases occur in extramaritial affairs, and frankly I don't see how it's relevant to the question, which means I perceive it as a moralist remark which seems to reveal a very conservative view on sexuality (eg. lots of people have active sex lives without ever getting married in the first place). I would appreciate it if you removed it.", "CreationDate": "2015-07-30T19:25:39.823", "UserId": 242}
{"Id": 406, "PostId": 127, "Score": 0, "Text": "@nus I will add a better a reference in late august (after vacations).  By the word \"affair\" I implied that one of the partners did have sex without authorization from its stable partner (married or not).", "CreationDate": "2015-07-31T09:14:01.057", "UserId": 201}
{"Id": 596, "PostId": 127, "Score": 0, "Text": "@nus - The link was misdirected.  The correct link contains the quote.  \"**Results.  Half of these penile fracture patients sustained the injury during an extramarital affair.**\"  The OP wasn't making a judgment, he was stating a fact, and mentioning that breaking your penis while having an affair will create the uncomfortable situation of having to explain to your significant other how you managed to break your dick.   It is incredibly hypocritical to jump to moralistic conclusions while chastising strangers for supposedly being too morally judgmental.", "CreationDate": "2015-08-04T01:44:02.490", "UserId": 98}
{"Id": 597, "PostId": 127, "Score": 1, "Text": "@nus a If you read the report linked in the answer, you will see that the study in question was primarily focused on the potential connection between having sex in stressful conditions and penis fractures.  It appears that there may very well be just such a connection.  In this context, it is entirely logical for the OP to mention that half of all the fractures in the study occurred during an extramarital affair.  Affairs tend to involve a good deal of stress, since the participants presumably don't want to be caught.", "CreationDate": "2015-08-04T01:49:28.377", "UserId": 98}
{"Id": 598, "PostId": 127, "Score": 0, "Text": "The original edit had a link to an article that said the same thing:  In a small study of 16 penile fractures, half of them happened during an extramarital affair. Obviously this is a tiny study, but Paduch says this is pretty common knowledge among doctors who fix penis injuries. It sounds like karma, but the real reason makes a lot of sense: Cheating sex is often rushed and happening outside the bedroom (think: car, office, closet, bathroom, etc.). And now your penis is broken and you have to explain how that happened without bae there…good luck.", "CreationDate": "2015-08-04T01:53:48.660", "UserId": 98}
{"Id": 266, "PostId": 129, "Score": 0, "Text": "I don't really think it's relevant, since my question is about having longer intercourse, not longer time in bed generally.", "CreationDate": "2015-07-29T14:12:05.980", "UserId": 61}
{"Id": 267, "PostId": 129, "Score": 0, "Text": "I talked about myself: with such long foreplays, I usually have a longer intercourse, and my orgasm happens after my female partner's -- so that my partner is feeling a bit like a sextoy when I orgasm.", "CreationDate": "2015-07-29T14:14:37.517", "UserId": 201}
{"Id": 268, "PostId": 129, "Score": 0, "Text": "I see... well can't really see how it happens, but guess each and his own, so thanks for the advice.", "CreationDate": "2015-07-29T14:15:25.820", "UserId": 61}
{"Id": 281, "PostId": 133, "Score": 0, "Text": "Can you add an URL ?", "CreationDate": "2015-07-29T15:08:15.173", "UserId": 201}
{"Id": 283, "PostId": 133, "Score": 0, "Text": "Not right now, I'm at work. But I'll see if I can find something later.", "CreationDate": "2015-07-29T15:15:35.410", "UserId": 179}
{"Id": 401, "PostId": 133, "Score": 0, "Text": "Sorry, I'm unable to find the sources I was looking for.", "CreationDate": "2015-07-31T07:18:31.553", "UserId": 179}
{"Id": 523, "PostId": 133, "Score": 0, "Text": "Here's a good reference: http://www.medscape.com/viewarticle/502344", "CreationDate": "2015-08-03T10:03:20.750", "UserId": 102}
{"Id": 654, "PostId": 133, "Score": 0, "Text": "Thanks. Edited to be at least a bit less vague. The source is far more accurate than my descriptions, but very technical, so I'll keep the summary for now. Also clarified my doubts about stretching.", "CreationDate": "2015-08-05T16:46:48.547", "UserId": 179}
{"Id": 655, "PostId": 133, "Score": 0, "Text": "Also still looking for my original sources. I remember googling the specifics after watching a documentary, but that was some time ago. If I find the video, I might be able to follow the trail from there.", "CreationDate": "2015-08-05T16:48:04.800", "UserId": 179}
{"Id": 375, "PostId": 135, "Score": 0, "Text": "I believe it is also used professionally, to create 'slime' in movie productions.  Just add a couple drops of food coloring, and you've got yourself a thick, gooey, slippery slime on par with your favorite monster movie.  Another important bonus for J-lube; it's safe for internal use.  Don't put flour and water into a vagina, please.", "CreationDate": "2015-07-30T14:34:21.270", "UserId": 112}
{"Id": 445, "PostId": 141, "Score": 1, "Text": "Those may be the signs of an orgasm for a woman, but they are easy to duplicate falsely if you are purposely trying to! If you could fake a sneeze convincingly, complete with all of the little things that seem involuntary beforehand, you could purposely exhibit those signs too! Agree with you that the way to \"know for sure\" is to talk to your partner, and address why she might feel like she needs to \"Fake It\".", "CreationDate": "2015-07-31T22:58:35.883", "UserDisplayName": "user277"}
{"Id": 315, "PostId": 143, "Score": 0, "Text": "Any relevant source for further study?", "CreationDate": "2015-07-29T18:53:15.400", "UserId": 13}
{"Id": 316, "PostId": 143, "Score": 0, "Text": "Sources, please.", "CreationDate": "2015-07-29T18:53:17.877", "UserId": 64}
{"Id": 325, "PostId": 143, "Score": 0, "Text": "@ssuman only for the Edging, couldn't find for the absence of danger", "CreationDate": "2015-07-29T19:17:22.523", "UserId": 61}
{"Id": 326, "PostId": 143, "Score": 0, "Text": "@Flimzy see above comment", "CreationDate": "2015-07-29T19:17:32.793", "UserId": 61}
{"Id": 327, "PostId": 145, "Score": 0, "Text": "Both of these are medical conditions carrying risks of infertility, which are not, ideally, something one wants to attain (nor are there sources cited in this post indicating they can either be induced lrlead to multiple orgasms).", "CreationDate": "2015-07-29T19:37:15.787", "UserId": 23}
{"Id": 330, "PostId": 145, "Score": 0, "Text": "All right now?  &nbsp;", "CreationDate": "2015-07-29T19:40:17.510", "UserId": 185}
{"Id": 365, "PostId": 151, "Score": 0, "Text": "Great answer!!!", "CreationDate": "2015-07-30T11:11:56.823", "UserId": 211}
{"Id": 553, "PostId": 151, "Score": 0, "Text": "Don't mind,but are you practising sexology anywhere? This answer reveals a lot of experience in this field..", "CreationDate": "2015-08-03T17:04:35.630", "UserId": 13}
{"Id": 602, "PostId": 151, "Score": 0, "Text": "@Kaamdeva - Thanks!", "CreationDate": "2015-08-04T02:22:34.513", "UserId": 228}
{"Id": 603, "PostId": 151, "Score": 0, "Text": "@ssusman - I started researching sexuality in general and tantric sex in particular in the early 90s, back when my SO and I started learning the latter.  So I've spent over 20 years accumulating info and resources.  I blog about it at moderntantra.blogspot.com/, which is where that long section came from.  But, alas, my day job is totally different and much less sexy!  :)", "CreationDate": "2015-08-04T02:22:52.203", "UserId": 228}
{"Id": 372, "PostId": 158, "Score": 0, "Text": "Maybe they love their sex toys!", "CreationDate": "2015-07-30T14:04:41.410", "UserId": 237}
{"Id": 418, "PostId": 159, "Score": 0, "Text": "Could you give a reference to the recent test of Implanon? How many subjects were involved? \"The risk is really zero\" is a false claim regardless, are you sure you mean risk?", "CreationDate": "2015-07-31T15:38:07.123", "UserId": 82}
{"Id": 419, "PostId": 159, "Score": 0, "Text": "That New York Times visualization is pretty amazing!", "CreationDate": "2015-07-31T15:41:00.677", "UserId": 82}
{"Id": 503, "PostId": 159, "Score": 1, "Text": "I don't currently have access to that source, but this Wikipedia summary matches what I've seen in the research: \"Prospective follow-up studies of Implanon, which include over 2,467 women-years of exposure, have found no pregnancies.[5][10][13][14][18][19][20] Other studies have found some failures with this method, some attributed to failures of the method itself and others to improper placement, drug interactions, or conception prior to method insertion.[21]\"", "CreationDate": "2015-08-02T18:30:14.690", "UserId": 228}
{"Id": 504, "PostId": 159, "Score": 0, "Text": "[Cont'd] That last sentence is properly conservative, but as far as I am aware, there have been no pregnancies with a correctly inserted Implanon that were not clearly attributable to prior conception or a gross drug conflict. Incidentally, that includes zero pregnancies in the fourth year, even though it is only certified for three, so there is considerable buffer to prevent the most common user error, which is not renewing the implant on schedule.", "CreationDate": "2015-08-02T18:31:47.887", "UserId": 228}
{"Id": 710, "PostId": 163, "Score": 1, "Text": "Downvoting for drawing too broad of conclusions about gender differences, without any citations. I'm currently reading *Come As You Are*, and while it agrees that there are some general gendered differences, it also talks about individual differences being bigger than the gendered ones. So, I don't think this is accurate (even if it may *resemble* some *general* truths).", "CreationDate": "2015-08-06T08:04:51.960", "UserId": 108}
{"Id": 367, "PostId": 164, "Score": 1, "Text": "Inserting a finger tip in her anus without prior authorization is a rape, and may ruin her experience with you.", "CreationDate": "2015-07-30T12:28:02.770", "UserId": 201}
{"Id": 896, "PostId": 164, "Score": 0, "Text": "That sign seems as easy to fake as any other.", "CreationDate": "2015-08-10T20:39:28.290", "UserId": 64}
{"Id": 475, "PostId": 166, "Score": 2, "Text": "Good answer!  One correction:  the muscles in question are NOT part of the vaginal wall.  Instead, they surround the introitus, the opening of the vagina. A vagina is not an empty space.  Unless air is blown or trapped inside it, the vagina will conform naturally around anything that is inserted into it.  However, the opening is the only part that can actually squeeze tightly around the penis, and that's where having strong kegel muscles comes in.", "CreationDate": "2015-08-02T03:27:53.543", "UserId": 228}
{"Id": 400, "PostId": 167, "Score": 0, "Text": "This is an evolutionary thing, much like \"heat\" in animals, except we humans have higher brain functions that can override this instinct. It's designed to help humans procreate, as it does in all sexual animals.", "CreationDate": "2015-07-31T06:23:20.217", "UserId": 253}
{"Id": 403, "PostId": 167, "Score": 0, "Text": "@phyrfox the first few lines of the source I used says this: \"(...) human women don’t go into heat. They can become pregnant and feel receptive to sex year-round.\"", "CreationDate": "2015-07-31T08:00:20.080", "UserId": 82}
{"Id": 404, "PostId": 167, "Score": 1, "Text": "Of course humans don't go into heat. I never said they do. It's simply a matter of procreation. All animals, and humans, generally feel an increased desire to copulate when there's a good chance of producing offspring. In animals, it's instinctual and very hard to deny (some even self-destruct, do so even though it will end their life, etc), while humans, like some other species, get to *choose* when, or if, they will mate. If there were no desire to procreate *at all*, we'd be extinct.", "CreationDate": "2015-07-31T08:08:38.063", "UserId": 253}
{"Id": 390, "PostId": 170, "Score": 0, "Text": "Thanks, good points.", "CreationDate": "2015-07-30T19:01:24.150", "UserId": 61}
{"Id": 393, "PostId": 171, "Score": 0, "Text": "Sorry but the focus of this answer is not relevant to the question. More than that, you're outright wrong. There is no such thing \"condom meant for anal sex\", as clearly explained [here](http://learn.condomdepot.com/2014/02/25/five-best-condoms-for-anal-sex/): \"The FDA currently considers anal sex very dangerous– so dangerous, in fact, that **they won’t approve any condoms for anal usage**\" which means that it's all just non tested recommendations.", "CreationDate": "2015-07-30T19:23:16.283", "UserId": 61}
{"Id": 397, "PostId": 171, "Score": 0, "Text": "@shadowwizard I'm sorry about the mistake. I have not found (right now on the net) any brand specifically advertising condoms for anal use, so I changed my answer. I have a memory of having seen that before, but it's old an blurry. Note that I never claimed that there were any official standards for anal condoms. Furthermore, the jurisdiction of the FDA is limited to the US.", "CreationDate": "2015-07-30T20:05:01.340", "UserId": 242}
{"Id": 398, "PostId": 171, "Score": 0, "Text": "Cheers, while not wrong, the answer still doesn't 100% answer the direct question, but guess that without some actual benchmark results or at least surveys, it's not really possible to know.", "CreationDate": "2015-07-30T20:44:33.227", "UserId": 61}
{"Id": 437, "PostId": 173, "Score": 1, "Text": "1. Wrong. Lubrication can help if you're new to it, and is never disadvantageous, but it is not necessary for painless anal sex if you're used to it. If your too dry, use some salvia. 2. Wrong. The glans of a fully erected hard penis is soft enough, and, watch the brown thing that you sometimes leave in the toilet. A normal penis is not thicker. 3. Yes. This should be #1 in your list. Anal sex without relaxing of the receiving partner causes pain to her or him. 4. Yes, when you're new to it. But you're wrong in one very important point: Pain is NOT normal!!! If it hurts, you're doing it wrong.", "CreationDate": "2015-07-31T20:06:04.067", "UserId": 115}
{"Id": 446, "PostId": 173, "Score": 1, "Text": "This is a good answer, but pain can be completely avoided. If you need pointers, I will provide, but I just wanted to raise this flag, in case you're willing to consider changing the wording of the first sentence.", "CreationDate": "2015-07-31T23:05:20.140", "UserId": 79}
{"Id": 408, "PostId": 176, "Score": 0, "Text": "Instead of a toy, it would be better to recommend a finger of the prenetrated person, with short and clean nail, with lubrificant, with or without condom. It did not make any pain to me, even for the first time.", "CreationDate": "2015-07-31T09:29:54.023", "UserId": 201}
{"Id": 422, "PostId": 176, "Score": 0, "Text": "Toys are more sanitary than fingers, and come in many sizes. Many people's fingers are rather large and can cause discomfort. Fingers also bend, which may not be desirable for a person new to the anal experience.", "CreationDate": "2015-07-31T15:55:46.837", "UserId": 122}
{"Id": 438, "PostId": 176, "Score": 0, "Text": "Best answer! Anal sex doesn't hurt if you relax and be patient. If it hurts, you are doing it wrong!", "CreationDate": "2015-07-31T20:08:50.490", "UserId": 115}
{"Id": 425, "PostId": 178, "Score": 1, "Text": "This appears to contain some dangerously inaccurate information: For example, HPV has been found to \"[cause approximately 5 percent of all cancers worldwide](http://www.cancer.gov/about-cancer/causes-prevention/risk/infectious-agents/hpv-fact-sheet#q2).\"  You should qualify and ideally provide refs for statements like, \"it's generally harmless,\" \"odds are incredibly low that HPV will cause any harm at all,\" the suggestion that asymptomatic carriers of HPV aren't contagious, the suggestion that sexual activity is no more risky than simply touching carriers of these viruses....", "CreationDate": "2015-07-31T17:47:37.023", "UserId": 102}
{"Id": 440, "PostId": 178, "Score": 0, "Text": "Since my first version was obviously misinterpreted, I've provided a version I think is significantly clearer in my intent.", "CreationDate": "2015-07-31T21:15:21.633", "UserId": 253}
{"Id": 444, "PostId": 189, "Score": 0, "Text": "Hum. I'd still like to know if it happens more frequently to men than women - pop culture certainly thinks it does! Sex is strenuous and orgasm relaxing for women too, but I usually find myself wide awake after!", "CreationDate": "2015-07-31T22:41:07.710", "UserDisplayName": "user277"}
{"Id": 458, "PostId": 192, "Score": 0, "Text": "I would describe blue balls pain as kinda  like the dull back pain you have after crooking your back, but with a more wave-like sensation as the pain grows and shrinks.", "CreationDate": "2015-08-01T16:51:59.160", "UserId": 124}
{"Id": 449, "PostId": 193, "Score": 2, "Text": "+1 for the last paragraph. There are lots and lots of single men out there who have not had a sexual partner for years, if ever, and they aren't laying around in the ER because blue balls did them in. :)", "CreationDate": "2015-07-31T23:46:32.153", "UserId": 223}
{"Id": 450, "PostId": 196, "Score": 2, "Text": "I'm not saying this is a bad answer, but it would be made *much* better if it were to include references to authoritative information.", "CreationDate": "2015-08-01T03:08:27.977", "UserId": 64}
{"Id": 471, "PostId": 196, "Score": 0, "Text": "The traditional belief that [men ejaculating 'often' (what is often) can be bad] is off topic for this question. -1. Also, it could be plain old bullshit, which would make including it even worse (but I can only give -1 once). The link you use as a source is 'relievebackpain.com'.", "CreationDate": "2015-08-01T23:13:04.687", "UserId": 82}
{"Id": 477, "PostId": 196, "Score": 1, "Text": "Some schools of tantrism, largely Daoist in origin, are anti-ejaculation.  None that I know of are opposed to *female* orgasm, which Daoists see as transferring the woman's life force to the male partner while he conserves his. (A very sexist approach!) Modern tantric practitioners do use extended arousal as a means to intensify orgasms, but we're typically talking about delaying an orgasm for 30-60 minutes, not days or weeks.  Karezza is the only modern, non-Daoist sexual practice I know of that advocates having sex completely without orgasm.", "CreationDate": "2015-08-02T06:34:40.050", "UserId": 228}
{"Id": 812, "PostId": 200, "Score": 0, "Text": "I'm unclear what your answer is. First you say you've experienced no effect, then say it can have an effect. What do you mean to say?  In any case, references would be highly encouraged.", "CreationDate": "2015-08-08T23:39:08.360", "UserId": 64}
{"Id": 469, "PostId": 201, "Score": 0, "Text": "I meant more along the lines of \"high intensity becoming uncomfortable\". I'll edit that, it is misleading.", "CreationDate": "2015-08-01T21:01:56.360", "UserId": 207}
{"Id": 478, "PostId": 201, "Score": 0, "Text": "Actually both sexes may also find it **displeasing**.", "CreationDate": "2015-08-02T06:44:34.290", "UserId": 146}
{"Id": 534, "PostId": 203, "Score": 0, "Text": "Excellent addition! Thank you", "CreationDate": "2015-08-03T16:04:38.957", "UserId": 82}
{"Id": 484, "PostId": 213, "Score": 0, "Text": "+1 for substantiated information.", "CreationDate": "2015-08-02T11:34:01.793", "UserId": 251}
{"Id": 485, "PostId": 213, "Score": 0, "Text": "I wonder if women in first-time strictly monogamous marriages with no earlier sexual experience or consummated marriages whatsoever would feel the same way about their husbands' penis size. I mean, it'd seem like they'd have no comparison!", "CreationDate": "2015-08-02T11:39:50.200", "UserId": 251}
{"Id": 486, "PostId": 213, "Score": 0, "Text": "I also wonder if sexual ethics evolved as a way to counter the age-old insecurities and vices that people have about themselves and how they treat each other. I mean, Augustine of Hippo used to spend time with men that talk about their sexual exploits. Perhaps, that might have influenced his view of sexuality and hope that sex would be viewed not as a conquest, but as an expression of self-sacrificing love and family.", "CreationDate": "2015-08-02T11:45:26.267", "UserId": 251}
{"Id": 490, "PostId": 217, "Score": 0, "Text": "\"It is known that,..\" - really? Known to whom? Who decided that you can set facts just like that? It's all just your own opinions and/or knowledge which might be wrong/limited.", "CreationDate": "2015-08-02T12:28:37.937", "UserId": 61}
{"Id": 509, "PostId": 227, "Score": 0, "Text": "Welcome to the Sexuality.SE! Your response here looks constructive, informative, and pertinent. However, as this website has more of an academic bent, it is best to add some authoritative references to support your answer. Thank you for your cooperation.", "CreationDate": "2015-08-03T02:57:42.063", "UserId": 251}
{"Id": 515, "PostId": 227, "Score": 0, "Text": "-1 for just taking existing content and pasting it as-is without proper attribution.", "CreationDate": "2015-08-03T05:59:01.347", "UserId": 61}
{"Id": 528, "PostId": 238, "Score": 1, "Text": "I totally agree: it's like trying to prove that nowadays people like more pizza than fries. \"Tastes\" don't get along with statistics", "CreationDate": "2015-08-03T13:32:28.050", "UserId": 146}
{"Id": 535, "PostId": 238, "Score": 0, "Text": "It really cannot be easily translated like that. LGBT is a very widely used term - worldwide, although used for subtly different things by different people, and mostly in English. Also, I think that since the OP clearly meant more recent history (change on his Youtube feed) that at least that part should be the main focus of a good answer.", "CreationDate": "2015-08-03T16:08:12.383", "UserId": 82}
{"Id": 538, "PostId": 238, "Score": 1, "Text": "@Spork: In the meantime I found out what LGBT stands for: It is the abbreviation for “***L**esbian, **G**ay, **B**isexual and **T**ransgender persons*”", "CreationDate": "2015-08-03T16:12:55.690", "UserId": 115}
{"Id": 530, "PostId": 240, "Score": 0, "Text": "Thanks for the advice (and the edit :)), appreciated. Should I also wrap it in a condom, like doing with a dildo? In the video I watched the guy did not wrap it with condom, and I wonder if that is feasible at all for the beads? Also, not sure if worth mentioning in the question (as in, might be \"too much details\") but my actual goal is reaching handsfree orgasm by that, the guy in the video did it and it just drove me crazy, lol.", "CreationDate": "2015-08-03T14:06:31.687", "UserId": 315}
{"Id": 612, "PostId": 240, "Score": 0, "Text": "I wouldn't wrap it in a condom and frankly I wouldn't do it even with other toys. There is also a chance (even if slight) that the condom may get stuck in your body. Its removal may sometimes require an ER trip. My advice is: YOUR toys must remain YOUR toys. If you are ever scared about bacteria remaining in the toy material, use (as stated in the answer below) medical-grade silicone and sanitize it. I do understand that you cannot do that every time, but if you wash the toy with hot water and a normal soap, most of the bacteria will go anyway. This is possible to be done before and after use", "CreationDate": "2015-08-04T07:35:32.020", "UserId": 146}
{"Id": 625, "PostId": 240, "Score": 0, "Text": "Thanks, will do it without wrapping the beads then. Re-thinking this, it's also quite silly due to the shape of the beads, condom will render them totally pointless.", "CreationDate": "2015-08-04T14:27:51.983", "UserId": 315}
{"Id": 537, "PostId": 242, "Score": 0, "Text": "Taking a quick look at the Shinohara study - http://chemse.oxfordjournals.org/content/25/4/465.full.pdf - it's not at all clear to me that there's enough data for this result to be significant.", "CreationDate": "2015-08-03T16:12:53.547", "UserId": 108}
{"Id": 540, "PostId": 242, "Score": 0, "Text": "Agreed, upvoted too. If none other better answers come,I'd accept this answer.", "CreationDate": "2015-08-03T16:14:24.013", "UserId": 13}
{"Id": 541, "PostId": 242, "Score": 1, "Text": "Yeah, I know. Which is why it is not conclusive evidence. It's just something on the horizon of \"more research needed\".", "CreationDate": "2015-08-03T16:14:27.007", "UserId": 207}
{"Id": 543, "PostId": 242, "Score": 0, "Text": "Perhaps, @Ohnana... Though if the overall gist of the conclusion of a study has been refuted by one with better methods, and the very specific claim is one that can be dismissed methodologically, such research likely isn't worth mentioning on a general Q&A site.", "CreationDate": "2015-08-03T16:22:45.700", "UserId": 108}
{"Id": 549, "PostId": 242, "Score": 0, "Text": "Also, downvoting for what I'm interpreting as a snarky comment in the end (\"Maybe they should try sniffing each other's armpits?\").  Removal of that will remove my downvote.  Saying more about the status of the Shinohara study as well could easily garner an upvote.", "CreationDate": "2015-08-03T16:38:36.523", "UserId": 108}
{"Id": 546, "PostId": 243, "Score": 0, "Text": "Good answer. Just some words about bacteria: Normal healthy people have much much more bacteria in their mouth than im their anus! And for a normal healthy person with a normal functioning immune system the bacteria from a healthy persons rectum are not dangerous. To keep your toys clean is always a good idea, but your argument would mean, that I had to boil my penis every time after I had anal sex with my wife before she could take it in her vagina or mouth. This is nonsense. Normal cleansing with water and shower gel is good enough for penis and toys.", "CreationDate": "2015-08-03T16:30:09.723", "UserId": 115}
{"Id": 547, "PostId": 243, "Score": 1, "Text": "I like to take the approach of \"least risk\" when giving advice.  And it's not the number of bacteria, it's the kind. E. coli likes to hang out in your lower Gi tract, and it's not something to fool around with.", "CreationDate": "2015-08-03T16:33:07.393", "UserId": 207}
{"Id": 550, "PostId": 243, "Score": 0, "Text": "True, but “Any toy you put in your butt is a butt toy forever” is a too harsh advice. And Escherichia coli in your guts (where they normally live) is not a higher health risk than in your mouth or vagina. There are serotypes of E. Coli that in fact are risky, but they don't live in healthy persons (neither in their rectum nor elsewhere).", "CreationDate": "2015-08-03T16:46:54.143", "UserId": 115}
{"Id": 626, "PostId": 243, "Score": 0, "Text": "Agree with @Hubert, but +1 for a good answer with excellent advice. Thanks!", "CreationDate": "2015-08-04T14:30:59.520", "UserId": 315}
{"Id": 631, "PostId": 243, "Score": 0, "Text": "+1 for \"... and then you will be sad\" (and the overall answer ;))", "CreationDate": "2015-08-04T15:56:39.490", "UserId": 82}
{"Id": 539, "PostId": 244, "Score": 0, "Text": "I don't like this answer as it it has got very confusing words like *an artificial way to create such synchronization...*, so I won't upvote.", "CreationDate": "2015-08-03T16:14:17.043", "UserId": 13}
{"Id": 542, "PostId": 244, "Score": 0, "Text": "Hmm. Is there a way I can clarify those words, then? Do you understand my meaning, and it just was confusing at first (in which case maybe you can help me find better phrasing), or do I need to explain it differently in order for it to be understood (in which case I'll take a stab on my own)?", "CreationDate": "2015-08-03T16:19:47.723", "UserId": 108}
{"Id": 544, "PostId": 244, "Score": 0, "Text": "@lindes-Sure, Yes, if you could provide a substantial proof that pills,etc. provide an artificial way of synchronisation. Also, this point that converging occurs at a point, that in my view should be called intersection. And, if possible proper reasoning of the words you've written here.", "CreationDate": "2015-08-03T16:23:00.143", "UserId": 13}
{"Id": 548, "PostId": 244, "Score": 0, "Text": "I've added some additional explanation to the last section.  Is that helpful?", "CreationDate": "2015-08-03T16:36:25.737", "UserId": 108}
{"Id": 551, "PostId": 244, "Score": 1, "Text": "@lindes- Yeah, the last paragraph with explanation looks much better and effective in gaining upvote too. :)", "CreationDate": "2015-08-03T16:57:03.957", "UserId": 13}
{"Id": 552, "PostId": 244, "Score": 0, "Text": "@ssuman: Cool, thank you for seeking clarification.  I'm glad I could provide it.  If there's anything else that you think this answer could still use to clarify things, please let me know!", "CreationDate": "2015-08-03T17:01:22.607", "UserId": 108}
{"Id": 610, "PostId": 244, "Score": 0, "Text": "I would suggest deleting the entire section about the pill or ring, since even McClintock's fans concede that hormonal birth control would eliminate whatever chemical cue is supposedly causing the synchronization.", "CreationDate": "2015-08-04T06:44:55.980", "UserId": 228}
{"Id": 621, "PostId": 244, "Score": 0, "Text": "It's certainly a completely different mechanism of synchronization than any hypothesized by McClintock et al. Still, it's such a certain way to synchronize that it seems to me to be important to include for completeness, given that the question as stated is merely about synchronization, without explicitly specifying a particular method of synchronization.", "CreationDate": "2015-08-04T13:34:59.953", "UserId": 108}
{"Id": 645, "PostId": 250, "Score": 0, "Text": "It's a myth that shaving produces thicker and harder hair. There are no sensors in a hair that might tell it's root that it was cut. The root doesn't “know” that the hair was shaved. When a new hair starts to grow, it starts as a thin and fine hair. So it's lace is very thin and smooth. But the longer it grows, the thicker it becomes. When you shave your hair, you cut off mainly old hair. So when it continues to grow afterwards, it grows as thick as it was before it was cut. But now the laces are not thin and smooth anymore. So you have *the feeling* that shaved hair is thicker. But it isn't.", "CreationDate": "2015-08-05T05:00:40.177", "UserId": 115}
{"Id": 647, "PostId": 250, "Score": 0, "Text": "@HubertSchölnast That is why I mentioned that there are no studies that confirm this, However in personal experience it does cause discomfort, especially in the pubic region", "CreationDate": "2015-08-05T05:35:30.673", "UserId": 211}
{"Id": 559, "PostId": 251, "Score": 0, "Text": "That's a really nice answer! +1 :)", "CreationDate": "2015-08-03T17:42:23.340", "UserId": 73}
{"Id": 562, "PostId": 251, "Score": 0, "Text": "Thanks.  Here's hoping that many of the questions and answers on this site can achieve a high bar of quality, on various fronts!  I'm happy to contribute towards that end.", "CreationDate": "2015-08-03T18:01:38.517", "UserId": 108}
{"Id": 563, "PostId": 251, "Score": 0, "Text": "I'm also honored to be one of the first to post here. It's such an important topic that makes me wonder why it's beta now and not years ago.", "CreationDate": "2015-08-03T18:02:36.077", "UserId": 73}
{"Id": 566, "PostId": 251, "Score": 0, "Text": "The reasons for that are many... You might get some insights from [this question](http://discuss.area51.stackexchange.com/questions/20717/would-it-benefit-both-sites-to-just-merge-this-with-health) on the Area 51 site.", "CreationDate": "2015-08-03T18:24:07.040", "UserId": 108}
{"Id": 567, "PostId": 251, "Score": 1, "Text": "I'm agains merging those. The only topic that apples for both is sexual health, which in my opinion belongs here. Otherwise those are two completely unrealted topics.", "CreationDate": "2015-08-03T18:25:31.783", "UserId": 73}
{"Id": 568, "PostId": 251, "Score": 0, "Text": "You'll notice that it's me that answered with reasons not to merge.  I quite agree with you.  That said, the fact that the question was even asked is one part of why it didn't happen years ago.  Another is the high likelihood for attracting attention of people who are taking the topic less seriously than the level of quality that StackExchange strives for.  Which unfortunately is a real concern.  But I think we can beat it!", "CreationDate": "2015-08-03T18:29:18.720", "UserId": 108}
{"Id": 607, "PostId": 251, "Score": 0, "Text": "\"it's possible to have \"genital herpes\" that's HSV-1... That said, these are comparatively rare, relative to ... genital HSV-2.\"  That info is out of date.  HSV-1 is NOT rare compared to HSV-2 in the anogenital region.  In the U.S., at least, it is rapidly approaching 50% of all genital herpes infections if it hasn't already reached that point.  See the links in my answer.", "CreationDate": "2015-08-04T04:48:41.393", "UserId": 228}
{"Id": 620, "PostId": 251, "Score": 0, "Text": "@Shakti - thank you for the critical feedback! I've looked at some of your sources, and indeed corrected my perception a bit. Genital HSV-1 seems less rare than I thought. That said, my statement that it's \"comparatively rare\" is still accurate according to your sources. Also, the Peña et al says \"HSV-2 causes symptomatic genital recurrences at a much higher frequency than HSV-1\", which strikes me as clinically significant. I'll consider how I can improve my answer, though. Again, thanks!", "CreationDate": "2015-08-04T13:27:07.773", "UserId": 108}
{"Id": 623, "PostId": 251, "Score": 0, "Text": "Oh, and... the numbers that I believe your \"50%\" came from (I presume you're referring to Peña et al there) show that it's approximately 50% *as common* to have genital herpes come from HSV-1, by accounting for a little under one third of genital herpes cases (32% HSV-1 versus 68% HSV-2). This is *not* the same as accounting for \"50% of all genital herpes infections\".", "CreationDate": "2015-08-04T13:58:21.423", "UserId": 108}
{"Id": 640, "PostId": 251, "Score": 1, "Text": "Actually, I was referring to an upcoming publication that finds that in the U.S. sample of 18-28 year olds they looked at 48% of genital herpes sufferers had SV-1 and 61% had SV-2.  (This was also the source used for the UMd website I quoted.) So, yes, if that pattern is typical, it would be more precise to say that genital SV-2 is more common, but genital SV-1 definitely isn't \"rare.\"", "CreationDate": "2015-08-04T20:17:43.843", "UserId": 228}
{"Id": 641, "PostId": 251, "Score": 1, "Text": "To complicate things even further, if you have SV-1 or SV-2 antibodies in your blood, but you have no lesions, there's no way a doctor or lab can tell the location of the infection.  In the case of SV-1, these are arbitrarily assumed to be oral, but some unknown percentage of them are actually genital.  So SV-1 genital cases are probably undercounted. (SV-2 oral cases are undercounted for the same reason.)", "CreationDate": "2015-08-04T20:22:36.523", "UserId": 228}
{"Id": 666, "PostId": 251, "Score": 0, "Text": "I've done an edit to hopefully make this at least better.  It may still benefit from further work in the future, though I see the question has been closed as a duplicate?  So... we'll see.", "CreationDate": "2015-08-05T18:40:30.270", "UserId": 108}
{"Id": 569, "PostId": 252, "Score": 0, "Text": "Well, I didn't know you were a trained sex-educator. I request you to pull out a few of your colleagues over here to make this community working functional for a long time. And, your answers have improved over the time to be stated as awesome! Good answer...  +1.", "CreationDate": "2015-08-03T18:36:53.393", "UserId": 13}
{"Id": 618, "PostId": 255, "Score": 0, "Text": "Hmm, the Bartlik interview raises questions for me, as she's trying to sell a product (the same product as in the patent?? I'm not sure). This doesn't make her wrong, but I do wish that source was more independent.", "CreationDate": "2015-08-04T12:58:25.947", "UserId": 108}
{"Id": 622, "PostId": 255, "Score": 0, "Text": "Also, without a larger disclaimer, I'm worried that the patent citation is problematic by having a strong potential to be misleading. Even that patent application says \"While certain ingredients have previously been believed in “urban-myth” fashion to improve semen taste, there has never been a precedent for any formulation developed or marketed for this purpose.\" They go on to state that they did a year of research, giving no specifics. It could have been one guy in his kitchen, for all we know. I'm going to downvote this in its current form. I'm happy to reconsider upon editing.", "CreationDate": "2015-08-04T13:46:05.597", "UserId": 108}
{"Id": 628, "PostId": 255, "Score": 0, "Text": "@lindes I didn't find any ties to suggest she was involved with the patent claim, why did you assume so? I'd definitely scratch that if it were to be the case. I've also revised the patent thing - I agree it doesn't have enough evidence to support it (of course).", "CreationDate": "2015-08-04T15:12:55.093", "UserId": 82}
{"Id": 644, "PostId": 255, "Score": 0, "Text": "This is a much better reporting of the patent claim; thank you for that! And I didn't mean to imply anything more than wondering as to whether the Bartlik product was the same as the patent. The fact remains, though, that Bartlik is pushing a product. This raises questions for me.", "CreationDate": "2015-08-05T01:02:07.333", "UserId": 108}
{"Id": 593, "PostId": 258, "Score": 1, "Text": "Whilst there is certainly some interesting information here, it's hidden under a lot of opinion and -to be honest- I was only interested in the stuff from the female's perspective. As I mentioned in the question I'm aware of a lot of the arguments pro/against circumcision and aren't looking for an answer that focuses almost solely on the debaters, rather than the debate.", "CreationDate": "2015-08-04T00:35:50.163", "UserId": 124}
{"Id": 599, "PostId": 258, "Score": 0, "Text": "Yeah, but we got junk science in that report quoted by Vixen, so i'm trying to document why it isn't trustworthy.  Did you just want an opinion poll?  Because, as I tried to make clear, you won't get honest answers.  The anti-circumcision people monitor the web and they will come here and tell you that sex feels better with intact penises.  However, if it makes you happy I'll edit my answer to add my personal opinion.", "CreationDate": "2015-08-04T02:01:29.060", "UserId": 228}
{"Id": 613, "PostId": 260, "Score": 0, "Text": "If you also exclude the fact that semen is a vector of illnesses, I would agree to the last sentense of this answer", "CreationDate": "2015-08-04T07:39:02.677", "UserId": 146}
{"Id": 629, "PostId": 260, "Score": 0, "Text": "@Noldor130884 what would be the reason for negative health effects? It's hard to claim benefit (or neutrality) if that effect is present", "CreationDate": "2015-08-04T15:36:48.977", "UserId": 82}
{"Id": 633, "PostId": 260, "Score": 0, "Text": "As mentioned previously, a notable negative effect would be the transmission of STIs. Open sores are often present in the mouth which makes it easier for bacteria and viruses to spread.", "CreationDate": "2015-08-04T16:03:55.200", "UserId": 324}
{"Id": 615, "PostId": 274, "Score": 0, "Text": "This appears to be the best with proper reasoning and criticism too of the papers. And, your practical view is also worth mentioning here. Accepting your answer.", "CreationDate": "2015-08-04T08:03:14.950", "UserId": 13}
{"Id": 634, "PostId": 275, "Score": 0, "Text": "Excellent answer.  However, on the last point, don't you agree that the evidence you have collected suggests that the physiological response in females is roughly constant throughout their lives, and that what prepubescent males experience is more in line the experience of females than of mature males?", "CreationDate": "2015-08-04T16:26:26.077", "UserId": 102}
{"Id": 636, "PostId": 275, "Score": 1, "Text": "@Lysander - Yes, absolutely.  There's no way to prove it, but it appears that the physiology of the female orgasm is the standard for *both* sexes until boys hit semenarche.  Furthermore, a grown man who still has, or has relearned, the ability to have orgasms without ejaculation appears to have an orgasm that (as far as I can tell) is very similar to a normal female orgasm.", "CreationDate": "2015-08-04T18:40:36.933", "UserId": 228}
{"Id": 624, "PostId": 280, "Score": 0, "Text": "Oh wow. I didn't think 'Doggy-style was even close to the official word at all. Although I'm really digging the Latin version: ***Coitus more ferarum***, or *\"sexual intercourse in the manner of wild beasts\"*. Sounds a lot more exciting when put like that haha.", "CreationDate": "2015-08-04T14:09:03.383", "UserId": 124}
{"Id": 627, "PostId": 280, "Score": 0, "Text": "Indeed! Makes it sound a lot more exotic.", "CreationDate": "2015-08-04T14:36:56.867", "UserId": 324}
{"Id": 650, "PostId": 280, "Score": 0, "Text": "Please do not link to sites that are made for mobile devices only (like “en.m.wikipedia.org”). Please delete the **m.** from the URI to make that it “en.wikipedia.org”. When you do this, mobile devices still will be redirected to the mobile version, but now widescreen devices get the version that is made for them. When you leave the **m.** in the URI, all devices (also desktops) get the mobile version, what looks weird on a 27\"-screen.", "CreationDate": "2015-08-05T10:19:10.423", "UserId": 115}
{"Id": 719, "PostId": 280, "Score": 1, "Text": "@HubertSchölnast - you could edit out the '.m' in the link to make it link to the full site if you wish?", "CreationDate": "2015-08-06T16:23:28.263", "UserId": 124}
{"Id": 720, "PostId": 280, "Score": 0, "Text": "@HubertSchölnast Oh yes I hadn't noticed as I am writing from my phone. Feel free to edit it if you please.", "CreationDate": "2015-08-06T16:30:22.460", "UserId": 324}
{"Id": 765, "PostId": 280, "Score": 1, "Text": "@Robotnik & simon's.donut: When I tried to edit, I got the error-message, that I had to edit at least 6 characters. Deleting just two characters is not allowed. But, simon's.donut, you did post this answer. You could do it. (I can't.)", "CreationDate": "2015-08-07T11:52:47.357", "UserId": 115}
{"Id": 886, "PostId": 280, "Score": 1, "Text": "@HubertSchölnast - I suggested an edit which adds the Latin translation as well as removes the '.m' from the link. With any luck it'll go through :)", "CreationDate": "2015-08-10T15:10:24.553", "UserId": 124}
{"Id": 632, "PostId": 282, "Score": 0, "Text": "I got my SSRI switched for an SNRI (Bupropion). Let's see how this will work...", "CreationDate": "2015-08-04T15:58:45.967", "UserId": 73}
{"Id": 637, "PostId": 283, "Score": 1, "Text": "Thank you!! That's a great article - I don't know how I missed it, or Blair's research, because they both apply directly to what I do.  I spend a lot of time teaching straight couples \"tantric sex\": 2-4 hour extended sessions with lots of sensuality and very intense orgasms.  Judging from what Blair and Nichols are saying, that's basically what a lot of gay women have discovered for themselves.  Which is really cool! :) *** FYI, this is what inspired my question: http://moderntantra.blogspot.com/2015/01/mailbag-5-tantra-for-women-and-fc2-for.html.", "CreationDate": "2015-08-04T19:04:56.300", "UserId": 228}
{"Id": 635, "PostId": 284, "Score": 1, "Text": "Best answer so far!", "CreationDate": "2015-08-04T16:50:11.993", "UserId": 33}
{"Id": 643, "PostId": 284, "Score": 0, "Text": "It would be much better if it could cite sources for the various \"fact\" claims. Withholding a vote for now.", "CreationDate": "2015-08-05T00:58:13.650", "UserId": 108}
{"Id": 646, "PostId": 284, "Score": 0, "Text": "@lindes: I've asked a meta-question about this topic, but there are no answers and no comments until now: http://meta.sexuality.stackexchange.com/questions/77/is-posting-links-to-recourses-mandatory", "CreationDate": "2015-08-05T05:17:59.733", "UserId": 115}
{"Id": 651, "PostId": 287, "Score": 0, "Text": "You assume one would remove the condom and put it back on at a later point in time. The way I read the question, it is more likely someone would consider continuing intercourse after ejaculating without taking the condom off at all.", "CreationDate": "2015-08-05T16:09:03.163", "UserId": 179}
{"Id": 659, "PostId": 287, "Score": 0, "Text": "@Shae is partly correct. I am talking about a case where the condom is not removed from the penis, though the penis might go flaccid before the \"second round\".", "CreationDate": "2015-08-05T17:12:54.317", "UserId": 61}
{"Id": 667, "PostId": 287, "Score": 0, "Text": "@ShadowWizard - In my experience, a flaccid penis doesn't stay in the condom, and it would be uncomfortable to try.  Cold wet sticky things aren't pleasant.", "CreationDate": "2015-08-05T18:41:32.057", "UserId": 98}
{"Id": 668, "PostId": 287, "Score": 0, "Text": "@Bat it can stay for a short while with a hand and don't know about you, but the amount I have isn't enough to really give any feeling - it's just a small amount in the tip of the condom. :)", "CreationDate": "2015-08-05T18:52:26.533", "UserId": 61}
{"Id": 669, "PostId": 287, "Score": 0, "Text": "@ShadowWizard - A short while isn't enough for me to reload.", "CreationDate": "2015-08-05T19:00:51.277", "UserId": 98}
{"Id": 775, "PostId": 287, "Score": 0, "Text": "#4 really says it all. They're like car tires... Limited mileage. You don't want to risk a blowout so you replace your tires regularly. Condoms are no different. I had a break once when I was younger... We'd been on the same condom for well over thirty minutes, drunk, and the friction tore it to shreds. I might yet have a child I know nothing about...", "CreationDate": "2015-08-07T18:09:43.207", "UserId": 253}
{"Id": 652, "PostId": 289, "Score": 0, "Text": "You shouldn't leave \"empty space\". It is best to pinch the end to give room for the seminal fluids without stretching the condom. There should be as little air/space possible inside the condom after it is applied.", "CreationDate": "2015-08-05T16:12:50.420", "UserId": 122}
{"Id": 653, "PostId": 289, "Score": 0, "Text": "This is what I meant. I will modify the text.", "CreationDate": "2015-08-05T16:13:25.573", "UserId": 324}
{"Id": 660, "PostId": 290, "Score": 0, "Text": "Thanks, good advice that makes sense.", "CreationDate": "2015-08-05T17:15:44.847", "UserId": 61}
{"Id": 670, "PostId": 295, "Score": 2, "Text": "Not to forget: “trans“ is a latin word and means “on the other side” (of a river for example, seen from the speakers point of view). It's opposite is “cis” which means “on this side”. So “*trans*port” means to carry (*port*are) something to the other side (of whatever). And the “*Trans*america Airlines” was flying from one side of America to the other side.", "CreationDate": "2015-08-05T19:18:57.247", "UserId": 115}
{"Id": 672, "PostId": 295, "Score": 0, "Text": "In my experience, \"Transgender\" is usually more of a blanket term to encompasses all of the above. Similar to your entry of \"trans*\"", "CreationDate": "2015-08-05T19:54:25.500", "UserId": 122}
{"Id": 690, "PostId": 295, "Score": 0, "Text": "@Shakti - you did an edit to pull transvestite out from above trans* - why? You say it's not usually included in that; do you have a reference for such? Because it's listed in the page I link to for trans*...", "CreationDate": "2015-08-06T04:27:10.260", "UserId": 108}
{"Id": 699, "PostId": 295, "Score": 0, "Text": "@lindes - In my experience, cross-dressers and drag queens are treated like outcasts by most of the trans* community, and transsexuals almost never include otherwise cisnormal transvestites in the term \"trans*.\" A quick google check mostly confirms this. But I was surprised that that edit went through - I intended it more as a suggestion and assumed that the author would have a chance to review and approve or revert it.  If other people disagree on usage, or have different experience, I'm definitely okay with changing it back.", "CreationDate": "2015-08-06T05:52:59.557", "UserId": 228}
{"Id": 700, "PostId": 295, "Score": 0, "Text": "@lindes - Sample comment from the first blog I hit after googling this:  \"I’m going to put both transvestite and cross-dresser together for simplicity. ... Cross-dressers don’t associate with the LGBTQ community and don’t see themselves as anything but straight/heterosexual.\" That was written by a transwoman on  http://www.askthegay.com/2010/10/what%E2%80%99s-the-difference-between-transsexual-transgender-transvestite-and-cross-dresser/", "CreationDate": "2015-08-06T05:56:48.350", "UserId": 228}
{"Id": 694, "PostId": 304, "Score": 0, "Text": "Ok - the idea of a bland breakfast \"impeding libido\" is amazing and total unexpected. Great list here.", "CreationDate": "2015-08-06T04:47:25.477", "UserId": 339}
{"Id": 703, "PostId": 308, "Score": 0, "Text": "So much speculation... I'm considering downvoting, though I'll likely just vote to close the question, instead.", "CreationDate": "2015-08-06T07:19:41.073", "UserId": 108}
{"Id": 706, "PostId": 308, "Score": 0, "Text": "Note: there's theoretically-useful stuff mixed in, two. I commend you for giving it a shot, I just... :-/", "CreationDate": "2015-08-06T07:29:46.207", "UserId": 108}
{"Id": 711, "PostId": 308, "Score": 1, "Text": "@lindes: Yes, I explicitly wrote “*this is what those emperors **might** have done*” and “*‘Thousand’ **can** just mean ‘very much’*”. Non of us was there and witnessed what the emperors did and how they did it. So you hardly will find anybody who can say anything to this question that can be proofed. Even when you find experts of Chinese history, you will only hear speculation. But I substantiated my speculations with facts that everybody can easily proof, and a little bit of very basic mathematics.", "CreationDate": "2015-08-06T08:25:58.250", "UserId": 115}
{"Id": 716, "PostId": 311, "Score": 0, "Text": "Holy wall of text Batman :0. But thanks for the in-depth answer :)", "CreationDate": "2015-08-06T15:56:44.620", "UserId": 124}
{"Id": 717, "PostId": 311, "Score": 2, "Text": "@Robotnik I was still working on it.", "CreationDate": "2015-08-06T16:01:24.930", "UserId": 98}
{"Id": 718, "PostId": 311, "Score": 0, "Text": "All good :), that's a lot more condensed :)", "CreationDate": "2015-08-06T16:06:39.260", "UserId": 124}
{"Id": 721, "PostId": 312, "Score": 1, "Text": "I was about to downvote when I noticed the almost hidden conclusion. The focus of the answer is on what appears to be something different than what was being asked. Can you please re-arrange the answer, giving more focus to the conclusion? (e.g. starting with it, then expanding as for the \"why\")", "CreationDate": "2015-08-06T18:01:21.350", "UserId": 61}
{"Id": 725, "PostId": 312, "Score": 0, "Text": "@ShadowWizard how about now?", "CreationDate": "2015-08-06T18:50:50.863", "UserId": 251}
{"Id": 726, "PostId": 312, "Score": 0, "Text": "Yes, better. Thanks!", "CreationDate": "2015-08-06T18:57:36.893", "UserId": 61}
{"Id": 760, "PostId": 320, "Score": 0, "Text": "How does one know that the condom has touched the cervix?", "CreationDate": "2015-08-07T01:46:26.093", "UserId": 251}
{"Id": 761, "PostId": 320, "Score": 0, "Text": "The video mentions something differently for anal. It recommends taking out the inner ring. Why.... I don't know.", "CreationDate": "2015-08-07T01:47:49.417", "UserId": 251}
{"Id": 762, "PostId": 320, "Score": 0, "Text": "It probably recommends it for comfort. Personally, I wouldn't disassemble a condom! Also you know when the condom is at the cervix when it can't go in anymore.", "CreationDate": "2015-08-07T01:54:45.327", "UserId": 207}
{"Id": 764, "PostId": 320, "Score": 0, "Text": "@Double U - I've done it both ways on anal.  It definitely takes some practice to insert the inner ring, but it is much easier to *keep* it in place during sex.  I understand why some writers tell people to remove the ring because they don't want first-timers to just give up on it.  But in the long run it's really worth it to keep both rings in place.", "CreationDate": "2015-08-07T05:34:21.440", "UserId": 228}
{"Id": 751, "PostId": 321, "Score": 1, "Text": "How does one know the correct orientation?", "CreationDate": "2015-08-07T01:01:32.440", "UserId": 251}
{"Id": 752, "PostId": 321, "Score": 0, "Text": "I have pictures in the directions to demonstrate visually. The main way to tell is \"Is this unrolling easily?\" If it isn't, you've done it backwards.", "CreationDate": "2015-08-07T01:02:48.293", "UserId": 207}
{"Id": 754, "PostId": 321, "Score": 0, "Text": "Thought I did. Is that more clear?", "CreationDate": "2015-08-07T01:05:12.440", "UserId": 207}
{"Id": 755, "PostId": 321, "Score": 0, "Text": "Clear. That's good.", "CreationDate": "2015-08-07T01:06:01.980", "UserId": 251}
{"Id": 756, "PostId": 321, "Score": 0, "Text": "What happens if the penis does not immediately withdraw from partner? Can the penis remain in the orifice for some time, or must the penis immediately withdraw?", "CreationDate": "2015-08-07T01:09:21.587", "UserId": 251}
{"Id": 757, "PostId": 321, "Score": 0, "Text": "\"Immediately after ejaculating, withdraw from your partner, grasping the base of the condom.\" I will say what happens though.", "CreationDate": "2015-08-07T01:10:17.087", "UserId": 207}
{"Id": 758, "PostId": 321, "Score": 0, "Text": "Can the condom be used as sperm collection?", "CreationDate": "2015-08-07T01:12:52.877", "UserId": 251}
{"Id": 759, "PostId": 321, "Score": 0, "Text": "Let us [continue this discussion in chat](http://chat.stackexchange.com/rooms/26683/discussion-between-ohnana-and-double-u).", "CreationDate": "2015-08-07T01:13:30.700", "UserId": 207}
{"Id": 766, "PostId": 321, "Score": 0, "Text": "@DoubleU what do you mean \"sperm collection\"?", "CreationDate": "2015-08-07T13:56:41.663", "UserId": 61}
{"Id": 767, "PostId": 321, "Score": 0, "Text": "\"If you touch one side of the condom to your penis and then use that side to penetrate your partner, you've defeated the purpose of the condom\" -- this is only true if the purpose of the condom is fluid isolation. If used as birth control, it shouldn't affect anything (unless you have recently ejaculated, and thus have semen on the tip of your penis).", "CreationDate": "2015-08-07T13:59:45.913", "UserId": 64}
{"Id": 770, "PostId": 321, "Score": 0, "Text": "@ShadowWizard I mean, collecting sperm by condom for fertility clinics.", "CreationDate": "2015-08-07T14:27:16.150", "UserId": 251}
{"Id": 772, "PostId": 321, "Score": 0, "Text": "@DoubleU well it is not meant for such usage, guess it's no better than using a glass (cup) for that purpose. :)", "CreationDate": "2015-08-07T15:27:31.433", "UserId": 61}
{"Id": 777, "PostId": 325, "Score": 1, "Text": "Can't impotence also refer to a man who has normal erectile and ejaculatory function, but who is incapable of getting his partner pregnant (due to low sperm motility, or something similar)?  Or have I been misunderstanding that term all these years?", "CreationDate": "2015-08-07T20:39:32.123", "UserId": 62}
{"Id": 781, "PostId": 325, "Score": 0, "Text": "@Nerrolken: That's exactly what *I* thought impotence was, and that ED was a separate (although perhaps sometimes coexisting) conditoin.", "CreationDate": "2015-08-07T21:02:35.263", "UserId": 64}
{"Id": 782, "PostId": 325, "Score": 0, "Text": "Impotence in sex is a chronic lack of erection, sterility is the inability to sire offspring. You can be sterile and not impotent, but impotence implies sterility (because you can't naturally produce offspring). Rarely, impotence might be meant as sterility, but I'm pretty sure that's only local dialect. If it's the male's fault... Sterile. If it's the female's fault... Barren or infertile.", "CreationDate": "2015-08-07T21:03:31.480", "UserId": 253}
{"Id": 783, "PostId": 325, "Score": 0, "Text": "@Flimzy Thank you!  I'm glad to know I wasn't alone.  Hahaha.  Anyway, I just posted a secondary answer to this question with some interesting etymological support for the idea that impotence and ED are one and the same.", "CreationDate": "2015-08-07T21:09:35.557", "UserId": 62}
{"Id": 784, "PostId": 332, "Score": 0, "Text": "Could you please add a reference for the etymology?", "CreationDate": "2015-08-07T23:12:22.350", "UserId": 345}
{"Id": 808, "PostId": 332, "Score": 0, "Text": "@Sparkler  I already did: I got it from the Wikipedia article I linked to.", "CreationDate": "2015-08-08T22:09:08.003", "UserId": 62}
{"Id": 904, "PostId": 337, "Score": 0, "Text": "This is an excellent answer.  Thanks!", "CreationDate": "2015-08-10T22:59:50.773", "UserId": 62}
{"Id": 793, "PostId": 342, "Score": 0, "Text": "Some sources would make this good answer so much better.", "CreationDate": "2015-08-08T16:04:01.540", "UserId": 64}
{"Id": 800, "PostId": 342, "Score": 2, "Text": "@flimzy - Your wish is my command!  ^__^", "CreationDate": "2015-08-08T19:02:21.417", "UserId": 228}
{"Id": 802, "PostId": 343, "Score": 0, "Text": "Thanks, that's what I was kind of expecting to find. Wonder if those drawings can be considered NSFW... :)", "CreationDate": "2015-08-08T19:05:04.590", "UserId": 61}
{"Id": 810, "PostId": 344, "Score": 0, "Text": "This answer needs a lot of references to be added.", "CreationDate": "2015-08-08T23:36:39.430", "UserId": 64}
{"Id": 818, "PostId": 351, "Score": 0, "Text": "Sorry but -1 for answering a totally different question. We are not here to judge, we are here to give concrete answers.", "CreationDate": "2015-08-09T07:19:02.963", "UserId": 61}
{"Id": 837, "PostId": 351, "Score": 1, "Text": "@ShadowWizard - I *did* answer the question. It's not safe, and I gave the reasons why, with citations. But the question also contained outrageously false assertions that call for a forceful response. If it is your intention to create a site that is perceived as sexist and hostile to women, questions like this will definitely get you there. There needs to be a mechanism for filtering out questions that contain false assertions or blatant propaganda. If you downvote answers that call out hostile, biased, and false assertions in questions, you will end up creating a website for misogynists only.", "CreationDate": "2015-08-09T17:45:40.457", "UserId": 228}
{"Id": 839, "PostId": 351, "Score": 0, "Text": "I don't support such thing at all, but can't see how you think this question contains \"outrageously false assertions\". The question is dry, factual, and to the point. No assertions, neither false nor true. If we will block questions just because we don't like the idea behind them, we can also ban anything that just dares to mention rape, for example. And many more. But this site should be open for everyone \"from a frank and clinical point of view\", as written in the description of the site. Not \"judgemental point of view\".", "CreationDate": "2015-08-09T17:55:01.377", "UserId": 61}
{"Id": 841, "PostId": 351, "Score": 3, "Text": "@ShadowWizard - **\"Assume that the woman will, within moments of penetration, reach full lubrication.\"** Do you think a penis is a magic wand? That a woman experiencing pain from underlubed intercourse is instantly going to be turned on by its touch? **This is the sort of idiotic statement that is used to justify forcing painful intercourse on women.**  It is ignorant, misogynistic, and false.", "CreationDate": "2015-08-09T18:01:40.340", "UserId": 228}
{"Id": 843, "PostId": 351, "Score": 0, "Text": "Have it your way. You can also choose to be offended from tomatoes, But really, can't see how you twist a dry question into such a terrible thing.", "CreationDate": "2015-08-09T18:03:05.000", "UserId": 61}
{"Id": 876, "PostId": 360, "Score": 0, "Text": "@DoubleU: If you'd like to discuss this answer (or any of my other concerns), I invite you to [chat](http://chat.stackexchange.com/rooms/26353/sexuality).  I'll be there a while.", "CreationDate": "2015-08-10T01:03:26.243", "UserId": 64}
{"Id": 877, "PostId": 360, "Score": 0, "Text": "No, but the revivals and awakenings may add more supportive evidence. :-) That's the only relevance I can think of.", "CreationDate": "2015-08-10T01:08:08.803", "UserId": 251}
{"Id": 880, "PostId": 360, "Score": 0, "Text": "Just trying to help.", "CreationDate": "2015-08-10T01:22:12.993", "UserId": 251}
{"Id": 881, "PostId": 360, "Score": 2, "Text": "Sorry but this is way too over-simpified (admittedly, the question was so board as to practically invite oversimplification). There's no analysis of public vs. private sexuality differences in different religious strains; no attempt to test your hypothesis - e.g. by comparing catholic-heavy states vs. protestant ones; no mention of specific view of effects of sexuality **on minors** (which is where much of the issues touched on in the question actually arise from). And the claims of religion's influence aren't remotely looking at the fact that many European states have official state religion.", "CreationDate": "2015-08-10T03:42:47.480", "UserId": 357}
{"Id": 927, "PostId": 360, "Score": 0, "Text": "I didn't know, that religion plays such an important role in a modern western country like USA.", "CreationDate": "2015-08-11T18:57:53.477", "UserId": 115}
{"Id": 928, "PostId": 360, "Score": 0, "Text": "@HubertSchölnast: Many people are non-religious (or \"post-religious\"?) but the legacy of religious influence is still strong.", "CreationDate": "2015-08-11T19:07:16.577", "UserId": 64}
{"Id": 882, "PostId": 361, "Score": 1, "Text": "\"the common attempts to classify orgasms based on the anatomical location of the stimulus (clitoris, vagina, anus, nipples, \"core\" muscles, etc.) or the thing providing the stimulus (fingers, tongue, penis, vibrator, etc.) seem destined to fail\" - This one seems to contradict my answer, which mentions the difference between vaginal orgasm and clitoral orgasm as well as sex orgasm and masturbation orgasm.", "CreationDate": "2015-08-10T11:34:11.437", "UserId": 251}
{"Id": 890, "PostId": 361, "Score": 0, "Text": "Correct, for reasons explained in the text: pick any \"type\" of orgasm you like, and one woman's experience from that site and source will a) vary greatly from time to time, b) vary greatly due to external circumstances, and c) differ greatly from the experiences of other women.  In short, I think your sources are B.S. and the \"mainstream scholarly view\" is correct: the underlying mechanism is the same regardless of where the stimulation is coming from.  *How the orgasm is experienced* depends entirely on circumstances and mindset, not the origin of the stimuli.", "CreationDate": "2015-08-10T17:37:24.657", "UserId": 228}
{"Id": 891, "PostId": 361, "Score": 0, "Text": "Your explanation right there is actually my intuitive guess in the comments, before I searched in Ebscohost and proposed otherwise. I am neither accepting nor rejecting the views proposed, but I'm staying open to the possibility that there may be more than one type of female orgasm. Maybe future research in this area would provide a more comprehensive answer.", "CreationDate": "2015-08-10T17:51:23.463", "UserId": 251}
{"Id": 892, "PostId": 361, "Score": 0, "Text": "Actually, rereading King, et al., it is essentially a confirmation of the mainstream view.  Their typology has nothing to do with the location and source of the stimulus; instead it is essentially a 4-point ranking system for the perceived *quality* of the experience, and what they say about the correlations fits what I said in my answer: the subjective experience of an orgasm varies widely regardless of source.", "CreationDate": "2015-08-10T18:03:56.930", "UserId": 228}
{"Id": 893, "PostId": 361, "Score": 1, "Text": "I think there is a semantic issue that needs to be addressed first. I don't think we are using the same meaning for \"type\". I am going to change my answer to reflect this and to add a new source.", "CreationDate": "2015-08-10T18:58:34.183", "UserId": 251}
{"Id": 895, "PostId": 361, "Score": 1, "Text": "I don't think what a woman experiences during orgasm is sufficient to determine whether there are or are not different types of orgasm. Many diseases produce the same symptoms, but nobody in their right mind would claim that Ebola and alcohol poisoning are the same disease, just because some people vomit as a result of both.", "CreationDate": "2015-08-10T20:34:01.217", "UserId": 64}
{"Id": 898, "PostId": 361, "Score": 0, "Text": "Exactly. A rereading of the King, et al., article actually supports my view that there is definitely more than one type of orgasms. King, et al., categorizes the orgasms into 4. They use a 4-point ranking system, yes, but then they categorize the subjective responses into the different types of orgasms, thereby supporting the view that there may be different types of orgasms. I also added a different study to my response, which definitely confirms the view that VAO is different from CO, and this can be observed in spinal cord injury patients who lost the CO but not the VAO.", "CreationDate": "2015-08-10T21:42:56.740", "UserId": 251}
{"Id": 900, "PostId": 361, "Score": 0, "Text": "@Double U - No, it does not.  The four degrees of enjoyability they talk about do not come from separate parts of the body or distinct kinds of stimulation.  A tongue on a clit can produce a level one or a level four orgasm, depending entirely on the woman, the context, and the nature of the relationship.  The confusion comes because they use the word \"type\" for arbitrary quality levels.  Note that their data would have supported two \"types\" or eight \"types\" just as well as four.  These are arbitrary divisions on a continuous scale, not \"types\" as used in the rest of the literature.", "CreationDate": "2015-08-10T22:27:04.227", "UserId": 228}
{"Id": 901, "PostId": 361, "Score": 0, "Text": "Yes, these seem like arbitrary levels, but the fact that Types I and II are different from Types III and IV may suggest that there may be something unique going on. In other words, the first two types (good-sex orgasms) may have an evolutionary function, the other two less so.", "CreationDate": "2015-08-10T22:33:43.673", "UserId": 251}
{"Id": 905, "PostId": 361, "Score": 0, "Text": "@Double U - Re King et al.: Good orgasms are perceived as better than bad orgasms - a meaningless tautology.  Good & bad can both come from any kind of sex, so we haven't learned anything useful about what makes them good or bad, except that good orgasms are strongly associated with high levels of emotional connection and bad ones aren't.  (Well, duh!)  The most interesting point about the study is that solo orgasms rank right in the middle on almost all subscales - not as good as good or great partnered sex but a lot better than bad sex, even bad partnered sex with an orgasm.", "CreationDate": "2015-08-10T23:09:13.213", "UserId": 228}
{"Id": 906, "PostId": 361, "Score": 0, "Text": "But that is NOT what Flimzy's question is about.  When he says \"type\" he makes it clear that he is talking about vaginal vs manual vs oral vs anal vs whatever.  And King et al. say exactly ZIP about  which of those are better and for whom, or how they might differ.  This is not just semantics.  Talking about King in this context is mixing apples and horseapples.", "CreationDate": "2015-08-10T23:11:08.403", "UserId": 228}
{"Id": 910, "PostId": 361, "Score": 0, "Text": "My other source is better and still contradicts your contention.", "CreationDate": "2015-08-11T00:17:01.820", "UserId": 251}
{"Id": 911, "PostId": 361, "Score": 0, "Text": "Let us [continue this discussion in chat](http://chat.stackexchange.com/rooms/26820/discussion-between-double-u-and-shakti-amarantha).", "CreationDate": "2015-08-11T00:54:53.963", "UserId": 251}
{"Id": 920, "PostId": 366, "Score": 0, "Text": "A study is unbiased based on its methods. It has nothing to do with morals. Just because a study may show evidence that negates a practice does not mean that the study is biased. One still needs to evaluate the study's biasedness based on its own merits, not on the quality of the researchers.", "CreationDate": "2015-08-11T13:33:21.463", "UserId": 251}
{"Id": 921, "PostId": 366, "Score": 0, "Text": "Before spending more time on answering/asking here, better read this: http://meta.sexuality.stackexchange.com/questions/120/sexuality-se-will-be-closing-on-fri-8-14", "CreationDate": "2015-08-11T13:36:02.910", "UserId": 61}
{"Id": 922, "PostId": 366, "Score": 0, "Text": "As the Sexuality.SE tries to provide fact-based answers, it is crucial that everyone supports his or her answers with evidence, quotes, or some sort of proof. As it is, I see no references. Your answer seems good, but it can be better with references.", "CreationDate": "2015-08-11T13:39:02.087", "UserId": 251}
{"Id": 923, "PostId": 366, "Score": 0, "Text": "@DoubleU Apparently it doesn't matter anyways. However, as far as this question goes, the lack of references stems from the serious research I put into this answer before answering. I always assumed that there would be serious studies on this effect, since virtually everyone \"knows\" this, and what I found is that the evidence is largely anecdotal. Anyone *against* this practice seemed to do so for religious or homeopathic reasons, including the \"your hair will fall out, you'll go blind, etc,\" and everyone else simply accepted based on word of mouth.", "CreationDate": "2015-08-11T13:49:54.230", "UserId": 253}
{"Id": 924, "PostId": 366, "Score": 0, "Text": "@DoubleU I think the only conclusive evidence that can be taken away is that either there have been no serious studies on the short-term effects, how to maximize those effects, why it works, etc, or such works are so inconsequential, biased, etc, that they have been buried. I was actually hoping that someone would counter this answer with proof that there were serious scientific studies, and I was simply looking in the wrong places.", "CreationDate": "2015-08-11T13:54:08.740", "UserId": 253}
{"Id": 925, "PostId": 366, "Score": 0, "Text": "You know, inclusion of a study and an explanation of why you think it's biased would be definitely useful for your answer. Something that goes against your position doesn't mean you should ignore it. Just include it, but also explain why you think it's biased, that is on what grounds is the study biased.", "CreationDate": "2015-08-11T15:07:32.320", "UserId": 251}
{"Id": 926, "PostId": 366, "Score": 0, "Text": "We must assume that all scientific studies are made in good faith, and that their methods may be biased, not because of politics or personal convictions, but because of flawed experimental designs.", "CreationDate": "2015-08-11T18:04:42.730", "UserId": 251}
{"Id": 933, "PostId": 372, "Score": 0, "Text": "Welcome to Sexuality SE!  (Although from the looks of things, it's going to be a brief stay.... sigh...)", "CreationDate": "2015-08-13T06:48:20.840", "UserId": 228}
{"Id": 948, "PostId": 373, "Score": 0, "Text": "Sources would greatly improve this answer!", "CreationDate": "2015-08-13T19:14:55.623", "UserId": 64}
{"Id": 950, "PostId": 373, "Score": 0, "Text": "I wonder what is the physiological mechanism of this phenomenon.", "CreationDate": "2015-08-13T22:43:29.713", "UserId": 251}
